itzandroidtab/klib-svd/mb9bf566k.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- ******************************************************************************* -->
<!-- Copyright (C) 2013 Spansion LLC. All Rights Reserved.                           -->
<!--                                                                                 -->
<!-- This software is owned and published by:                                        -->
<!-- Spansion LLC, 915 DeGuigne Dr. Sunnyvale, CA  94088-3453 ("Spansion").          -->
<!--                                                                                 -->
<!-- BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND        -->
<!-- BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.                              -->
<!--                                                                                 -->
<!-- This software contains source code for use with Spansion                        -->
<!-- components. This software is licensed by Spansion to be adapted only            -->
<!-- for use in systems utilizing Spansion components. Spansion shall not be         -->
<!-- responsible for misuse or illegal use of this software for devices not          -->
<!-- supported herein.  Spansion is providing this software "AS IS" and will         -->
<!-- not be responsible for issues arising from incorrect user implementation        -->
<!-- of the software.                                                                -->
<!--                                                                                 -->
<!-- SPANSION MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,    -->
<!-- REGARDING THE SOFTWARE (INCLUDING ANY ACOOMPANYING WRITTEN MATERIALS),          -->
<!-- ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,                -->
<!-- WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED        -->
<!-- WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED            -->
<!-- WARRANTY OF NONINFRINGEMENT.                                                    -->
<!-- SPANSION SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,          -->
<!-- NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT         -->
<!-- LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,        -->
<!-- LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR      -->
<!-- INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,       -->
<!-- INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,         -->
<!-- SAVINGS OR PROFITS,                                                             -->
<!-- EVEN IF SPANSION HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.           -->
<!-- YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR   -->
<!-- INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED     -->
<!-- FROM, THE SOFTWARE.                                                             -->
<!--                                                                                 -->
<!-- This software may be replicated in part or whole for the licensed use,          -->
<!-- with the restriction that this Disclaimer and Copyright notice must be          -->
<!-- included with each copy of this software, whether used in part or whole,        -->
<!-- at all times.                                                                   -->
<!-- ******************************************************************************* -->
<!-- 2014.6.20 generated by svdgen_v03a -->
<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
    xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
    <name>mb9bf566k</name>
    <vendor>Cypress</vendor>
    <series>mb9bf560l</series>
    <version>1.2</version>
    <description>MB9B560L Series Microcontroller</description>
    <cpu>
        <name>CM4</name>
        <revision>r0p1</revision>
        <endian>little</endian>
        <mpuPresent>true</mpuPresent>
        <fpuPresent>true</fpuPresent>
        <nvicPrioBits>4</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <peripherals>
        <!-- ************************************************************************************** -->
        <!-- peripheral:WorkFlashMemory -->
        <!-- ************************************************************************************** -->
        <!-- PERIPHERAL "WORKFLASH_IF" -->
        <peripheral>
            <name>WORKFLASH_IF</name>
            <description>WorkFlash Memory</description>
            <groupName>WORKFLASH_IF</groupName>
            <baseAddress>0x200E0000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "WFASZR" -->
                <register>
                    <name>WFASZR</name>
                    <description>WorkFlash Access Size Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0x01</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ASZ" -->
                        <field>
                            <name>ASZ</name>
                            <description>WorkFlash Access Size</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WFRWTR" -->
                <register>
                    <name>WFRWTR</name>
                    <description>WorkFlash Read Wait Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x04</resetValue>
                    <resetMask>0x07</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RWT" -->
                        <field>
                            <name>RWT</name>
                            <description>Read Wait Cycle</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WFSTR" -->
                <register>
                    <name>WFSTR</name>
                    <description>WorkFlash Status Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "HNG" -->
                        <field>
                            <name>HNG</name>
                            <description>WorkFlash Hang</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RDY" -->
                        <field>
                            <name>RDY</name>
                            <description>WorkFlash Rdy</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
