itzandroidtab/klib-svd/mb9bf566k.svd
            </registers>
        </peripheral>
        <!-- PERIPHERAL "FLASH_IF" -->
        <peripheral>
            <name>FLASH_IF</name>
            <description>Flash Memory</description>
            <groupName>FLASH_IF</groupName>
            <baseAddress>0x40000000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0x8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>0xC</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "FLASH" -->
            <interrupt>
                <name>FLASH</name>
                <value>119</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "FASZR" -->
                <register>
                    <name>FASZR</name>
                    <description>Flash Access Size Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ASZ" -->
                        <field>
                            <name>ASZ</name>
                            <description>Access Size</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "FRWTR" -->
                <register>
                    <name>FRWTR</name>
                    <description>Flash Read Wait Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RWT" -->
                        <field>
                            <name>RWT</name>
                            <description>Read Wait Cycle</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "FSTR" -->
                <register>
                    <name>FSTR</name>
                    <description>Flash Status Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ERR" -->
                        <field>
                            <name>ERR</name>
                            <description>Flash ECC Error</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "HNG" -->
                        <field>
                            <name>HNG</name>
                            <description>Flash Hang flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RDY" -->
                        <field>
                            <name>RDY</name>
                            <description>Flash Rdy</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "FSYNDN" -->
                <register>
                    <name>FSYNDN</name>
                    <description>Flash Sync Down Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SD" -->
                        <field>
                            <name>SD</name>
                            <description>Sync Down</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "FBFCR" -->
                <register>
                    <name>FBFCR</name>
                    <description>Flash Buffer Control Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BS" -->
                        <field>
                            <name>BS</name>
                            <description>Buffer Status</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BE" -->
                        <field>
                            <name>BE</name>
                            <description>Buffer Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
