itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "FICR" -->
                <register>
                    <name>FICR</name>
                    <description>Flash Interrupt Control Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ERRIE" -->
                        <field>
                            <name>ERRIE</name>
                            <description>Flash ECC Error Interrupt Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "HANGIE" -->
                        <field>
                            <name>HANGIE</name>
                            <description>HANG Interrupt Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RDYIE" -->
                        <field>
                            <name>RDYIE</name>
                            <description>RDY Interrupt Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "FISR" -->
                <register>
                    <name>FISR</name>
                    <description>Flash Interrupt Status Register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ERRIF" -->
                        <field>
                            <name>ERRIF</name>
                            <description>Flash ECC Error Interrupt Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "HANGIF" -->
                        <field>
                            <name>HANGIF</name>
                            <description>HANG Interrupt Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RDYIF" -->
                        <field>
                            <name>RDYIF</name>
                            <description>RDY Interrupt Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "FICLR" -->
                <register>
                    <name>FICLR</name>
                    <description>Flash Interrupt Clear Register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ERRIC" -->
                        <field>
                            <name>ERRIC</name>
                            <description>Flash ECC Error Interrupt Clear</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "HANGIC" -->
                        <field>
                            <name>HANGIC</name>
                            <description>HANG Interrupt Clear </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RDYIC" -->
                        <field>
                            <name>RDYIC</name>
                            <description>RDY Interrupt Clear</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CRTRMM" -->
                <register>
                    <name>CRTRMM</name>
                    <description>CR Trimming Data Mirror Register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TTRMM" -->
                        <field>
                            <name>TTRMM</name>
                            <description>CR Temperature Trimming Data Mirror</description>
                            <lsb>16</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TRMM" -->
                        <field>
                            <name>TRMM</name>
                            <description>CR Trimming Data Mirror</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
