itzandroidtab/klib-svd/mb9bf566k.svd
            </registers>
        </peripheral>
        <!-- PERIPHERAL "UNIQUE_ID" -->
        <peripheral>
            <name>UNIQUE_ID</name>
            <description>Unique ID</description>
            <groupName>UNIQUE_ID</groupName>
            <baseAddress>0x40000200</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "UIDR0" -->
                <register>
                    <name>UIDR0</name>
                    <description>Unique ID Register 0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFF0</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "UID" -->
                        <field>
                            <name>UID</name>
                            <description>Unique ID 27 through 0</description>
                            <lsb>4</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "UIDR1" -->
                <register>
                    <name>UIDR1</name>
                    <description>Unique ID Register 1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00001FFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "UID" -->
                        <field>
                            <name>UID</name>
                            <description>Unique ID 40 through 28</description>
                            <lsb>0</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "ECC_CAPTURE" -->
        <peripheral>
            <name>ECC_CAPTURE</name>
            <description>ECC Capture Address</description>
            <groupName>ECC_CAPTURE</groupName>
            <baseAddress>0x40000300</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "FERRAD" -->
                <register>
                    <name>FERRAD</name>
                    <description>Flash ECC Error Address Capture Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x007FFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ERRAD" -->
                        <field>
                            <name>ERRAD</name>
                            <description>Flash ECC Error Address Capture</description>
                            <lsb>0</lsb>
                            <msb>22</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "CRG" -->
        <peripheral>
            <name>CRG</name>
            <description>Clock Unit Registers</description>
            <groupName>CRG</groupName>
            <baseAddress>0x40010000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x70</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "CSV" -->
            <interrupt>
                <name>CSV</name>
                <value>0</value>
            </interrupt>
            <!-- INTERRUPT "TIM" -->
            <interrupt>
                <name>TIM</name>
                <value>59</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "SCM_CTL" -->
                <register>
                    <name>SCM_CTL</name>
                    <description>System Clock Mode Control Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFA</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RCS" -->
                        <field>
                            <name>RCS</name>
                            <description>Master clock switch control bits </description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PLLE" -->
                        <field>
                            <name>PLLE</name>
                            <description>PLL oscillation enable bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOSCE" -->
                        <field>
                            <name>SOSCE</name>
                            <description>Sub clock oscillation enable bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MOSCE" -->
                        <field>
                            <name>MOSCE</name>
                            <description>Main clock oscillation enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "SCM_STR" -->
                <register>
                    <name>SCM_STR</name>
                    <description>System Clock Mode Status Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFA</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RCM" -->
                        <field>
                            <name>RCM</name>
                            <description>Master clock selection bits </description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "PLRDY" -->
                        <field>
                            <name>PLRDY</name>
                            <description>PLL oscillation stable bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "SORDY" -->
                        <field>
                            <name>SORDY</name>
                            <description>Sub clock oscillation stable bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MORDY" -->
                        <field>
                            <name>MORDY</name>
                            <description>Main clock oscillation stable bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "BSC_PSR" -->
                <register>
                    <name>BSC_PSR</name>
                    <description>Base Clock Prescaler Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x07</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BSR" -->
                        <field>
                            <name>BSR</name>
                            <description>Base clock frequency division ratio setting bit </description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "APBC0_PSR" -->
                <register>
                    <name>APBC0_PSR</name>
                    <description>APB0 Prescaler Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "APBC0" -->
                        <field>
                            <name>APBC0</name>
                            <description>APB0 bus clock frequency division ratio setting bit </description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "APBC1_PSR" -->
                <register>
                    <name>APBC1_PSR</name>
                    <description>APB1 Prescaler Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x93</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "APBC1EN" -->
                        <field>
                            <name>APBC1EN</name>
                            <description>APB1 clock enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "APBC1RST" -->
                        <field>
                            <name>APBC1RST</name>
                            <description>APB1 bus reset control bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "APBC1" -->
                        <field>
                            <name>APBC1</name>
                            <description>APB1 bus clock frequency division ratio setting bit </description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "APBC2_PSR" -->
                <register>
                    <name>APBC2_PSR</name>
                    <description>APB2 Prescaler Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x93</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "APBC2EN" -->
                        <field>
                            <name>APBC2EN</name>
                            <description>APB2 clock enable bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "APBC2RST" -->
                        <field>
                            <name>APBC2RST</name>
                            <description>APB2 bus reset control bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "APBC2" -->
                        <field>
                            <name>APBC2</name>
                            <description>APB2 bus clock frequency division ratio setting bit </description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "SWC_PSR" -->
                <register>
                    <name>SWC_PSR</name>
                    <description>Software Watchdog Clock Prescaler Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TESTB" -->
                        <field>
                            <name>TESTB</name>
                            <description>TEST bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SWDS" -->
                        <field>
                            <name>SWDS</name>
                            <description>Software watchdog clock frequency division ratio setting
                                bit </description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
