itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "TTC_PSR" -->
                <register>
                    <name>TTC_PSR</name>
                    <description>Trace Clock Prescaler Register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TTC" -->
                        <field>
                            <name>TTC</name>
                            <description>Trace clock frequency division ratio setting bit</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CSW_TMR" -->
                <register>
                    <name>CSW_TMR</name>
                    <description>Clock Stabilization Wait Time Register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SOWT" -->
                        <field>
                            <name>SOWT</name>
                            <description>Sub clock stabilization wait time setup bit </description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MOWT" -->
                        <field>
                            <name>MOWT</name>
                            <description>Main clock stabilization wait time setup bit </description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PSW_TMR" -->
                <register>
                    <name>PSW_TMR</name>
                    <description>PLL Clock Stabilization Wait Time Setup Register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x17</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "PINC" -->
                        <field>
                            <name>PINC</name>
                            <description>PLL input clock select bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "POWT" -->
                        <field>
                            <name>POWT</name>
                            <description>PLL clock stabilization wait time setup bit </description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PLL_CTL1" -->
                <register>
                    <name>PLL_CTL1</name>
                    <description>PLL Control Register 1</description>
                    <addressOffset>0x38</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "PLLK" -->
                        <field>
                            <name>PLLK</name>
                            <description>PLL input clock frequency division ratio setting bit </description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PLLM" -->
                        <field>
                            <name>PLLM</name>
                            <description>PLL VCO clock frequency division ratio setting bit </description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PLL_CTL2" -->
                <register>
                    <name>PLL_CTL2</name>
                    <description>PLL Control Register 2</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "PLLN" -->
                        <field>
                            <name>PLLN</name>
                            <description>PLL feedback frequency division ratio setting bit </description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "DBWDT_CTL" -->
                <register>
                    <name>DBWDT_CTL</name>
                    <description>Debug Break Watchdog Timer Control Register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xA0</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DPHWBE" -->
                        <field>
                            <name>DPHWBE</name>
                            <description>HW-WDG debug mode break bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DPSWBE" -->
                        <field>
                            <name>DPSWBE</name>
                            <description>SW-WDG debug mode break bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "INT_ENR" -->
                <register>
                    <name>INT_ENR</name>
                    <description> Interrupt Enable Register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x27</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FCSE" -->
                        <field>
                            <name>FCSE</name>
                            <description>Anomalous frequency detection interrupt enable bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PCSE" -->
                        <field>
                            <name>PCSE</name>
                            <description>PLL oscillation stabilization completion interrupt enable
                                bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SCSE" -->
                        <field>
                            <name>SCSE</name>
                            <description>Sub oscillation stabilization completion interrupt enable
                                bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MCSE" -->
                        <field>
                            <name>MCSE</name>
                            <description>Main oscillation stabilization completion interrupt enable
                                bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "INT_STR" -->
                <register>
                    <name>INT_STR</name>
                    <description>Interrupt Status Register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x27</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FCSI" -->
                        <field>
                            <name>FCSI</name>
                            <description>Anomalous frequency detection interrupt status bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "PCSI" -->
                        <field>
                            <name>PCSI</name>
                            <description>PLL oscillation stabilization completion interrupt status
                                bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "SCSI" -->
                        <field>
                            <name>SCSI</name>
                            <description>Sub oscillation stabilization completion interrupt status
                                bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MCSI" -->
                        <field>
                            <name>MCSI</name>
                            <description>Main oscillation stabilization completion interrupt status
                                bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "INT_CLR" -->
                <register>
                    <name>INT_CLR</name>
                    <description>Interrupt Clear Register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x27</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FCSC" -->
                        <field>
                            <name>FCSC</name>
                            <description>Anomalous frequency detection interrupt cause clear bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "PCSC" -->
                        <field>
                            <name>PCSC</name>
                            <description>PLL oscillation stabilization completion interrupt cause
                                clear bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "SCSC" -->
                        <field>
                            <name>SCSC</name>
                            <description>Sub oscillation stabilization completion interrupt cause
                                clear bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "MCSC" -->
                        <field>
                            <name>MCSC</name>
                            <description>Main oscillation stabilization completion interrupt cause
                                clear bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
