itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "FCSWH_CTL" -->
                <register>
                    <name>FCSWH_CTL</name>
                    <description>Frequency detection window setting register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FWH" -->
                        <field>
                            <name>FWH</name>
                            <description>Frequency detection window setting bits (Upper)</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "FCSWL_CTL" -->
                <register>
                    <name>FCSWL_CTL</name>
                    <description>Frequency detection window setting register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FWL" -->
                        <field>
                            <name>FWL</name>
                            <description>Frequency detection window setting bits (Lower)</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "FCSWD_CTL" -->
                <register>
                    <name>FCSWD_CTL</name>
                    <description>Frequency detection counter register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FWD" -->
                        <field>
                            <name>FWD</name>
                            <description>Frequency detection count data</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "CRTRIM" -->
        <peripheral>
            <name>CRTRIM</name>
            <description>CR Trimming Registers</description>
            <groupName>CRTRIM</groupName>
            <baseAddress>0x4002E000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "MCR_PSR" -->
                <register>
                    <name>MCR_PSR</name>
                    <description>High-speed CR oscillation Frequency Division Setup Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0x07</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CSR" -->
                        <field>
                            <name>CSR</name>
                            <description>High-speed CR oscillation frequency division ratio setting
                                bits</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "MCR_FTRM" -->
                <register>
                    <name>MCR_FTRM</name>
                    <description>High-speed CR oscillation Frequency Trimming Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x01EF</resetValue>
                    <resetMask>0x03FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TRD" -->
                        <field>
                            <name>TRD</name>
                            <description>Frequency trimming setup bits</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "MCR_TTRM" -->
                <register>
                    <name>MCR_TTRM</name>
                    <description>High-speed CR oscillation Temperature Trimming Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0x1F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TRT" -->
                        <field>
                            <name>TRT</name>
                            <description>Temperature trimming setup bits</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "MCR_RLR" -->
                <register>
                    <name>MCR_RLR</name>
                    <description>High-Speed CR Oscillation Register Write-Protect Register </description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TRMLCK" -->
                        <field>
                            <name>TRMLCK</name>
                            <description>Register write-protect bits</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
