itzandroidtab/klib-svd/mb9bf566k.svd
            </registers>
        </peripheral>
        <!-- PERIPHERAL "SWWDT" -->
        <peripheral>
            <name>SWWDT</name>
            <description>Software Watchdog Timer</description>
            <groupName>SWWDT</groupName>
            <baseAddress>0x40012000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC00</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "SWDT" -->
            <interrupt>
                <name>SWDT</name>
                <value>1</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "WDOGLOAD" -->
                <register>
                    <name>WDOGLOAD</name>
                    <description>Software Watchdog Timer Load Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!-- REGISTER "WDOGVALUE" -->
                <register>
                    <name>WDOGVALUE</name>
                    <description>Software Watchdog Timer Value Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!-- REGISTER "WDOGCONTROL" -->
                <register>
                    <name>WDOGCONTROL</name>
                    <description>Software Watchdog Timer Control Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x1F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SPM" -->
                        <field>
                            <name>SPM</name>
                            <description>Software Watchdog window watchdog mode enable bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TWD" -->
                        <field>
                            <name>TWD</name>
                            <description>Timing window setting bit of the software watchdog</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RESEN" -->
                        <field>
                            <name>RESEN</name>
                            <description>Reset enable bit of the software watchdog</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTEN" -->
                        <field>
                            <name>INTEN</name>
                            <description>Interrupt and counter enable bit of the software watchdog </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WDOGINTCLR" -->
                <register>
                    <name>WDOGINTCLR</name>
                    <description>Software Watchdog Timer Clear Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!-- REGISTER "WDOGRIS" -->
                <register>
                    <name>WDOGRIS</name>
                    <description>Software Watchdog Timer Interrupt Status Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x01</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RIS" -->
                        <field>
                            <name>RIS</name>
                            <description>Software watchdog interrupt status bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WDOGSPMC" -->
                <register>
                    <name>WDOGSPMC</name>
                    <description>Software Watchdog Timer Window Watchdog Mode Control Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x01</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TGR" -->
                        <field>
                            <name>TGR</name>
                            <description>Software watchdog trigger type bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
