itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "WDOGLOCK" -->
                <register>
                    <name>WDOGLOCK</name>
                    <description>Software Watchdog Timer Lock Register</description>
                    <addressOffset>0xC00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "HWWDT" -->
        <peripheral>
            <name>HWWDT</name>
            <description>Hardware Watchdog Timer</description>
            <groupName>HWWDT</groupName>
            <baseAddress>0x40011000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC00</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "WDG_LDR" -->
                <register>
                    <name>WDG_LDR</name>
                    <description>Hardware Watchdog Timer Load Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!-- REGISTER "WDG_VLR" -->
                <register>
                    <name>WDG_VLR</name>
                    <description>Hardware Watchdog Timer Value Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!-- REGISTER "WDG_CTL" -->
                <register>
                    <name>WDG_CTL</name>
                    <description>Hardware Watchdog Timer Control Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RESEN" -->
                        <field>
                            <name>RESEN</name>
                            <description>Hardware watchdog reset enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTEN" -->
                        <field>
                            <name>INTEN</name>
                            <description>Hardware watchdog interrupt and counter enable bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WDG_ICL" -->
                <register>
                    <name>WDG_ICL</name>
                    <description>Hardware Watchdog Timer Clear Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0x00</resetMask>
                </register>
                <!-- REGISTER "WDG_RIS" -->
                <register>
                    <name>WDG_RIS</name>
                    <description>Hardware Watchdog Timer Interrupt Status Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0x00</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RIS" -->
                        <field>
                            <name>RIS</name>
                            <description>Hardware watchdog interrupt status bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WDG_LCK" -->
                <register>
                    <name>WDG_LCK</name>
                    <description>Hardware Watchdog Timer Lock Register</description>
                    <addressOffset>0xC00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
