itzandroidtab/klib-svd/mb9bf566k.svd
            </registers>
        </peripheral>
        <!-- PERIPHERAL "DTIM" -->
        <peripheral>
            <name>DTIM</name>
            <description>Dual Timer</description>
            <groupName>DTIM</groupName>
            <baseAddress>0x40015000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "DT1_2" -->
            <interrupt>
                <name>DT1_2</name>
                <value>47</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "TIMER1LOAD" -->
                <register>
                    <name>TIMER1LOAD</name>
                    <description>Load Register</description>
                    <alternateGroup>DualTimer1</alternateGroup>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!-- REGISTER "TIMER1VALUE" -->
                <register>
                    <name>TIMER1VALUE</name>
                    <description>Value Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!-- REGISTER "TIMER1CONTROL" -->
                <register>
                    <name>TIMER1CONTROL</name>
                    <description>Control Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000020</resetValue>
                    <resetMask>0x000000EF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TimerEn" -->
                        <field>
                            <name>TimerEn</name>
                            <description>Enable bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TimerMode" -->
                        <field>
                            <name>TimerMode</name>
                            <description>Mode bit </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IntEnable" -->
                        <field>
                            <name>IntEnable</name>
                            <description>Interrupt enable bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TimerPre" -->
                        <field>
                            <name>TimerPre</name>
                            <description>Prescale bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TimerSize" -->
                        <field>
                            <name>TimerSize</name>
                            <description>Counter size bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OneShot" -->
                        <field>
                            <name>OneShot</name>
                            <description>One-shot mode bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "TIMER1INTCLR" -->
                <register>
                    <name>TIMER1INTCLR</name>
                    <description>Interrupt Clear Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                </register>
                <!-- REGISTER "TIMER1RIS" -->
                <register>
                    <name>TIMER1RIS</name>
                    <description>Interrupt Status Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TIMER1RIS" -->
                        <field>
                            <name>TIMER1RIS</name>
                            <description>Interrupt Status Register bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "TIMER1MIS" -->
                <register>
                    <name>TIMER1MIS</name>
                    <description>Masked Interrupt Status Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TIMER1MIS" -->
                        <field>
                            <name>TIMER1MIS</name>
                            <description>Masked Interrupt Status bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "TIMER1BGLOAD" -->
                <register>
                    <name>TIMER1BGLOAD</name>
                    <description>Background Load Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!-- REGISTER "TIMER2LOAD" -->
                <register derivedFrom="TIMER1LOAD">
                    <name>TIMER2LOAD</name>
                    <description>Load Register</description>
                    <addressOffset>0x20</addressOffset>
                </register>
                <!-- REGISTER "TIMER2VALUE" -->
                <register derivedFrom="TIMER1VALUE">
                    <name>TIMER2VALUE</name>
                    <description>Value Register</description>
                    <addressOffset>0x24</addressOffset>
                </register>
                <!-- REGISTER "TIMER2CONTROL" -->
                <register derivedFrom="TIMER1CONTROL">
                    <name>TIMER2CONTROL</name>
                    <description>Control Register</description>
                    <addressOffset>0x28</addressOffset>
                </register>
