itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "FRT_TCDT1" -->
                <register derivedFrom="FRT_TCDT0">
                    <name>FRT_TCDT1</name>
                    <description>FRT-ch.1 Count Value Register</description>
                    <addressOffset>0x152</addressOffset>
                </register>
                <!-- REGISTER "FRT_TCSA1" -->
                <register derivedFrom="FRT_TCSA0">
                    <name>FRT_TCSA1</name>
                    <description>FRT-ch.1 Control Register A</description>
                    <addressOffset>0x154</addressOffset>
                </register>
                <!-- REGISTER "FRT_TCSC1" -->
                <register derivedFrom="FRT_TCSC0">
                    <name>FRT_TCSC1</name>
                    <description>FRT-ch.1 Control Register C</description>
                    <addressOffset>0x156</addressOffset>
                </register>
                <!-- REGISTER "FRT_TCCP2" -->
                <register derivedFrom="FRT_TCCP0">
                    <name>FRT_TCCP2</name>
                    <description>FRT-ch.2 Cycle Setting Register</description>
                    <addressOffset>0x15A</addressOffset>
                </register>
                <!-- REGISTER "FRT_TCDT2" -->
                <register derivedFrom="FRT_TCDT0">
                    <name>FRT_TCDT2</name>
                    <description>FRT-ch.2 Count Value Register</description>
                    <addressOffset>0x15E</addressOffset>
                </register>
                <!-- REGISTER "FRT_TCSA2" -->
                <register derivedFrom="FRT_TCSA0">
                    <name>FRT_TCSA2</name>
                    <description>FRT-ch.2 Control Register A</description>
                    <addressOffset>0x160</addressOffset>
                </register>
                <!-- REGISTER "FRT_TCSC2" -->
                <register derivedFrom="FRT_TCSC0">
                    <name>FRT_TCSC2</name>
                    <description>FRT-ch.2 Control Register C</description>
                    <addressOffset>0x162</addressOffset>
                </register>
                <!-- REGISTER "FRT_TCAL" -->
                <register>
                    <name>FRT_TCAL</name>
                    <description>FRT Simultaneous Start Control Register</description>
                    <addressOffset>0x164</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000FFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SCLR22" -->
                        <field>
                            <name>SCLR22</name>
                            <description>Mirror register of the SCLR bit located in TCSA2 register
                                of MFT-unit2</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "SCLR21" -->
                        <field>
                            <name>SCLR21</name>
                            <description>Mirror register of the SCLR bit located in TCSA1 register
                                of MFT-unit2</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "SCLR20" -->
                        <field>
                            <name>SCLR20</name>
                            <description>Mirror register of the SCLR bit located in TCSA0 register
                                of MFT-unit2</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "SCLR12" -->
                        <field>
                            <name>SCLR12</name>
                            <description>Mirror register of the SCLR bit located in TCSA2 register
                                of MFT-unit1</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "SCLR11" -->
                        <field>
                            <name>SCLR11</name>
                            <description>Mirror register of the SCLR bit located in TCSA1 register
                                of MFT-unit1</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "SCLR10" -->
                        <field>
                            <name>SCLR10</name>
                            <description>Mirror register of the SCLR bit located in TCSA0 register
                                of MFT-unit1</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "SCLR02" -->
                        <field>
                            <name>SCLR02</name>
                            <description>Mirror register of the SCLR bit located in TCSA2 register
                                of MFT-unit0</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "SCLR01" -->
                        <field>
                            <name>SCLR01</name>
                            <description>Mirror register of the SCLR bit located in TCSA1 register
                                of MFT-unit0</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "SCLR00" -->
                        <field>
                            <name>SCLR00</name>
                            <description>Mirror register of the SCLR bit located in TCSA0 register
                                of MFT-unit0</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "STOP22" -->
                        <field>
                            <name>STOP22</name>
                            <description>Mirror register of the STOP bit located in TCSA2 register
                                of MFT-unit2</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STOP21" -->
                        <field>
                            <name>STOP21</name>
                            <description>Mirror register of the STOP bit located in TCSA1 register
                                of MFT-unit2</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STOP20" -->
                        <field>
                            <name>STOP20</name>
                            <description>Mirror register of the STOP bit located in TCSA0 register
                                of MFT-unit2</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STOP12" -->
                        <field>
                            <name>STOP12</name>
                            <description>Mirror register of the STOP bit located in TCSA2 register
                                of MFT-unit1</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STOP11" -->
                        <field>
                            <name>STOP11</name>
                            <description>Mirror register of the STOP bit located in TCSA1 register
                                of MFT-unit1</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STOP10" -->
                        <field>
                            <name>STOP10</name>
                            <description>Mirror register of the STOP bit located in TCSA0 register
                                of MFT-unit1</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STOP02" -->
                        <field>
                            <name>STOP02</name>
                            <description>Mirror register of the STOP bit located in TCSA2 register
                                of MFT-unit0</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STOP01" -->
                        <field>
                            <name>STOP01</name>
                            <description>Mirror register of the STOP bit located in TCSA1 register
                                of MFT-unit0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STOP00" -->
                        <field>
                            <name>STOP00</name>
                            <description>Mirror register of the STOP bit located in TCSA0 register
                                of MFT-unit0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
