itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "OCU_OCCP0" -->
                <register>
                    <name>OCU_OCCP0</name>
                    <description>OCU ch.0 Compare Value Store Register</description>
                    <addressOffset>0x102</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <!-- REGISTER "OCU_OCCP1" -->
                <register derivedFrom="OCU_OCCP0">
                    <name>OCU_OCCP1</name>
                    <description>OCU ch.1 Compare Value Store Register</description>
                    <addressOffset>0x106</addressOffset>
                </register>
                <!-- REGISTER "OCU_OCCP2" -->
                <register derivedFrom="OCU_OCCP0">
                    <name>OCU_OCCP2</name>
                    <description>OCU ch.2 Compare Value Store Register</description>
                    <addressOffset>0x10A</addressOffset>
                </register>
                <!-- REGISTER "OCU_OCCP3" -->
                <register derivedFrom="OCU_OCCP0">
                    <name>OCU_OCCP3</name>
                    <description>OCU ch.3 Compare Value Store Register</description>
                    <addressOffset>0x10E</addressOffset>
                </register>
                <!-- REGISTER "OCU_OCCP4" -->
                <register derivedFrom="OCU_OCCP0">
                    <name>OCU_OCCP4</name>
                    <description>OCU ch.4 Compare Value Store Register</description>
                    <addressOffset>0x112</addressOffset>
                </register>
                <!-- REGISTER "OCU_OCCP5" -->
                <register derivedFrom="OCU_OCCP0">
                    <name>OCU_OCCP5</name>
                    <description>OCU ch.5 Compare Value Store Register</description>
                    <addressOffset>0x116</addressOffset>
                </register>
                <!-- REGISTER "OCU_OCSA10" -->
                <register>
                    <name>OCU_OCSA10</name>
                    <description>OCU ch.0/1 Control Register A</description>
                    <addressOffset>0x118</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xF3</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IOP1" -->
                        <field>
                            <name>IOP1</name>
                            <description>Indicates that a match has already been detected between
                                FRT's count value and OCCP(1) value at OCU ch.(1).</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IOP0" -->
                        <field>
                            <name>IOP0</name>
                            <description>Indicates that a match has already been detected between
                                FRT's count value and OCCP(0) value at OCU ch.(0). </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IOE1" -->
                        <field>
                            <name>IOE1</name>
                            <description>"Generates interrupt, when ""1"" is set to OCSA.IOP1"</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IOE0" -->
                        <field>
                            <name>IOE0</name>
                            <description>"Generates interrupt, when ""1"" is set to OCSA.IOP0"</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CST1" -->
                        <field>
                            <name>CST1</name>
                            <description>Enables the operation of OCU ch.(1)</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CST0" -->
                        <field>
                            <name>CST0</name>
                            <description>Enables the operation of OCU ch.(0)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "OCU_OCSB10" -->
                <register>
                    <name>OCU_OCSB10</name>
                    <description>OCU ch.0/1 Control Register B</description>
                    <addressOffset>0x119</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x93</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FM4" -->
                        <field>
                            <name>FM4</name>
                            <description>selects FM4 mode for operating mode</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CMOD" -->
                        <field>
                            <name>CMOD</name>
                            <description>selects OCU's operation mode in combination with OCSC.MOD0
                                to MOD5</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OTD1" -->
                        <field>
                            <name>OTD1</name>
                            <description>Indicates that the RT(1) output pin is in the High-level
                                output state.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OTD0" -->
                        <field>
                            <name>OTD0</name>
                            <description>Indicates that the RT(0) output pin is in the High-level
                                output state.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "OCU_OCSD10" -->
                <register>
                    <name>OCU_OCSD10</name>
                    <description>OCU ch.0/1 Control Register D</description>
                    <addressOffset>0x11A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "OCSE1BUFE" -->
                        <field>
                            <name>OCSE1BUFE</name>
                            <description>Enable buffer register function of OCSE(1)</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OCSE0BUFE" -->
                        <field>
                            <name>OCSE0BUFE</name>
                            <description>Enable buffer register function of OCSE(0)</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OCCP1BUFE" -->
                        <field>
                            <name>OCCP1BUFE</name>
                            <description>Enable buffer register function of OCCP(1)</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OCCP0BUFE" -->
                        <field>
                            <name>OCCP0BUFE</name>
                            <description>Enable buffer register function of OCCP(0)</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "OCU_OCSA32" -->
                <register derivedFrom="OCU_OCSA10">
                    <name>OCU_OCSA32</name>
                    <description>OCU ch.2/3 Control Register A</description>
                    <addressOffset>0x11C</addressOffset>
                </register>
                <!-- REGISTER "OCU_OCSB32" -->
                <register derivedFrom="OCU_OCSB10">
                    <name>OCU_OCSB32</name>
                    <description>OCU ch.2/3 Control Register B</description>
                    <addressOffset>0x11D</addressOffset>
                </register>
                <!-- REGISTER "OCU_OCSD32" -->
                <register derivedFrom="OCU_OCSD10">
                    <name>OCU_OCSD32</name>
                    <description>OCU ch.2/3 Control Register D</description>
                    <addressOffset>0x11E</addressOffset>
                </register>
                <!-- REGISTER "OCU_OCSA54" -->
                <register derivedFrom="OCU_OCSA10">
                    <name>OCU_OCSA54</name>
                    <description>OCU ch.4/5 Control Register A</description>
                    <addressOffset>0x120</addressOffset>
                </register>
                <!-- REGISTER "OCU_OCSB54" -->
                <register derivedFrom="OCU_OCSB10">
                    <name>OCU_OCSB54</name>
                    <description>OCU ch.4/5 Control Register B</description>
                    <addressOffset>0x121</addressOffset>
                </register>
                <!-- REGISTER "OCU_OCSD54" -->
                <register derivedFrom="OCU_OCSD10">
                    <name>OCU_OCSD54</name>
                    <description>OCU ch.4/5 Control Register D</description>
                    <addressOffset>0x122</addressOffset>
                </register>
                <!-- REGISTER "OCU_OCSC" -->
                <register>
                    <name>OCU_OCSC</name>
                    <description>OCU Control Register C</description>
                    <addressOffset>0x124</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x3F00</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MOD5" -->
                        <field>
                            <name>MOD5</name>
                            <description>OCSC.MOD4 and OCSC.MOD5 determine the operation mode of OCU
                                ch.4/ch.5 in combination with OCSB54.CMOD</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MOD4" -->
                        <field>
                            <name>MOD4</name>
                            <description>OCSC.MOD4 and OCSC.MOD5 determine the operation mode of OCU
                                ch.4/ch.5 in combination with OCSB54.CMOD</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MOD3" -->
                        <field>
                            <name>MOD3</name>
                            <description>OCSC.MOD2 and OCSC.MOD3 determine the operation mode of OCU
                                ch.2/ch.3 in combination with OCSB32.CMOD</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MOD2" -->
                        <field>
                            <name>MOD2</name>
                            <description>OCSC.MOD2 and OCSC.MOD3 determine the operation mode of OCU
                                ch.2/ch.3 in combination with OCSB32.CMOD</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MOD1" -->
                        <field>
                            <name>MOD1</name>
                            <description>OCSC.MOD0 and OCSC.MOD1 determine the operation mode of OCU
                                ch.0/ch.1 in combination with OCSB10.CMOD</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MOD0" -->
                        <field>
                            <name>MOD0</name>
                            <description>OCSC.MOD0 and OCSC.MOD1 determine the operation mode of OCU
                                ch.0/ch.1 in combination with OCSB10.CMOD</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "OCU_OCSE0" -->
                <register>
                    <name>OCU_OCSE0</name>
                    <description>OCU ch.0 Control Register E</description>
                    <addressOffset>0x128</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "OCSE" -->
                        <field>
                            <name>OCSE</name>
                            <description>specify the setting conditions of the OCU's matching
                                detection register (IOP0)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "OCU_OCSE1" -->
                <register>
                    <name>OCU_OCSE1</name>
                    <description>OCU ch.1 Control Register E</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "OCSE" -->
                        <field>
                            <name>OCSE</name>
                            <description>specify the setting conditions of the OCU's matching
                                detection register (IOP0/IOP1)</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "OCU_OCSE2" -->
                <register derivedFrom="OCU_OCSE0">
                    <name>OCU_OCSE2</name>
                    <description>OCU ch.2 Control Register E</description>
                    <addressOffset>0x130</addressOffset>
                </register>
