itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "WFG_WFSA54" -->
                <register derivedFrom="WFG_WFSA10">
                    <name>WFG_WFSA54</name>
                    <description>WFG Control Register A for WFG ch.4/5</description>
                    <addressOffset>0x1AC</addressOffset>
                </register>
                <!-- REGISTER "WFG_WFIR" -->
                <register>
                    <name>WFG_WFIR</name>
                    <description>WFG Interrupt Control Register</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TMIS54" -->
                        <field>
                            <name>TMIS54</name>
                            <description>stops the WFG54 reload timer and clears TMIF54</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "TMIE54" -->
                        <field>
                            <name>TMIE54</name>
                            <description>stops the WFG54 reload timer and clears TMIF54</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TMIC54" -->
                        <field>
                            <name>TMIC54</name>
                            <description>clears TIMF54 bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "TMIF54" -->
                        <field>
                            <name>TMIF54</name>
                            <description>detects the event of WFG54 reload timer interrupt
                                occurrence</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TMIS32" -->
                        <field>
                            <name>TMIS32</name>
                            <description>stops the WFG32 reload timer and clears TMIF32</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "TMIE32" -->
                        <field>
                            <name>TMIE32</name>
                            <description>1stops the WFG32 reload timer and clears TMIF32</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TMIC32" -->
                        <field>
                            <name>TMIC32</name>
                            <description>clears TIMF32 bit</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "TMIF32" -->
                        <field>
                            <name>TMIF32</name>
                            <description>detects the event of WFG32 reload timer interrupt
                                occurrence</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TMIS10" -->
                        <field>
                            <name>TMIS10</name>
                            <description>stops the WFG10 reload timer and clears TMIF10</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "TMIE10" -->
                        <field>
                            <name>TMIE10</name>
                            <description>starts WFG10 reload timer and checks the operation state of
                                it.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TMIC10" -->
                        <field>
                            <name>TMIC10</name>
                            <description>clears TIMF10 bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "TMIF10" -->
                        <field>
                            <name>TMIF10</name>
                            <description>detects the event of WFG10 reload timer interrupt
                                occurrence</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "DTICB" -->
                        <field>
                            <name>DTICB</name>
                            <description>clears DTIFB bit.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "DTIFB" -->
                        <field>
                            <name>DTIFB</name>
                            <description>detects DTTIX signal input via analog noise filter</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "DTICA" -->
                        <field>
                            <name>DTICA</name>
                            <description>clears the DTIFA interrupt flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "DTIFA" -->
                        <field>
                            <name>DTIFA</name>
                            <description>detects the event of DTTIX signal input via digital
                                noise-canceller</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WFG_NZCL" -->
                <register>
                    <name>WFG_NZCL</name>
                    <description>NZCL Control Register</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x733F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WIM54" -->
                        <field>
                            <name>WIM54</name>
                            <description>selects whether a WFG54 reload timer interrupt is masked
                                when the WFIR.TMIF54 flag is set</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "WIM32" -->
                        <field>
                            <name>WIM32</name>
                            <description>selects whether a WFG32 reload timer interrupt is masked
                                when the WFIR.TMIF32 flag is set</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "WIM10" -->
                        <field>
                            <name>WIM10</name>
                            <description>selects whether a WFG10 reload timer interrupt is masked
                                when the WFIR.TMIF10 flag is set</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DIMB" -->
                        <field>
                            <name>DIMB</name>
                            <description>selects whether a DTIF interrupt is masked when the
                                WFIR.TIFDTIFB flag is set</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DIMA" -->
                        <field>
                            <name>DIMA</name>
                            <description>selects whether a DTIF interrupt is masked when the
                                WFIR.DTIFA flag is set</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DTIEB" -->
                        <field>
                            <name>DTIEB</name>
                            <description>Enables the path from DTTIX pin to analog noise filter</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SDTI" -->
                        <field>
                            <name>SDTI</name>
                            <description>sets the WFIR.DTIFA register by writing to the register
                                from the CPU</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                        </field>
                        <!-- FIELD "NWS" -->
                        <field>
                            <name>NWS</name>
                            <description>set the noise-canceling width for a digital noise-canceller</description>
                            <lsb>1</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DTIEA" -->
                        <field>
                            <name>DTIEA</name>
                            <description>Enables the path for digital noise filter from DTTIX pin</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "ICU_ICFS10" -->
                <register>
                    <name>ICU_ICFS10</name>
                    <description>ICU ch.0/1 Connecting FRT Select Register</description>
                    <addressOffset>0x16C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FSI1" -->
                        <field>
                            <name>FSI1</name>
                            <description>Connects FRT ch.x to ICU ch.(1)</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FSI0" -->
                        <field>
                            <name>FSI0</name>
                            <description>Connects FRT ch.x to ICU ch.(0)</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
