itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "ICU_ICFS32" -->
                <register derivedFrom="ICU_ICFS10">
                    <name>ICU_ICFS32</name>
                    <description>ICU ch.2/3 Connecting FRT Select Register</description>
                    <addressOffset>0x16D</addressOffset>
                </register>
                <!-- REGISTER "ICU_ICCP0" -->
                <register>
                    <name>ICU_ICCP0</name>
                    <description>ICU-ch.0 Capture Value Store Register</description>
                    <addressOffset>0x176</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                </register>
                <!-- REGISTER "ICU_ICCP1" -->
                <register derivedFrom="ICU_ICCP0">
                    <name>ICU_ICCP1</name>
                    <description>ICU-ch.1 Capture Value Store Register</description>
                    <addressOffset>0x17A</addressOffset>
                </register>
                <!-- REGISTER "ICU_ICCP2" -->
                <register derivedFrom="ICU_ICCP0">
                    <name>ICU_ICCP2</name>
                    <description>ICU-ch.2 Capture Value Store Register</description>
                    <addressOffset>0x17E</addressOffset>
                </register>
                <!-- REGISTER "ICU_ICCP3" -->
                <register derivedFrom="ICU_ICCP0">
                    <name>ICU_ICCP3</name>
                    <description>ICU-ch.3 Capture Value Store Register</description>
                    <addressOffset>0x182</addressOffset>
                </register>
                <!-- REGISTER "ICU_ICSA10" -->
                <register>
                    <name>ICU_ICSA10</name>
                    <description>ICU ch.0/1 Control Register A</description>
                    <addressOffset>0x184</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ICP1" -->
                        <field>
                            <name>ICP1</name>
                            <description>Indicates that a valid edge has been detected at ICU ch.(1)
                                and the capture operation has been performed</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ICP0" -->
                        <field>
                            <name>ICP0</name>
                            <description>Indicates that a valid edge has been detected at ICU ch.(0)
                                and the capture operation has been performed</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ICE1" -->
                        <field>
                            <name>ICE1</name>
                            <description>"Generates interrupt, when ""1"" is set to ICSA.ICP1."</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ICE0" -->
                        <field>
                            <name>ICE0</name>
                            <description>"Generates interrupt, when ""1"" is set to ICSA.ICP0."</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EG1" -->
                        <field>
                            <name>EG1</name>
                            <description>enables/disables the operation of ICU-ch.(1) and selects a
                                valid edge(s)</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EG0" -->
                        <field>
                            <name>EG0</name>
                            <description>enables/disables the operation of ICU-ch.(0) and selects a
                                valid edge(s)</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "ICU_ICSB10" -->
                <register>
                    <name>ICU_ICSB10</name>
                    <description>ICU ch.0/1 Control Register B</description>
                    <addressOffset>0x185</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IEI1" -->
                        <field>
                            <name>IEI1</name>
                            <description>indicates the latest valid edge of ICU ch.(1)</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IEI0" -->
                        <field>
                            <name>IEI0</name>
                            <description>indicates the latest valid edge of ICU ch.(0)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
