itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "ICU_ICSA32" -->
                <register derivedFrom="ICU_ICSA10">
                    <name>ICU_ICSA32</name>
                    <description>ICU ch.2/3 Control Register A</description>
                    <addressOffset>0x188</addressOffset>
                </register>
                <!-- REGISTER "ICU_ICSB32" -->
                <register derivedFrom="ICU_ICSB10">
                    <name>ICU_ICSB32</name>
                    <description>ICU ch.2/3 Control Register B</description>
                    <addressOffset>0x189</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACFS10" -->
                <register>
                    <name>ADCMP_ACFS10</name>
                    <description>ADCMP ch.0/1 Connecting FRT Select Register</description>
                    <addressOffset>0x170</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FSA1" -->
                        <field>
                            <name>FSA1</name>
                            <description>specify the FRT to be connected to ADCMP ch.(1)</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FSA0" -->
                        <field>
                            <name>FSA0</name>
                            <description>specify the FRT to be connected to ADCMP ch.(0)</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "ADCMP_ACFS32" -->
                <register derivedFrom="ADCMP_ACFS10">
                    <name>ADCMP_ACFS32</name>
                    <description>ADCMP ch.2/3 Connecting FRT Select Register</description>
                    <addressOffset>0x171</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACFS54" -->
                <register derivedFrom="ADCMP_ACFS10">
                    <name>ADCMP_ACFS54</name>
                    <description>ADCMP ch.4/5 Connecting FRT Select Register</description>
                    <addressOffset>0x172</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACMP0" -->
                <register>
                    <name>ADCMP_ACMP0</name>
                    <description>ADCMP ch.0 Compare Value Store Register</description>
                    <addressOffset>0x1BA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ACMP" -->
                        <field>
                            <name>ACMP</name>
                            <description>0</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "ADCMP_ACMP1" -->
                <register derivedFrom="ADCMP_ACMP0">
                    <name>ADCMP_ACMP1</name>
                    <description>ADCMP ch.1 Compare Value Store Register</description>
                    <addressOffset>0x1BE</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACMP2" -->
                <register derivedFrom="ADCMP_ACMP0">
                    <name>ADCMP_ACMP2</name>
                    <description>ADCMP ch.2 Compare Value Store Register</description>
                    <addressOffset>0x1C2</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACMP3" -->
                <register derivedFrom="ADCMP_ACMP0">
                    <name>ADCMP_ACMP3</name>
                    <description>ADCMP ch.3 Compare Value Store Register</description>
                    <addressOffset>0x1C6</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACMP4" -->
                <register derivedFrom="ADCMP_ACMP0">
                    <name>ADCMP_ACMP4</name>
                    <description>ADCMP ch.4 Compare Value Store Register</description>
                    <addressOffset>0x1CA</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACMP5" -->
                <register derivedFrom="ADCMP_ACMP0">
                    <name>ADCMP_ACMP5</name>
                    <description>ADCMP ch.5 Compare Value Store Register</description>
                    <addressOffset>0x1CE</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACSA" -->
                <register>
                    <name>ADCMP_ACSA</name>
                    <description>ADCMP Control Register A</description>
                    <addressOffset>0x1D0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x3F3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SEL54" -->
                        <field>
                            <name>SEL54</name>
                            <description>selects compatible operation of ADCMP ch.5 and ch.4 with
                                FM3 Family products</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SEL32" -->
                        <field>
                            <name>SEL32</name>
                            <description>selects compatible operation of ADCMP ch.3 and ch.2 with
                                FM3 Family products</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SEL10" -->
                        <field>
                            <name>SEL10</name>
                            <description>selects compatible operation of ADCMP ch.1 and ch.0 with
                                FM3 Family products</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CE54" -->
                        <field>
                            <name>CE54</name>
                            <description>enables/disables compatibility of ADCMP ch.5 and ch.4 with
                                FM3 Family products</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CE32" -->
                        <field>
                            <name>CE32</name>
                            <description>enables/disables compatibility of ADCMP ch.3 and ch.2 with
                                FM3 Family products</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CE10" -->
                        <field>
                            <name>CE10</name>
                            <description>enables/disables compatibility of ADCMP ch.1 and ch.0 with
                                FM3 Family products</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
