itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "ADCMP_ACSC0" -->
                <register>
                    <name>ADCMP_ACSC0</name>
                    <description>ADCMP ch.0 Control Register C</description>
                    <addressOffset>0x1D4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x1F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ADSEL" -->
                        <field>
                            <name>ADSEL</name>
                            <description>specify the destinations of ADC start signals that are
                                output by ADCMP</description>
                            <lsb>2</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BUFE" -->
                        <field>
                            <name>BUFE</name>
                            <description>select enable/disable and transfer timing for buffer
                                function of the ACMP register.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "ADCMP_ACSD0" -->
                <register>
                    <name>ADCMP_ACSD0</name>
                    <description>ADCMP ch.0 Control Register D</description>
                    <addressOffset>0x1D5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xF3</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ZE" -->
                        <field>
                            <name>ZE</name>
                            <description>enables/disables the operation of the ADCMP when the FRT is
                                "0x0000"</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "UE" -->
                        <field>
                            <name>UE</name>
                            <description>enables/disables the operation of the ADCMP that is
                                counting up for the connected FRT</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PE" -->
                        <field>
                            <name>PE</name>
                            <description>enables/disables the operation of the ADCMP that is
                                counting down at the Peak value of the connected FRT</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DE" -->
                        <field>
                            <name>DE</name>
                            <description>enables/disables the operation of the ADCMP that is
                                counting down for the connected FRT</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OCUS" -->
                        <field>
                            <name>OCUS</name>
                            <description>selects the OCU OCCP register that will become the start
                                for offset start</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AMOD" -->
                        <field>
                            <name>AMOD</name>
                            <description>selects operation mode for ADCMP</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "ADCMP_ACSC1" -->
                <register derivedFrom="ADCMP_ACSC0">
                    <name>ADCMP_ACSC1</name>
                    <description>ADCMP ch.1 Control Register C</description>
                    <addressOffset>0x1D8</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACSD1" -->
                <register derivedFrom="ADCMP_ACSD0">
                    <name>ADCMP_ACSD1</name>
                    <description>ADCMP ch.1 Control Register D</description>
                    <addressOffset>0x1D9</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACSC2" -->
                <register derivedFrom="ADCMP_ACSC0">
                    <name>ADCMP_ACSC2</name>
                    <description>ADCMP ch.2 Control Register C</description>
                    <addressOffset>0x1DC</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACSD2" -->
                <register derivedFrom="ADCMP_ACSD0">
                    <name>ADCMP_ACSD2</name>
                    <description>ADCMP ch.2 Control Register D</description>
                    <addressOffset>0x1DD</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACSC3" -->
                <register derivedFrom="ADCMP_ACSC0">
                    <name>ADCMP_ACSC3</name>
                    <description>ADCMP ch.3 Control Register C</description>
                    <addressOffset>0x1E0</addressOffset>
                </register>
