itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "ADCMP_ACSD3" -->
                <register derivedFrom="ADCMP_ACSD0">
                    <name>ADCMP_ACSD3</name>
                    <description>ADCMP ch.3 Control Register D</description>
                    <addressOffset>0x1E1</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACSC4" -->
                <register derivedFrom="ADCMP_ACSC0">
                    <name>ADCMP_ACSC4</name>
                    <description>ADCMP ch.4 Control Register C</description>
                    <addressOffset>0x1E4</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACSD4" -->
                <register derivedFrom="ADCMP_ACSD0">
                    <name>ADCMP_ACSD4</name>
                    <description>ADCMP ch.4 Control Register D</description>
                    <addressOffset>0x1E5</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACSC5" -->
                <register derivedFrom="ADCMP_ACSC0">
                    <name>ADCMP_ACSC5</name>
                    <description>ADCMP ch.5 Control Register C</description>
                    <addressOffset>0x1E8</addressOffset>
                </register>
                <!-- REGISTER "ADCMP_ACSD5" -->
                <register derivedFrom="ADCMP_ACSD0">
                    <name>ADCMP_ACSD5</name>
                    <description>ADCMP ch.5 Control Register D</description>
                    <addressOffset>0x1E9</addressOffset>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "MFT1" -->
        <peripheral derivedFrom="MFT0">
            <name>MFT1</name>
            <baseAddress>0x40021000</baseAddress>
            <!-- INTERRUPT "WFG1_DTIF1" -->
            <interrupt>
                <name>WFG1_DTIF1</name>
                <value>22</value>
            </interrupt>
            <!-- INTERRUPT "FRT1_PEAK" -->
            <interrupt>
                <name>FRT1_PEAK</name>
                <value>28</value>
            </interrupt>
            <!-- INTERRUPT "FRT1_ZERO" -->
            <interrupt>
                <name>FRT1_ZERO</name>
                <value>29</value>
            </interrupt>
            <!-- INTERRUPT "ICU1" -->
            <interrupt>
                <name>ICU1</name>
                <value>30</value>
            </interrupt>
            <!-- INTERRUPT "OCU1" -->
            <interrupt>
                <name>OCU1</name>
                <value>31</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "MFT_PPG" -->
        <peripheral>
            <name>MFT_PPG</name>
            <description>PPG Configuration</description>
            <groupName>MFT_PPG</groupName>
            <baseAddress>0x40024000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2C</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x34</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x48</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4C</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x50</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x54</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x104</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x140</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x144</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x200</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x204</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x208</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x210</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x214</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x218</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x240</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x244</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x248</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x24C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x250</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x254</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x258</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x280</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x284</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x288</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x290</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x294</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x298</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2C0</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2C4</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2C8</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2CC</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2D0</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2D4</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2D8</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x300</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x304</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x308</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x310</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x314</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x318</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x340</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x344</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x348</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x34C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x350</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x354</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x358</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "PPG00_02_04" -->
            <interrupt>
                <name>PPG00_02_04</name>
                <value>36</value>
            </interrupt>
            <!-- INTERRUPT "PPG08_10_12" -->
            <interrupt>
                <name>PPG08_10_12</name>
                <value>37</value>
            </interrupt>
            <!-- INTERRUPT "PPG16_18_20" -->
            <interrupt>
                <name>PPG16_18_20</name>
                <value>38</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "TTCR0" -->
                <register>
                    <name>TTCR0</name>
                    <description>PPG Start Trigger Control Register 0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xF000</resetValue>
                    <resetMask>0xFF00</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TRG6O" -->
                        <field>
                            <name>TRG6O</name>
                            <description>PPG6 trigger stop bit</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TRG4O" -->
                        <field>
                            <name>TRG4O</name>
                            <description>PPG4 trigger stop bit</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TRG2O" -->
                        <field>
                            <name>TRG2O</name>
                            <description>PPG2 trigger stop bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TRG0O" -->
                        <field>
                            <name>TRG0O</name>
                            <description>PPG0 trigger stop bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CS0" -->
                        <field>
                            <name>CS0</name>
                            <description>8-bit UP counter clock select bits for comparison</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MONI0" -->
                        <field>
                            <name>MONI0</name>
                            <description>8-bit UP counter operation state monitor bit for comparison</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "STR0" -->
                        <field>
                            <name>STR0</name>
                            <description>8-bit UP counter operation enable bit for comparison</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
