itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "COMP2" -->
                <register>
                    <name>COMP2</name>
                    <description>PPG Compare Register 2</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "COMP4" -->
                <register derivedFrom="COMP0">
                    <name>COMP4</name>
                    <description>PPG Compare Register 4</description>
                    <addressOffset>0x10</addressOffset>
                </register>
                <!-- REGISTER "COMP6" -->
                <register derivedFrom="COMP2">
                    <name>COMP6</name>
                    <description>PPG Compare Register 6</description>
                    <addressOffset>0x14</addressOffset>
                </register>
                <!-- REGISTER "COMP1" -->
                <register derivedFrom="COMP0">
                    <name>COMP1</name>
                    <description>PPG Compare Register 1</description>
                    <addressOffset>0x28</addressOffset>
                </register>
                <!-- REGISTER "COMP3" -->
                <register derivedFrom="COMP2">
                    <name>COMP3</name>
                    <description>PPG Compare Register 3</description>
                    <addressOffset>0x2C</addressOffset>
                </register>
                <!-- REGISTER "COMP5" -->
                <register derivedFrom="COMP0">
                    <name>COMP5</name>
                    <description>PPG Compare Register 5</description>
                    <addressOffset>0x30</addressOffset>
                </register>
                <!-- REGISTER "COMP7" -->
                <register derivedFrom="COMP2">
                    <name>COMP7</name>
                    <description>PPG Compare Register 7</description>
                    <addressOffset>0x34</addressOffset>
                </register>
                <!-- REGISTER "COMP8" -->
                <register derivedFrom="COMP0">
                    <name>COMP8</name>
                    <description>PPG Compare Register 8</description>
                    <addressOffset>0x48</addressOffset>
                </register>
                <!-- REGISTER "COMP10" -->
                <register derivedFrom="COMP2">
                    <name>COMP10</name>
                    <description>PPG Compare Register 10</description>
                    <addressOffset>0x4C</addressOffset>
                </register>
                <!-- REGISTER "COMP12" -->
                <register derivedFrom="COMP0">
                    <name>COMP12</name>
                    <description>PPG Compare Register 12</description>
                    <addressOffset>0x50</addressOffset>
                </register>
                <!-- REGISTER "COMP14" -->
                <register derivedFrom="COMP2">
                    <name>COMP14</name>
                    <description>PPG Compare Register 14</description>
                    <addressOffset>0x54</addressOffset>
                </register>
                <!-- REGISTER "TRG" -->
                <register>
                    <name>TRG</name>
                    <description>PPG Start Register 0</description>
                    <addressOffset>0x100</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "PEN15" -->
                        <field>
                            <name>PEN15</name>
                            <description>PPG15 Start Trigger bit</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN14" -->
                        <field>
                            <name>PEN14</name>
                            <description>PPG14 Start Trigger bit</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN13" -->
                        <field>
                            <name>PEN13</name>
                            <description>PPG13 Start Trigger bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN12" -->
                        <field>
                            <name>PEN12</name>
                            <description>PPG12 Start Trigger bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN11" -->
                        <field>
                            <name>PEN11</name>
                            <description>PPG11 Start Trigger bit</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN10" -->
                        <field>
                            <name>PEN10</name>
                            <description>PPG10 Start Trigger bit</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN09" -->
                        <field>
                            <name>PEN09</name>
                            <description>PPG9 Start Trigger bit</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN08" -->
                        <field>
                            <name>PEN08</name>
                            <description>PPG8 Start Trigger bit</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN07" -->
                        <field>
                            <name>PEN07</name>
                            <description>PPG7 Start Trigger bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN06" -->
                        <field>
                            <name>PEN06</name>
                            <description>PPG6 Start Trigger bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN05" -->
                        <field>
                            <name>PEN05</name>
                            <description>PPG5 Start Trigger bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN04" -->
                        <field>
                            <name>PEN04</name>
                            <description>PPG4 Start Trigger bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN03" -->
                        <field>
                            <name>PEN03</name>
                            <description>PPG3 Start Trigger bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN02" -->
                        <field>
                            <name>PEN02</name>
                            <description>PPG2 Start Trigger bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN01" -->
                        <field>
                            <name>PEN01</name>
                            <description>PPG1 Start Trigger bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN00" -->
                        <field>
                            <name>PEN00</name>
                            <description>PPG0 Start Trigger bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "TRG1" -->
                <register>
                    <name>TRG1</name>
                    <description>PPG Start Register 1</description>
                    <addressOffset>0x140</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "PEN23" -->
                        <field>
                            <name>PEN23</name>
                            <description>PPG23 Start Trigger bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN22" -->
                        <field>
                            <name>PEN22</name>
                            <description>PPG22 Start Trigger bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN21" -->
                        <field>
                            <name>PEN21</name>
                            <description>PPG21 Start Trigger bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN20" -->
                        <field>
                            <name>PEN20</name>
                            <description>PPG20 Start Trigger bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN19" -->
                        <field>
                            <name>PEN19</name>
                            <description>PPG19 Start Trigger bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN18" -->
                        <field>
                            <name>PEN18</name>
                            <description>PPG18 Start Trigger bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN17" -->
                        <field>
                            <name>PEN17</name>
                            <description>PPG17 Start Trigger bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN16" -->
                        <field>
                            <name>PEN16</name>
                            <description>PPG16 Start Trigger bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "REVC" -->
                <register>
                    <name>REVC</name>
                    <description>Output Reverse Register 0</description>
                    <addressOffset>0x104</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "REV15" -->
                        <field>
                            <name>REV15</name>
                            <description>PPG15 Output Reverse Enable bit</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV14" -->
                        <field>
                            <name>REV14</name>
                            <description>PPG14 Output Reverse Enable bit</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV13" -->
                        <field>
                            <name>REV13</name>
                            <description>PPG13 Output Reverse Enable bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV12" -->
                        <field>
                            <name>REV12</name>
                            <description>PPG12 Output Reverse Enable bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV11" -->
                        <field>
                            <name>REV11</name>
                            <description>PPG11 Output Reverse Enable bit</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV10" -->
                        <field>
                            <name>REV10</name>
                            <description>PPG10 Output Reverse Enable bit</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV09" -->
                        <field>
                            <name>REV09</name>
                            <description>PPG9 Output Reverse Enable bit</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV08" -->
                        <field>
                            <name>REV08</name>
                            <description>PPG8 Output Reverse Enable bit</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV07" -->
                        <field>
                            <name>REV07</name>
                            <description>PPG7 Output Reverse Enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV06" -->
                        <field>
                            <name>REV06</name>
                            <description>PPG6 Output Reverse Enable bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV05" -->
                        <field>
                            <name>REV05</name>
                            <description>PPG5 Output Reverse Enable bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV04" -->
                        <field>
                            <name>REV04</name>
                            <description>PPG4 Output Reverse Enable bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV03" -->
                        <field>
                            <name>REV03</name>
                            <description>PPG3 Output Reverse Enable bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV02" -->
                        <field>
                            <name>REV02</name>
                            <description>PPG2 Output Reverse Enable bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV01" -->
                        <field>
                            <name>REV01</name>
                            <description>PPG1 Output Reverse Enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "REV00" -->
                        <field>
                            <name>REV00</name>
                            <description>PPG0 Output Reverse Enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
