itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "PRLH1" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH1</name>
                    <description>PPG1 Reload Registers High</description>
                    <addressOffset>0x20D</addressOffset>
                </register>
                <!-- REGISTER "PRLL1" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL1</name>
                    <description>PPG1 Reload Registers Low</description>
                    <addressOffset>0x20C</addressOffset>
                </register>
                <!-- REGISTER "PRLH2" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH2</name>
                    <description>PPG2 Reload Registers High</description>
                    <addressOffset>0x211</addressOffset>
                </register>
                <!-- REGISTER "PRLL2" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL2</name>
                    <description>PPG2 Reload Registers Low</description>
                    <addressOffset>0x210</addressOffset>
                </register>
                <!-- REGISTER "PRLH3" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH3</name>
                    <description>PPG3 Reload Registers High</description>
                    <addressOffset>0x215</addressOffset>
                </register>
                <!-- REGISTER "PRLL3" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL3</name>
                    <description>PPG3 Reload Registers Low</description>
                    <addressOffset>0x214</addressOffset>
                </register>
                <!-- REGISTER "PRLH4" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH4</name>
                    <description>PPG4 Reload Registers High</description>
                    <addressOffset>0x249</addressOffset>
                </register>
                <!-- REGISTER "PRLL4" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL4</name>
                    <description>PPG4 Reload Registers Low</description>
                    <addressOffset>0x248</addressOffset>
                </register>
                <!-- REGISTER "PRLH5" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH5</name>
                    <description>PPG5 Reload Registers High</description>
                    <addressOffset>0x24D</addressOffset>
                </register>
                <!-- REGISTER "PRLL5" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL5</name>
                    <description>PPG5 Reload Registers Low</description>
                    <addressOffset>0x24C</addressOffset>
                </register>
                <!-- REGISTER "PRLH6" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH6</name>
                    <description>PPG6 Reload Registers High</description>
                    <addressOffset>0x251</addressOffset>
                </register>
                <!-- REGISTER "PRLL6" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL6</name>
                    <description>PPG6 Reload Registers Low</description>
                    <addressOffset>0x250</addressOffset>
                </register>
                <!-- REGISTER "PRLH7" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH7</name>
                    <description>PPG7 Reload Registers High</description>
                    <addressOffset>0x255</addressOffset>
                </register>
                <!-- REGISTER "PRLL7" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL7</name>
                    <description>PPG7 Reload Registers Low</description>
                    <addressOffset>0x254</addressOffset>
                </register>
                <!-- REGISTER "PRLH8" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH8</name>
                    <description>PPG8 Reload Registers High</description>
                    <addressOffset>0x289</addressOffset>
                </register>
                <!-- REGISTER "PRLL8" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL8</name>
                    <description>PPG8 Reload Registers Low</description>
                    <addressOffset>0x288</addressOffset>
                </register>
                <!-- REGISTER "PRLH9" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH9</name>
                    <description>PPG9 Reload Registers High</description>
                    <addressOffset>0x28D</addressOffset>
                </register>
                <!-- REGISTER "PRLL9" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL9</name>
                    <description>PPG9 Reload Registers Low</description>
                    <addressOffset>0x28C</addressOffset>
                </register>
                <!-- REGISTER "PRLH10" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH10</name>
                    <description>PPG10 Reload Registers High</description>
                    <addressOffset>0x291</addressOffset>
                </register>
                <!-- REGISTER "PRLL10" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL10</name>
                    <description>PPG10 Reload Registers Low</description>
                    <addressOffset>0x290</addressOffset>
                </register>
                <!-- REGISTER "PRLH11" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH11</name>
                    <description>PPG11 Reload Registers High</description>
                    <addressOffset>0x295</addressOffset>
                </register>
                <!-- REGISTER "PRLL11" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL11</name>
                    <description>PPG11 Reload Registers Low</description>
                    <addressOffset>0x294</addressOffset>
                </register>
                <!-- REGISTER "PRLH12" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH12</name>
                    <description>PPG12 Reload Registers High</description>
                    <addressOffset>0x2C9</addressOffset>
                </register>
                <!-- REGISTER "PRLL12" -->
                <register derivedFrom="PRLL0">
                    <name>PRLL12</name>
                    <description>PPG12 Reload Registers Low</description>
                    <addressOffset>0x2C8</addressOffset>
                </register>
                <!-- REGISTER "PRLH13" -->
                <register derivedFrom="PRLH0">
                    <name>PRLH13</name>
                    <description>PPG13 Reload Registers High</description>
                    <addressOffset>0x2CD</addressOffset>
                </register>
