itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "GATEC8" -->
                <register>
                    <name>GATEC8</name>
                    <description>PPG Gate Function Control Registers 8</description>
                    <addressOffset>0x298</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x33</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "STRG10" -->
                        <field>
                            <name>STRG10</name>
                            <description>Select a trigger for PPG10</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EDGE10" -->
                        <field>
                            <name>EDGE10</name>
                            <description>Select Start Effective Level for PPG10</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STRG8" -->
                        <field>
                            <name>STRG8</name>
                            <description>Select a trigger for PPG8</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EDGE8" -->
                        <field>
                            <name>EDGE8</name>
                            <description>Select Start Effective Level for PPG8</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "GATEC12" -->
                <register>
                    <name>GATEC12</name>
                    <description>PPG Gate Function Control Registers 12</description>
                    <addressOffset>0x2D8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x33</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "STRG14" -->
                        <field>
                            <name>STRG14</name>
                            <description>Select a trigger for PPG14</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EDGE14" -->
                        <field>
                            <name>EDGE14</name>
                            <description>Select Start Effective Level for PPG14</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STRG12" -->
                        <field>
                            <name>STRG12</name>
                            <description>Select a trigger for PPG12</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EDGE12" -->
                        <field>
                            <name>EDGE12</name>
                            <description>Select Start Effective Level for PPG12</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "GATEC16" -->
                <register>
                    <name>GATEC16</name>
                    <description>PPG Gate Function Control Registers 16</description>
                    <addressOffset>0x318</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x33</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "STRG18" -->
                        <field>
                            <name>STRG18</name>
                            <description>Select a trigger for PPG18</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EDGE18" -->
                        <field>
                            <name>EDGE18</name>
                            <description>Select Start Effective Level for PPG18</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STRG16" -->
                        <field>
                            <name>STRG16</name>
                            <description>Select a trigger for PPG16</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EDGE16" -->
                        <field>
                            <name>EDGE16</name>
                            <description>Select Start Effective Level for PPG16</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "GATEC20" -->
                <register>
                    <name>GATEC20</name>
                    <description>PPG Gate Function Control Registers 20</description>
                    <addressOffset>0x358</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x33</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "STRG22" -->
                        <field>
                            <name>STRG22</name>
                            <description>Select a trigger for PPG22</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EDGE22" -->
                        <field>
                            <name>EDGE22</name>
                            <description>Select Start Effective Level for PPG22</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STRG20" -->
                        <field>
                            <name>STRG20</name>
                            <description>Select a trigger for PPG20</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EDGE20" -->
                        <field>
                            <name>EDGE20</name>
                            <description>Select Start Effective Level for PPG20</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
