itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "PWM_PDUT" -->
                <register>
                    <name>PWM_PDUT</name>
                    <description>PWM Duty Set Register</description>
                    <alternateGroup>PWM</alternateGroup>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                </register>
                <!-- REGISTER "PWM_TMR" -->
                <register>
                    <name>PWM_TMR</name>
                    <description>Timer Register</description>
                    <alternateGroup>PWM</alternateGroup>
                    <addressOffset>0x08</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <!-- REGISTER "PPG_TMCR" -->
                <register>
                    <name>PPG_TMCR</name>
                    <description>Timer Control Register</description>
                    <alternateGroup>PPG</alternateGroup>
                    <addressOffset>0x0C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x7F7F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CKS2_0" -->
                        <field>
                            <name>CKS2_0</name>
                            <description>Count clock selection bit </description>
                            <lsb>12</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTGEN" -->
                        <field>
                            <name>RTGEN</name>
                            <description>Restart enable bit</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PMSK" -->
                        <field>
                            <name>PMSK</name>
                            <description> Pulse output mask bit </description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EGS" -->
                        <field>
                            <name>EGS</name>
                            <description>Trigger input edge selection bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FMD" -->
                        <field>
                            <name>FMD</name>
                            <description>Timer function selection bits</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OSEL" -->
                        <field>
                            <name>OSEL</name>
                            <description>Output polarity specification bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MDSE" -->
                        <field>
                            <name>MDSE</name>
                            <description>Mode selection bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CTEN" -->
                        <field>
                            <name>CTEN</name>
                            <description>Count operation enable bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STRG" -->
                        <field>
                            <name>STRG</name>
                            <description>Software trigger bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PPG_TMCR2" -->
                <register>
                    <name>PPG_TMCR2</name>
                    <description>Timer Control Register 2</description>
                    <alternateGroup>PPG</alternateGroup>
                    <addressOffset>0x11</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x01</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CKS3" -->
                        <field>
                            <name>CKS3</name>
                            <description>Count clock selection bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PPG_STC" -->
                <register>
                    <name>PPG_STC</name>
                    <description>Status Control Register</description>
                    <alternateGroup>PPG</alternateGroup>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x55</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TGIE" -->
                        <field>
                            <name>TGIE</name>
                            <description>Trigger interrupt request enable bit </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "UDIE" -->
                        <field>
                            <name>UDIE</name>
                            <description>Underflow interrupt request enable bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TGIR" -->
                        <field>
                            <name>TGIR</name>
                            <description>Trigger interrupt request bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "UDIR" -->
                        <field>
                            <name>UDIR</name>
                            <description>Underflow interrupt request bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
