itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "PPG_PRLL" -->
                <register>
                    <name>PPG_PRLL</name>
                    <description>LOW Width Reload Register</description>
                    <alternateGroup>PPG</alternateGroup>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                </register>
                <!-- REGISTER "PPG_PRLH" -->
                <register>
                    <name>PPG_PRLH</name>
                    <description>HIGH Width Reload Register</description>
                    <alternateGroup>PPG</alternateGroup>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                </register>
                <!-- REGISTER "PPG_TMR" -->
                <register>
                    <name>PPG_TMR</name>
                    <description>Timer Register</description>
                    <alternateGroup>PPG</alternateGroup>
                    <addressOffset>0x08</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <!-- REGISTER "RT_TMCR" -->
                <register>
                    <name>RT_TMCR</name>
                    <description>Timer Control Register</description>
                    <alternateGroup>RT</alternateGroup>
                    <addressOffset>0x0C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x73FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CKS2_0" -->
                        <field>
                            <name>CKS2_0</name>
                            <description>Count clock selection bit </description>
                            <lsb>12</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EGS" -->
                        <field>
                            <name>EGS</name>
                            <description>Trigger input edge selection bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "T32" -->
                        <field>
                            <name>T32</name>
                            <description>32-bit timer selection bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FMD" -->
                        <field>
                            <name>FMD</name>
                            <description>Timer function selection bits </description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OSEL" -->
                        <field>
                            <name>OSEL</name>
                            <description>Output polarity specification bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MDSE" -->
                        <field>
                            <name>MDSE</name>
                            <description>Mode selection bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CTEN" -->
                        <field>
                            <name>CTEN</name>
                            <description>Timer enable bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STRG" -->
                        <field>
                            <name>STRG</name>
                            <description>Software trigger bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "RT_TMCR2" -->
                <register>
                    <name>RT_TMCR2</name>
                    <description>Timer Control Register 2</description>
                    <alternateGroup>RT</alternateGroup>
                    <addressOffset>0x11</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x81</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "GATE" -->
                        <field>
                            <name>GATE</name>
                            <description>Gate Input Enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CKS3" -->
                        <field>
                            <name>CKS3</name>
                            <description>Count clock selection bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "RT_STC" -->
                <register>
                    <name>RT_STC</name>
                    <description>Status Control Register</description>
                    <alternateGroup>RT</alternateGroup>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x55</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TGIE" -->
                        <field>
                            <name>TGIE</name>
                            <description>Trigger interrupt request enable bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "UDIE" -->
                        <field>
                            <name>UDIE</name>
                            <description>Underflow interrupt request enable bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TGIR" -->
                        <field>
                            <name>TGIR</name>
                            <description>Trigger interrupt request bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "UDIR" -->
                        <field>
                            <name>UDIR</name>
                            <description>Underflow interrupt request bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "RT_PCSR" -->
                <register>
                    <name>RT_PCSR</name>
                    <description>PWM Cycle Set Register</description>
                    <alternateGroup>RT</alternateGroup>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                </register>
