itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "PWC_DTBF" -->
                <register>
                    <name>PWC_DTBF</name>
                    <description>Data Buffer Register</description>
                    <alternateGroup>PWC</alternateGroup>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "BT1" -->
        <peripheral derivedFrom="BT0">
            <name>BT1</name>
            <baseAddress>0x40025040</baseAddress>
            <!-- INTERRUPT "BT1" -->
            <interrupt>
                <name>BT1</name>
                <value>40</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "BT2" -->
        <peripheral derivedFrom="BT0">
            <name>BT2</name>
            <baseAddress>0x40025080</baseAddress>
            <!-- INTERRUPT "BT2" -->
            <interrupt>
                <name>BT2</name>
                <value>41</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "BT3" -->
        <peripheral derivedFrom="BT0">
            <name>BT3</name>
            <baseAddress>0x400250C0</baseAddress>
            <!-- INTERRUPT "BT3" -->
            <interrupt>
                <name>BT3</name>
                <value>42</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "BT4" -->
        <peripheral derivedFrom="BT0">
            <name>BT4</name>
            <baseAddress>0x40025200</baseAddress>
            <!-- INTERRUPT "BT4" -->
            <interrupt>
                <name>BT4</name>
                <value>43</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "BT5" -->
        <peripheral derivedFrom="BT0">
            <name>BT5</name>
            <baseAddress>0x40025240</baseAddress>
            <!-- INTERRUPT "BT5" -->
            <interrupt>
                <name>BT5</name>
                <value>44</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "BT6" -->
        <peripheral derivedFrom="BT0">
            <name>BT6</name>
            <baseAddress>0x40025280</baseAddress>
            <!-- INTERRUPT "BT6" -->
            <interrupt>
                <name>BT6</name>
                <value>45</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "BT7" -->
        <peripheral derivedFrom="BT0">
            <name>BT7</name>
            <baseAddress>0x400252C0</baseAddress>
            <!-- INTERRUPT "BT7" -->
            <interrupt>
                <name>BT7</name>
                <value>46</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "QPRC0" -->
        <peripheral>
            <name>QPRC0</name>
            <description>Quadrature Position/Revolution Counter 0</description>
            <groupName>QPRC0</groupName>
            <baseAddress>0x40026000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3E</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "QPRC0" -->
            <interrupt>
                <name>QPRC0</name>
                <value>19</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "QPCR" -->
                <register>
                    <name>QPCR</name>
                    <description>QPRC Position Count Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <!-- REGISTER "QRCR" -->
                <register>
                    <name>QRCR</name>
                    <description>QPRC Revolution Count Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <!-- REGISTER "QPCCR" -->
                <register>
                    <name>QPCCR</name>
                    <description>QPRC Position Counter Compare Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <!-- REGISTER "QPRCR" -->
                <register>
                    <name>QPRCR</name>
                    <description>QPRC Position and Revolution Counter Compare Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <!-- REGISTER "QCR" -->
                <register>
                    <name>QCR</name>
                    <description>QPRC Control Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CGE" -->
                        <field>
                            <name>CGE</name>
                            <description>Detection edge selection bits</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BES" -->
                        <field>
                            <name>BES</name>
                            <description>BIN detection edge selection bits</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AES" -->
                        <field>
                            <name>AES</name>
                            <description>AIN detection edge selection bits</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PCRM" -->
                        <field>
                            <name>PCRM</name>
                            <description>Position counter reset mask bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SWAP" -->
                        <field>
                            <name>SWAP</name>
                            <description>Swap bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RSEL" -->
                        <field>
                            <name>RSEL</name>
                            <description>Register function selection bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CGSC" -->
                        <field>
                            <name>CGSC</name>
                            <description>Count clear or gate selection bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PSTP" -->
                        <field>
                            <name>PSTP</name>
                            <description>Position counter stop bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RCM" -->
                        <field>
                            <name>RCM</name>
                            <description>Revolution counter mode bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PCM" -->
                        <field>
                            <name>PCM</name>
                            <description>Position counter mode bits</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "QECR" -->
                <register>
                    <name>QECR</name>
                    <description>QPRC Extension Control Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0007</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ORNGIE" -->
                        <field>
                            <name>ORNGIE</name>
                            <description>Outrange interrupt enable bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ORNGF" -->
                        <field>
                            <name>ORNGF</name>
                            <description>Outrange interrupt request flag bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ORNGMD" -->
                        <field>
                            <name>ORNGMD</name>
                            <description>Outrange mode selection bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "QICRL" -->
                <register>
                    <name>QICRL</name>
                    <description>Low-Order Bytes of QPRC Interrupt Control Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ZIIF" -->
                        <field>
                            <name>ZIIF</name>
                            <description>Zero index interrupt request flag bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OFDF" -->
                        <field>
                            <name>OFDF</name>
                            <description>Overflow interrupt request flag bit </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "UFDF" -->
                        <field>
                            <name>UFDF</name>
                            <description>Underflow interrupt request flag bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OUZIE" -->
                        <field>
                            <name>OUZIE</name>
                            <description>"Overflow, underflow, or zero index interrupt enable bit"</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QPRCMF" -->
                        <field>
                            <name>QPRCMF</name>
                            <description>PC and RC match interrupt request flag bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QPRCMIE" -->
                        <field>
                            <name>QPRCMIE</name>
                            <description>PC and RC match interrupt enable bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QPCMF" -->
                        <field>
                            <name>QPCMF</name>
                            <description>PC match interrupt request flag bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QPCMIE" -->
                        <field>
                            <name>QPCMIE</name>
                            <description>PC match interrupt enable bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "QICRH" -->
                <register>
                    <name>QICRH</name>
                    <description>High-Order Bytes of QPRC Interrupt Control Register</description>
                    <addressOffset>0x15</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "QPCNRCMF" -->
                        <field>
                            <name>QPCNRCMF</name>
                            <description>PC match and RC match interrupt request flag bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QPCNRCMIE" -->
                        <field>
                            <name>QPCNRCMIE</name>
                            <description>PC match and RC match interrupt enable bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DIROU" -->
                        <field>
                            <name>DIROU</name>
                            <description>Last position counter flow direction bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "DIRPC" -->
                        <field>
                            <name>DIRPC</name>
                            <description>Last position counter direction bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "CDCF" -->
                        <field>
                            <name>CDCF</name>
                            <description>Count inversion interrupt request flag bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CDCIE" -->
                        <field>
                            <name>CDCIE</name>
                            <description>Count inversion interrupt enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "QMPR" -->
                <register>
                    <name>QMPR</name>
                    <description>QPRC Maximum Position Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <!-- REGISTER "QPRCRR" -->
                <register>
                    <name>QPRCRR</name>
                    <description>Quad Counter Position Rotation Count Register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "QRCRR" -->
                        <field>
                            <name>QRCRR</name>
                            <description>Quad counter rotation count display bit</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "QPCRR" -->
                        <field>
                            <name>QPCRR</name>
                            <description>Quad counter position count display bit</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
