itzandroidtab/klib-svd/mb9bf566k.svd
            </registers>
        </peripheral>
        <!-- PERIPHERAL "QPRC0_NF" -->
        <peripheral>
            <name>QPRC0_NF</name>
            <description>Quadrature Position/Revolution Counter 0 Noise Filter</description>
            <groupName>QPRC0_NF</groupName>
            <baseAddress>0x40026100</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "NFCTLA" -->
                <register>
                    <name>NFCTLA</name>
                    <description>AIN Noise Control Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x37</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "AINMD" -->
                        <field>
                            <name>AINMD</name>
                            <description>Mask bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AINLV" -->
                        <field>
                            <name>AINLV</name>
                            <description>Input invert bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AINNWS" -->
                        <field>
                            <name>AINNWS</name>
                            <description>Noise filter width select bits</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "NFCTLB" -->
                <register>
                    <name>NFCTLB</name>
                    <description>BIN Noise Control Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x37</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BINMD" -->
                        <field>
                            <name>BINMD</name>
                            <description>Mask bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BINLV" -->
                        <field>
                            <name>BINLV</name>
                            <description>Input invert bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BINNWS" -->
                        <field>
                            <name>BINNWS</name>
                            <description>Noise filter width select bits</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "NFCTLZ" -->
                <register>
                    <name>NFCTLZ</name>
                    <description>ZIN Noise Control Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x37</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ZINMD" -->
                        <field>
                            <name>ZINMD</name>
                            <description>Mask bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ZINLV" -->
                        <field>
                            <name>ZINLV</name>
                            <description>Input invert bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ZINNWS" -->
                        <field>
                            <name>ZINNWS</name>
                            <description>Noise filter width select bits</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "ADC0" -->
        <peripheral>
            <name>ADC0</name>
            <description>ADC0 Registers</description>
            <groupName>ADC0</groupName>
            <baseAddress>0x40027000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x24</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x26</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x34</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x38</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x44</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x48</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x50</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "ADC0" -->
            <interrupt>
                <name>ADC0</name>
                <value>76</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "ADCR" -->
                <register>
                    <name>ADCR</name>
                    <description>A/D Control Register</description>
                    <addressOffset>0x1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xEF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SCIF" -->
                        <field>
                            <name>SCIF</name>
                            <description>Scan conversion interrupt request bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PCIF" -->
                        <field>
                            <name>PCIF</name>
                            <description>Priority conversion interrupt request bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CMPIF" -->
                        <field>
                            <name>CMPIF</name>
                            <description>Conversion result comparison interrupt request bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SCIE" -->
                        <field>
                            <name>SCIE</name>
                            <description>Scan conversion interrupt enable bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PCIE" -->
                        <field>
                            <name>PCIE</name>
                            <description>Priority conversion interrupt enable bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CMPIE" -->
                        <field>
                            <name>CMPIE</name>
                            <description>Conversion result comparison interrupt enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "OVRIE" -->
                        <field>
                            <name>OVRIE</name>
                            <description>FIFO overrun interrupt enable bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "ADSR" -->
                <register>
                    <name>ADSR</name>
                    <description>A/D Status Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xC7</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ADSTP" -->
                        <field>
                            <name>ADSTP</name>
                            <description>A/D conversion forced stop bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FDAS" -->
                        <field>
                            <name>FDAS</name>
                            <description>FIFO data placement selection bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PCNS" -->
                        <field>
                            <name>PCNS</name>
                            <description>Priority conversion pending flag </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PCS" -->
                        <field>
                            <name>PCS</name>
                            <description>Priority conversion status flag </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SCS" -->
                        <field>
                            <name>SCS</name>
                            <description>Scan conversion status flag </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "SCCR" -->
                <register>
                    <name>SCCR</name>
                    <description>Scan Conversion Control Register</description>
                    <addressOffset>0x9</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xF7</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SEMP" -->
                        <field>
                            <name>SEMP</name>
                            <description>Scan conversion FIFO empty bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "SFUL" -->
                        <field>
                            <name>SFUL</name>
                            <description>Scan conversion FIFO full bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "SOVR" -->
                        <field>
                            <name>SOVR</name>
                            <description>Scan conversion overrun flag </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SFCLR" -->
                        <field>
                            <name>SFCLR</name>
                            <description>Scan conversion FIFO clear bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RPT" -->
                        <field>
                            <name>RPT</name>
                            <description>Scan conversion repeat bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SHEN" -->
                        <field>
                            <name>SHEN</name>
                            <description>Scan conversion timer start enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SSTR" -->
                        <field>
                            <name>SSTR</name>
                            <description>Scan conversion start bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "SFNS" -->
                <register>
                    <name>SFNS</name>
                    <description>Scan Conversion FIFO Stage Count Setup Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SFS" -->
                        <field>
                            <name>SFS</name>
                            <description>Scan conversion FIFO stage count setting bit </description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "SCFD" -->
                <register>
                    <name>SCFD</name>
                    <description>Scan Conversion FIFO Data Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFF0131F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SD" -->
                        <field>
                            <name>SD</name>
                            <description>Scan conversion result </description>
                            <lsb>20</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "INVL" -->
                        <field>
                            <name>INVL</name>
                            <description>A/D conversion result disable bit </description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RS" -->
                        <field>
                            <name>RS</name>
                            <description>Scan conversion start factor</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "SC" -->
                        <field>
                            <name>SC</name>
                            <description>Conversion input channel bits</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
