itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "SCIS3" -->
                <register>
                    <name>SCIS3</name>
                    <description>Scan Conversion Input Selection Register 3</description>
                    <addressOffset>0x11</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "AN31" -->
                        <field>
                            <name>AN31</name>
                            <description>Bit7 of SCIS3</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN30" -->
                        <field>
                            <name>AN30</name>
                            <description>Bit6 of SCIS3</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN29" -->
                        <field>
                            <name>AN29</name>
                            <description>Bit5 of SCIS3</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN28" -->
                        <field>
                            <name>AN28</name>
                            <description>Bit4 of SCIS3</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN27" -->
                        <field>
                            <name>AN27</name>
                            <description>Bit3 of SCIS3</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN26" -->
                        <field>
                            <name>AN26</name>
                            <description>Bit2 of SCIS3</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN25" -->
                        <field>
                            <name>AN25</name>
                            <description>Bit1 of SCIS3</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN24" -->
                        <field>
                            <name>AN24</name>
                            <description>Bit0 of SCIS3</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "SCIS2" -->
                <register>
                    <name>SCIS2</name>
                    <description>Scan Conversion Input Selection Register 2</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "AN23" -->
                        <field>
                            <name>AN23</name>
                            <description>Bit7 of SCIS2</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN22" -->
                        <field>
                            <name>AN22</name>
                            <description>Bit6 of SCIS2</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN21" -->
                        <field>
                            <name>AN21</name>
                            <description>Bit5 of SCIS2</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN20" -->
                        <field>
                            <name>AN20</name>
                            <description>Bit4 of SCIS2</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN19" -->
                        <field>
                            <name>AN19</name>
                            <description>Bit3 of SCIS2</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN18" -->
                        <field>
                            <name>AN18</name>
                            <description>Bit2 of SCIS2</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN17" -->
                        <field>
                            <name>AN17</name>
                            <description>Bit1 of SCIS2</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN16" -->
                        <field>
                            <name>AN16</name>
                            <description>Bit0 of SCIS2</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "SCIS1" -->
                <register>
                    <name>SCIS1</name>
                    <description>Scan Conversion Input Selection Register 1</description>
                    <addressOffset>0x15</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "AN15" -->
                        <field>
                            <name>AN15</name>
                            <description>Bit7 of SCIS1</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN14" -->
                        <field>
                            <name>AN14</name>
                            <description>Bit6 of SCIS1</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN13" -->
                        <field>
                            <name>AN13</name>
                            <description>Bit5 of SCIS1</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN12" -->
                        <field>
                            <name>AN12</name>
                            <description>Bit4 of SCIS1</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN11" -->
                        <field>
                            <name>AN11</name>
                            <description>Bit3 of SCIS1</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN10" -->
                        <field>
                            <name>AN10</name>
                            <description>Bit2 of SCIS1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN9" -->
                        <field>
                            <name>AN9</name>
                            <description>Bit1 of SCIS1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN8" -->
                        <field>
                            <name>AN8</name>
                            <description>Bit0 of SCIS1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
