itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "PCIS" -->
                <register>
                    <name>PCIS</name>
                    <description>Priority Conversion Input Selection Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "P2A" -->
                        <field>
                            <name>P2A</name>
                            <description>Priority level 2 analog input selection </description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P1A" -->
                        <field>
                            <name>P1A</name>
                            <description>Priority level 1 analog input selection </description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CMPCR" -->
                <register>
                    <name>CMPCR</name>
                    <description>A/D Comparison Control Register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CMPEN" -->
                        <field>
                            <name>CMPEN</name>
                            <description>Conversion result comparison function operation enable bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CMD1" -->
                        <field>
                            <name>CMD1</name>
                            <description>Comparison mode 1</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CMD0" -->
                        <field>
                            <name>CMD0</name>
                            <description>Comparison mode 0</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CCH" -->
                        <field>
                            <name>CCH</name>
                            <description>Comparison target analog input channel</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CMPD" -->
                <register>
                    <name>CMPD</name>
                    <description>A/D Comparison Value Setup Register</description>
                    <addressOffset>0x26</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFC0</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CMAD" -->
                        <field>
                            <name>CMAD</name>
                            <description>A/D conversion result value setting bits </description>
                            <lsb>6</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "ADSS3" -->
                <register>
                    <name>ADSS3</name>
                    <description>Sampling Time Selection Register 3</description>
                    <addressOffset>0x29</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TS31" -->
                        <field>
                            <name>TS31</name>
                            <description>Bit7 of ADSS3</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS30" -->
                        <field>
                            <name>TS30</name>
                            <description>Bit6 of ADSS3</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS29" -->
                        <field>
                            <name>TS29</name>
                            <description>Bit5 of ADSS3</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS28" -->
                        <field>
                            <name>TS28</name>
                            <description>Bit4 of ADSS3</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS27" -->
                        <field>
                            <name>TS27</name>
                            <description>Bit3 of ADSS3</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS26" -->
                        <field>
                            <name>TS26</name>
                            <description>Bit2 of ADSS3</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS25" -->
                        <field>
                            <name>TS25</name>
                            <description>Bit1 of ADSS3</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS24" -->
                        <field>
                            <name>TS24</name>
                            <description>Bit0 of ADSS3</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
