itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "ADSS2" -->
                <register>
                    <name>ADSS2</name>
                    <description>Sampling Time Selection Register 2</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TS23" -->
                        <field>
                            <name>TS23</name>
                            <description>Bit7 of ADSS2</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS22" -->
                        <field>
                            <name>TS22</name>
                            <description>Bit6 of ADSS2</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS21" -->
                        <field>
                            <name>TS21</name>
                            <description>Bit5 of ADSS2</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS20" -->
                        <field>
                            <name>TS20</name>
                            <description>Bit4 of ADSS2</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS19" -->
                        <field>
                            <name>TS19</name>
                            <description>Bit3 of ADSS2</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS18" -->
                        <field>
                            <name>TS18</name>
                            <description>Bit2 of ADSS2</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS17" -->
                        <field>
                            <name>TS17</name>
                            <description>Bit1 of ADSS2</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS16" -->
                        <field>
                            <name>TS16</name>
                            <description>Bit0 of ADSS2</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "ADSS1" -->
                <register>
                    <name>ADSS1</name>
                    <description>Sampling Time Selection Register 1</description>
                    <addressOffset>0x2D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TS15" -->
                        <field>
                            <name>TS15</name>
                            <description>Bit7 of ADSS1</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS14" -->
                        <field>
                            <name>TS14</name>
                            <description>Bit6 of ADSS1</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS13" -->
                        <field>
                            <name>TS13</name>
                            <description>Bit5 of ADSS1</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS12" -->
                        <field>
                            <name>TS12</name>
                            <description>Bit4 of ADSS1</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS11" -->
                        <field>
                            <name>TS11</name>
                            <description>Bit3 of ADSS1</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS10" -->
                        <field>
                            <name>TS10</name>
                            <description>Bit2 of ADSS1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS9" -->
                        <field>
                            <name>TS9</name>
                            <description>Bit1 of ADSS1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS8" -->
                        <field>
                            <name>TS8</name>
                            <description>Bit0 of ADSS1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "ADSS0" -->
                <register>
                    <name>ADSS0</name>
                    <description>Sampling Time Selection Register 0</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TS7" -->
                        <field>
                            <name>TS7</name>
                            <description>Bit7 of ADSS0</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS6" -->
                        <field>
                            <name>TS6</name>
                            <description>Bit6 of ADSS0</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS5" -->
                        <field>
                            <name>TS5</name>
                            <description>Bit5 of ADSS0</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS4" -->
                        <field>
                            <name>TS4</name>
                            <description>Bit4 of ADSS0</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS3" -->
                        <field>
                            <name>TS3</name>
                            <description>Bit3 of ADSS0</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS2" -->
                        <field>
                            <name>TS2</name>
                            <description>Bit2 of ADSS0</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS1" -->
                        <field>
                            <name>TS1</name>
                            <description>Bit1 of ADSS0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TS0" -->
                        <field>
                            <name>TS0</name>
                            <description>Bit0 of ADSS0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
