itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "WCMPDH" -->
                <register>
                    <name>WCMPDH</name>
                    <description>Upper Limit Setup Register</description>
                    <addressOffset>0x52</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFC0</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CMHD" -->
                        <field>
                            <name>CMHD</name>
                            <description>Upper limit threshold bits</description>
                            <lsb>6</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "ADC1" -->
        <peripheral derivedFrom="ADC0">
            <name>ADC1</name>
            <baseAddress>0x40027100</baseAddress>
            <!-- INTERRUPT "ADC1" -->
            <interrupt>
                <name>ADC1</name>
                <value>77</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "DAC0" -->
        <peripheral>
            <name>DAC0</name>
            <description>D/A Converter 0</description>
            <groupName>DAC0</groupName>
            <baseAddress>0x40033000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "DACR" -->
                <register>
                    <name>DACR</name>
                    <description>D/A Control Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x33</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DDAS" -->
                        <field>
                            <name>DDAS</name>
                            <description>10-bit mode data allocation selection bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DAC10" -->
                        <field>
                            <name>DAC10</name>
                            <description>10-bit mode</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DRDY" -->
                        <field>
                            <name>DRDY</name>
                            <description>D/A converter operation enable state bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "DAE" -->
                        <field>
                            <name>DAE</name>
                            <description>D/A converter operating enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "DADR" -->
                <register>
                    <name>DADR</name>
                    <description>D/A Data Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DA" -->
                        <field>
                            <name>DA</name>
                            <description>D/A Data Register</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "DAC1" -->
        <peripheral derivedFrom="DAC0">
            <name>DAC1</name>
            <baseAddress>0x40033008</baseAddress>
        </peripheral>
        <!-- PERIPHERAL "EXTI" -->
        <peripheral>
            <name>EXTI</name>
            <description>External Interrupt and NMI Control</description>
            <groupName>EXTI</groupName>
            <baseAddress>0x40030000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "EXINT0" -->
            <interrupt>
                <name>EXINT0</name>
                <value>11</value>
            </interrupt>
            <!-- INTERRUPT "EXINT1" -->
            <interrupt>
                <name>EXINT1</name>
                <value>12</value>
            </interrupt>
            <!-- INTERRUPT "EXINT2" -->
            <interrupt>
                <name>EXINT2</name>
                <value>13</value>
            </interrupt>
            <!-- INTERRUPT "EXINT3" -->
            <interrupt>
                <name>EXINT3</name>
                <value>14</value>
            </interrupt>
            <!-- INTERRUPT "EXINT4" -->
            <interrupt>
                <name>EXINT4</name>
                <value>15</value>
            </interrupt>
            <!-- INTERRUPT "EXINT5" -->
            <interrupt>
                <name>EXINT5</name>
                <value>16</value>
            </interrupt>
            <!-- INTERRUPT "EXINT6" -->
            <interrupt>
                <name>EXINT6</name>
                <value>17</value>
            </interrupt>
            <!-- INTERRUPT "EXINT7" -->
            <interrupt>
                <name>EXINT7</name>
                <value>18</value>
            </interrupt>
            <!-- INTERRUPT "EXINT8" -->
            <interrupt>
                <name>EXINT8</name>
                <value>51</value>
            </interrupt>
            <!-- INTERRUPT "EXINT9" -->
            <interrupt>
                <name>EXINT9</name>
                <value>52</value>
            </interrupt>
            <!-- INTERRUPT "EXINT10" -->
            <interrupt>
                <name>EXINT10</name>
                <value>53</value>
            </interrupt>
            <!-- INTERRUPT "EXINT11" -->
            <interrupt>
                <name>EXINT11</name>
                <value>54</value>
            </interrupt>
            <!-- INTERRUPT "EXINT12" -->
            <interrupt>
                <name>EXINT12</name>
                <value>55</value>
            </interrupt>
            <!-- INTERRUPT "EXINT13" -->
            <interrupt>
                <name>EXINT13</name>
                <value>56</value>
            </interrupt>
            <!-- INTERRUPT "EXINT14" -->
            <interrupt>
                <name>EXINT14</name>
                <value>57</value>
            </interrupt>
            <!-- INTERRUPT "EXINT15" -->
            <interrupt>
                <name>EXINT15</name>
                <value>58</value>
            </interrupt>
            <!-- INTERRUPT "EXINT16_17_18_19" -->
            <interrupt>
                <name>EXINT16_17_18_19</name>
                <value>92</value>
            </interrupt>
            <!-- INTERRUPT "EXINT20_21_22_23" -->
            <interrupt>
                <name>EXINT20_21_22_23</name>
                <value>93</value>
            </interrupt>
            <!-- INTERRUPT "EXINT24_25_26_27" -->
            <interrupt>
                <name>EXINT24_25_26_27</name>
                <value>94</value>
            </interrupt>
            <!-- INTERRUPT "EXINT28_29_30_31" -->
            <interrupt>
                <name>EXINT28_29_30_31</name>
                <value>95</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "ENIR" -->
                <register>
                    <name>ENIR</name>
                    <description>Enable Interrupt Request Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EN31" -->
                        <field>
                            <name>EN31</name>
                            <description>Bit31 of ENIR</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN30" -->
                        <field>
                            <name>EN30</name>
                            <description>Bit30 of ENIR</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN29" -->
                        <field>
                            <name>EN29</name>
                            <description>Bit29 of ENIR</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN28" -->
                        <field>
                            <name>EN28</name>
                            <description>Bit28 of ENIR</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN27" -->
                        <field>
                            <name>EN27</name>
                            <description>Bit27 of ENIR</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN26" -->
                        <field>
                            <name>EN26</name>
                            <description>Bit26 of ENIR</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN25" -->
                        <field>
                            <name>EN25</name>
                            <description>Bit25 of ENIR</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN24" -->
                        <field>
                            <name>EN24</name>
                            <description>Bit24 of ENIR</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN23" -->
                        <field>
                            <name>EN23</name>
                            <description>Bit23 of ENIR</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN22" -->
                        <field>
                            <name>EN22</name>
                            <description>Bit22 of ENIR</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN21" -->
                        <field>
                            <name>EN21</name>
                            <description>Bit21 of ENIR</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN20" -->
                        <field>
                            <name>EN20</name>
                            <description>Bit20 of ENIR</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN19" -->
                        <field>
                            <name>EN19</name>
                            <description>Bit19 of ENIR</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN18" -->
                        <field>
                            <name>EN18</name>
                            <description>Bit18 of ENIR</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN17" -->
                        <field>
                            <name>EN17</name>
                            <description>Bit17 of ENIR</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN16" -->
                        <field>
                            <name>EN16</name>
                            <description>Bit16 of ENIR</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN15" -->
                        <field>
                            <name>EN15</name>
                            <description>Bit15 of ENIR</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN14" -->
                        <field>
                            <name>EN14</name>
                            <description>Bit14 of ENIR</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN13" -->
                        <field>
                            <name>EN13</name>
                            <description>Bit13 of ENIR</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN12" -->
                        <field>
                            <name>EN12</name>
                            <description>Bit12 of ENIR</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN11" -->
                        <field>
                            <name>EN11</name>
                            <description>Bit11 of ENIR</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN10" -->
                        <field>
                            <name>EN10</name>
                            <description>Bit10 of ENIR</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN9" -->
                        <field>
                            <name>EN9</name>
                            <description>Bit9 of ENIR</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN8" -->
                        <field>
                            <name>EN8</name>
                            <description>Bit8 of ENIR</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN7" -->
                        <field>
                            <name>EN7</name>
                            <description>Bit7 of ENIR</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN6" -->
                        <field>
                            <name>EN6</name>
                            <description>Bit6 of ENIR</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN5" -->
                        <field>
                            <name>EN5</name>
                            <description>Bit5 of ENIR</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN4" -->
                        <field>
                            <name>EN4</name>
                            <description>Bit4 of ENIR</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN3" -->
                        <field>
                            <name>EN3</name>
                            <description>Bit3 of ENIR</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN2" -->
                        <field>
                            <name>EN2</name>
                            <description>Bit2 of ENIR</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN1" -->
                        <field>
                            <name>EN1</name>
                            <description>Bit1 of ENIR</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EN0" -->
                        <field>
                            <name>EN0</name>
                            <description>Bit0 of ENIR</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
