itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "EIRR" -->
                <register>
                    <name>EIRR</name>
                    <description>External Interrupt Request Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ER31" -->
                        <field>
                            <name>ER31</name>
                            <description>Bit31 of EIRR</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER30" -->
                        <field>
                            <name>ER30</name>
                            <description>Bit30 of EIRR</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER29" -->
                        <field>
                            <name>ER29</name>
                            <description>Bit29 of EIRR</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER28" -->
                        <field>
                            <name>ER28</name>
                            <description>Bit28 of EIRR</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER27" -->
                        <field>
                            <name>ER27</name>
                            <description>Bit27 of EIRR</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER26" -->
                        <field>
                            <name>ER26</name>
                            <description>Bit26 of EIRR</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER25" -->
                        <field>
                            <name>ER25</name>
                            <description>Bit25 of EIRR</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER24" -->
                        <field>
                            <name>ER24</name>
                            <description>Bit24 of EIRR</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER23" -->
                        <field>
                            <name>ER23</name>
                            <description>Bit23 of EIRR</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER22" -->
                        <field>
                            <name>ER22</name>
                            <description>Bit22 of EIRR</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER21" -->
                        <field>
                            <name>ER21</name>
                            <description>Bit21 of EIRR</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER20" -->
                        <field>
                            <name>ER20</name>
                            <description>Bit20 of EIRR</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER19" -->
                        <field>
                            <name>ER19</name>
                            <description>Bit19 of EIRR</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER18" -->
                        <field>
                            <name>ER18</name>
                            <description>Bit18 of EIRR</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER17" -->
                        <field>
                            <name>ER17</name>
                            <description>Bit17 of EIRR</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER16" -->
                        <field>
                            <name>ER16</name>
                            <description>Bit16 of EIRR</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER15" -->
                        <field>
                            <name>ER15</name>
                            <description>Bit15 of EIRR</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER14" -->
                        <field>
                            <name>ER14</name>
                            <description>Bit14 of EIRR</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER13" -->
                        <field>
                            <name>ER13</name>
                            <description>Bit13 of EIRR</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER12" -->
                        <field>
                            <name>ER12</name>
                            <description>Bit12 of EIRR</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER11" -->
                        <field>
                            <name>ER11</name>
                            <description>Bit11 of EIRR</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER10" -->
                        <field>
                            <name>ER10</name>
                            <description>Bit10 of EIRR</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER9" -->
                        <field>
                            <name>ER9</name>
                            <description>Bit9 of EIRR</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER8" -->
                        <field>
                            <name>ER8</name>
                            <description>Bit8 of EIRR</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER7" -->
                        <field>
                            <name>ER7</name>
                            <description>Bit7 of EIRR</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER6" -->
                        <field>
                            <name>ER6</name>
                            <description>Bit6 of EIRR</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER5" -->
                        <field>
                            <name>ER5</name>
                            <description>Bit5 of EIRR</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER4" -->
                        <field>
                            <name>ER4</name>
                            <description>Bit4 of EIRR</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER3" -->
                        <field>
                            <name>ER3</name>
                            <description>Bit3 of EIRR</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER2" -->
                        <field>
                            <name>ER2</name>
                            <description>Bit2 of EIRR</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER1" -->
                        <field>
                            <name>ER1</name>
                            <description>Bit1 of EIRR</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ER0" -->
                        <field>
                            <name>ER0</name>
                            <description>Bit0 of EIRR</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
