itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "ELVR" -->
                <register>
                    <name>ELVR</name>
                    <description>External Interrupt Level Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "LB15" -->
                        <field>
                            <name>LB15</name>
                            <description>Bit31 of ELVR</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA15" -->
                        <field>
                            <name>LA15</name>
                            <description>Bit30 of ELVR</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB14" -->
                        <field>
                            <name>LB14</name>
                            <description>Bit29 of ELVR</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA14" -->
                        <field>
                            <name>LA14</name>
                            <description>Bit28 of ELVR</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB13" -->
                        <field>
                            <name>LB13</name>
                            <description>Bit27 of ELVR</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA13" -->
                        <field>
                            <name>LA13</name>
                            <description>Bit26 of ELVR</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB12" -->
                        <field>
                            <name>LB12</name>
                            <description>Bit25 of ELVR</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA12" -->
                        <field>
                            <name>LA12</name>
                            <description>Bit24 of ELVR</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB11" -->
                        <field>
                            <name>LB11</name>
                            <description>Bit23 of ELVR</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA11" -->
                        <field>
                            <name>LA11</name>
                            <description>Bit22 of ELVR</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB10" -->
                        <field>
                            <name>LB10</name>
                            <description>Bit21 of ELVR</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA10" -->
                        <field>
                            <name>LA10</name>
                            <description>Bit20 of ELVR</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB9" -->
                        <field>
                            <name>LB9</name>
                            <description>Bit19 of ELVR</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA9" -->
                        <field>
                            <name>LA9</name>
                            <description>Bit18 of ELVR</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB8" -->
                        <field>
                            <name>LB8</name>
                            <description>Bit17 of ELVR</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA8" -->
                        <field>
                            <name>LA8</name>
                            <description>Bit16 of ELVR</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB7" -->
                        <field>
                            <name>LB7</name>
                            <description>Bit15 of ELVR</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA7" -->
                        <field>
                            <name>LA7</name>
                            <description>Bit14 of ELVR</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB6" -->
                        <field>
                            <name>LB6</name>
                            <description>Bit13 of ELVR</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA6" -->
                        <field>
                            <name>LA6</name>
                            <description>Bit12 of ELVR</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB5" -->
                        <field>
                            <name>LB5</name>
                            <description>Bit11 of ELVR</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA5" -->
                        <field>
                            <name>LA5</name>
                            <description>Bit10 of ELVR</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB4" -->
                        <field>
                            <name>LB4</name>
                            <description>Bit9 of ELVR</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA4" -->
                        <field>
                            <name>LA4</name>
                            <description>Bit8 of ELVR</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB3" -->
                        <field>
                            <name>LB3</name>
                            <description>Bit7 of ELVR</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA3" -->
                        <field>
                            <name>LA3</name>
                            <description>Bit6 of ELVR</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB2" -->
                        <field>
                            <name>LB2</name>
                            <description>Bit5 of ELVR</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA2" -->
                        <field>
                            <name>LA2</name>
                            <description>Bit4 of ELVR</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB1" -->
                        <field>
                            <name>LB1</name>
                            <description>Bit3 of ELVR</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA1" -->
                        <field>
                            <name>LA1</name>
                            <description>Bit2 of ELVR</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LB0" -->
                        <field>
                            <name>LB0</name>
                            <description>Bit1 of ELVR</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LA0" -->
                        <field>
                            <name>LA0</name>
                            <description>Bit0 of ELVR</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
