itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ003MON" -->
                <register>
                    <name>IRQ003MON</name>
                    <description>IRQ003 Batch Read Register</description>
                    <addressOffset>0x210</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IRQBIT7" -->
                        <field>
                            <name>IRQBIT7</name>
                            <description>interrupt request of the interrupt selected in bit7 of
                                IRQ003SEL Register</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT6" -->
                        <field>
                            <name>IRQBIT6</name>
                            <description>interrupt request of the interrupt selected in bit6 of
                                IRQ003SEL Register</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT5" -->
                        <field>
                            <name>IRQBIT5</name>
                            <description>interrupt request of the interrupt selected in bit5 of
                                IRQ003SEL Register</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT4" -->
                        <field>
                            <name>IRQBIT4</name>
                            <description>interrupt request of the interrupt selected in bit4 of
                                IRQ003SEL Register</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT3" -->
                        <field>
                            <name>IRQBIT3</name>
                            <description>interrupt request of the interrupt selected in bit3 of
                                IRQ003SEL Register</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT2" -->
                        <field>
                            <name>IRQBIT2</name>
                            <description>interrupt request of the interrupt selected in bit2 of
                                IRQ003SEL Register</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT1" -->
                        <field>
                            <name>IRQBIT1</name>
                            <description>interrupt request of the interrupt selected in bit1 of
                                IRQ003SEL Register</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT0" -->
                        <field>
                            <name>IRQBIT0</name>
                            <description>interrupt request of the interrupt selected in bit0 of
                                IRQ003SEL Register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ004MON" -->
                <register>
                    <name>IRQ004MON</name>
                    <description>IRQ004 Batch Read Register</description>
                    <addressOffset>0x214</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IRQBIT7" -->
                        <field>
                            <name>IRQBIT7</name>
                            <description>interrupt request of the interrupt selected in bit7 of
                                IRQ004SEL Register</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT6" -->
                        <field>
                            <name>IRQBIT6</name>
                            <description>interrupt request of the interrupt selected in bit6 of
                                IRQ004SEL Register</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT5" -->
                        <field>
                            <name>IRQBIT5</name>
                            <description>interrupt request of the interrupt selected in bit5 of
                                IRQ004SEL Register</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT4" -->
                        <field>
                            <name>IRQBIT4</name>
                            <description>interrupt request of the interrupt selected in bit4 of
                                IRQ004SEL Register</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT3" -->
                        <field>
                            <name>IRQBIT3</name>
                            <description>interrupt request of the interrupt selected in bit3 of
                                IRQ004SEL Register</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT2" -->
                        <field>
                            <name>IRQBIT2</name>
                            <description>interrupt request of the interrupt selected in bit2 of
                                IRQ004SEL Register</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT1" -->
                        <field>
                            <name>IRQBIT1</name>
                            <description>interrupt request of the interrupt selected in bit1 of
                                IRQ004SEL Register</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT0" -->
                        <field>
                            <name>IRQBIT0</name>
                            <description>interrupt request of the interrupt selected in bit0 of
                                IRQ004SEL Register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ005MON" -->
                <register>
                    <name>IRQ005MON</name>
                    <description>IRQ005 Batch Read Register</description>
                    <addressOffset>0x218</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IRQBIT7" -->
                        <field>
                            <name>IRQBIT7</name>
                            <description>interrupt request of the interrupt selected in bit7 of
                                IRQ005SEL Register</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT6" -->
                        <field>
                            <name>IRQBIT6</name>
                            <description>interrupt request of the interrupt selected in bit6 of
                                IRQ005SEL Register</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT5" -->
                        <field>
                            <name>IRQBIT5</name>
                            <description>interrupt request of the interrupt selected in bit5 of
                                IRQ005SEL Register</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT4" -->
                        <field>
                            <name>IRQBIT4</name>
                            <description>interrupt request of the interrupt selected in bit4 of
                                IRQ005SEL Register</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT3" -->
                        <field>
                            <name>IRQBIT3</name>
                            <description>interrupt request of the interrupt selected in bit3 of
                                IRQ005SEL Register</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT2" -->
                        <field>
                            <name>IRQBIT2</name>
                            <description>interrupt request of the interrupt selected in bit2 of
                                IRQ005SEL Register</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT1" -->
                        <field>
                            <name>IRQBIT1</name>
                            <description>interrupt request of the interrupt selected in bit1 of
                                IRQ005SEL Register</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT0" -->
                        <field>
                            <name>IRQBIT0</name>
                            <description>interrupt request of the interrupt selected in bit0 of
                                IRQ005SEL Register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ006MON" -->
                <register>
                    <name>IRQ006MON</name>
                    <description>IRQ006 Batch Read Register</description>
                    <addressOffset>0x21C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IRQBIT7" -->
                        <field>
                            <name>IRQBIT7</name>
                            <description>interrupt request of the interrupt selected in bit7 of
                                IRQ006SEL Register</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT6" -->
                        <field>
                            <name>IRQBIT6</name>
                            <description>interrupt request of the interrupt selected in bit6 of
                                IRQ006SEL Register</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT5" -->
                        <field>
                            <name>IRQBIT5</name>
                            <description>interrupt request of the interrupt selected in bit5 of
                                IRQ006SEL Register</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT4" -->
                        <field>
                            <name>IRQBIT4</name>
                            <description>interrupt request of the interrupt selected in bit4 of
                                IRQ006SEL Register</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT3" -->
                        <field>
                            <name>IRQBIT3</name>
                            <description>interrupt request of the interrupt selected in bit3 of
                                IRQ006SEL Register</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT2" -->
                        <field>
                            <name>IRQBIT2</name>
                            <description>interrupt request of the interrupt selected in bit2 of
                                IRQ006SEL Register</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT1" -->
                        <field>
                            <name>IRQBIT1</name>
                            <description>interrupt request of the interrupt selected in bit1 of
                                IRQ006SEL Register</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT0" -->
                        <field>
                            <name>IRQBIT0</name>
                            <description>interrupt request of the interrupt selected in bit0 of
                                IRQ006SEL Register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
