itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ007MON" -->
                <register>
                    <name>IRQ007MON</name>
                    <description>IRQ007 Batch Read Register</description>
                    <addressOffset>0x220</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IRQBIT7" -->
                        <field>
                            <name>IRQBIT7</name>
                            <description>interrupt request of the interrupt selected in bit7 of
                                IRQ007SEL Register</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT6" -->
                        <field>
                            <name>IRQBIT6</name>
                            <description>interrupt request of the interrupt selected in bit6 of
                                IRQ007SEL Register</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT5" -->
                        <field>
                            <name>IRQBIT5</name>
                            <description>interrupt request of the interrupt selected in bit5 of
                                IRQ007SEL Register</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT4" -->
                        <field>
                            <name>IRQBIT4</name>
                            <description>interrupt request of the interrupt selected in bit4 of
                                IRQ007SEL Register</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT3" -->
                        <field>
                            <name>IRQBIT3</name>
                            <description>interrupt request of the interrupt selected in bit3 of
                                IRQ007SEL Register</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT2" -->
                        <field>
                            <name>IRQBIT2</name>
                            <description>interrupt request of the interrupt selected in bit2 of
                                IRQ007SEL Register</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT1" -->
                        <field>
                            <name>IRQBIT1</name>
                            <description>interrupt request of the interrupt selected in bit1 of
                                IRQ007SEL Register</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT0" -->
                        <field>
                            <name>IRQBIT0</name>
                            <description>interrupt request of the interrupt selected in bit0 of
                                IRQ007SEL Register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ008MON" -->
                <register>
                    <name>IRQ008MON</name>
                    <description>IRQ008 Batch Read Register</description>
                    <addressOffset>0x224</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IRQBIT7" -->
                        <field>
                            <name>IRQBIT7</name>
                            <description>interrupt request of the interrupt selected in bit7 of
                                IRQ008SEL Register</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT6" -->
                        <field>
                            <name>IRQBIT6</name>
                            <description>interrupt request of the interrupt selected in bit6 of
                                IRQ008SEL Register</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT5" -->
                        <field>
                            <name>IRQBIT5</name>
                            <description>interrupt request of the interrupt selected in bit5 of
                                IRQ008SEL Register</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT4" -->
                        <field>
                            <name>IRQBIT4</name>
                            <description>interrupt request of the interrupt selected in bit4 of
                                IRQ008SEL Register</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT3" -->
                        <field>
                            <name>IRQBIT3</name>
                            <description>interrupt request of the interrupt selected in bit3 of
                                IRQ008SEL Register</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT2" -->
                        <field>
                            <name>IRQBIT2</name>
                            <description>interrupt request of the interrupt selected in bit2 of
                                IRQ008SEL Register</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT1" -->
                        <field>
                            <name>IRQBIT1</name>
                            <description>interrupt request of the interrupt selected in bit1 of
                                IRQ008SEL Register</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT0" -->
                        <field>
                            <name>IRQBIT0</name>
                            <description>interrupt request of the interrupt selected in bit0 of
                                IRQ008SEL Register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ009MON" -->
                <register>
                    <name>IRQ009MON</name>
                    <description>IRQ009 Batch Read Register</description>
                    <addressOffset>0x228</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IRQBIT7" -->
                        <field>
                            <name>IRQBIT7</name>
                            <description>interrupt request of the interrupt selected in bit7 of
                                IRQ009SEL Register</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT6" -->
                        <field>
                            <name>IRQBIT6</name>
                            <description>interrupt request of the interrupt selected in bit6 of
                                IRQ009SEL Register</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT5" -->
                        <field>
                            <name>IRQBIT5</name>
                            <description>interrupt request of the interrupt selected in bit5 of
                                IRQ009SEL Register</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT4" -->
                        <field>
                            <name>IRQBIT4</name>
                            <description>interrupt request of the interrupt selected in bit4 of
                                IRQ009SEL Register</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT3" -->
                        <field>
                            <name>IRQBIT3</name>
                            <description>interrupt request of the interrupt selected in bit3 of
                                IRQ009SEL Register</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT2" -->
                        <field>
                            <name>IRQBIT2</name>
                            <description>interrupt request of the interrupt selected in bit2 of
                                IRQ009SEL Register</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT1" -->
                        <field>
                            <name>IRQBIT1</name>
                            <description>interrupt request of the interrupt selected in bit1 of
                                IRQ009SEL Register</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT0" -->
                        <field>
                            <name>IRQBIT0</name>
                            <description>interrupt request of the interrupt selected in bit0 of
                                IRQ009SEL Register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ010MON" -->
                <register>
                    <name>IRQ010MON</name>
                    <description>IRQ010 Batch Read Register</description>
                    <addressOffset>0x22C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IRQBIT7" -->
                        <field>
                            <name>IRQBIT7</name>
                            <description>interrupt request of the interrupt selected in bit7 of
                                IRQ010SEL Register</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT6" -->
                        <field>
                            <name>IRQBIT6</name>
                            <description>interrupt request of the interrupt selected in bit6 of
                                IRQ010SEL Register</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT5" -->
                        <field>
                            <name>IRQBIT5</name>
                            <description>interrupt request of the interrupt selected in bit5 of
                                IRQ010SEL Register</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT4" -->
                        <field>
                            <name>IRQBIT4</name>
                            <description>interrupt request of the interrupt selected in bit4 of
                                IRQ010SEL Register</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT3" -->
                        <field>
                            <name>IRQBIT3</name>
                            <description>interrupt request of the interrupt selected in bit3 of
                                IRQ010SEL Register</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT2" -->
                        <field>
                            <name>IRQBIT2</name>
                            <description>interrupt request of the interrupt selected in bit2 of
                                IRQ010SEL Register</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT1" -->
                        <field>
                            <name>IRQBIT1</name>
                            <description>interrupt request of the interrupt selected in bit1 of
                                IRQ010SEL Register</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "IRQBIT0" -->
                        <field>
                            <name>IRQBIT0</name>
                            <description>interrupt request of the interrupt selected in bit0 of
                                IRQ010SEL Register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
