itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ019MON" -->
                <register>
                    <name>IRQ019MON</name>
                    <description>IRQ019 Batch Read Register</description>
                    <addressOffset>0x250</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "QUDINT5" -->
                        <field>
                            <name>QUDINT5</name>
                            <description>PC match and RC match interrupt request of QPRC ch.0</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "QUDINT4" -->
                        <field>
                            <name>QUDINT4</name>
                            <description>Out-of-range interrupt request of QPRC ch.0QPRC ch.0</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "QUDINT3" -->
                        <field>
                            <name>QUDINT3</name>
                            <description>Count inversion interrupt request of QPRC ch.0</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "QUDINT2" -->
                        <field>
                            <name>QUDINT2</name>
                            <description>Overflow / underflow / zero index interrupt request of QPRC
                                ch.0</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "QUDINT1" -->
                        <field>
                            <name>QUDINT1</name>
                            <description>PC and RC match interrupt request of QPRC ch.0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "QUDINT0" -->
                        <field>
                            <name>QUDINT0</name>
                            <description>PC match interrupt request of QPRC ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ020MON" -->
                <register>
                    <name>IRQ020MON</name>
                    <description>IRQ020 Batch Read Register</description>
                    <addressOffset>0x254</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ021MON" -->
                <register>
                    <name>IRQ021MON</name>
                    <description>IRQ021 Batch Read Register</description>
                    <addressOffset>0x258</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WAVEINT3" -->
                        <field>
                            <name>WAVEINT3</name>
                            <description>Interrupt request of WFG timer 54 of the MFT unit 0</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WAVEINT2" -->
                        <field>
                            <name>WAVEINT2</name>
                            <description>Interrupt request of WFG timer 32 of the MFT unit 0</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WAVEINT1" -->
                        <field>
                            <name>WAVEINT1</name>
                            <description>Interrupt request of WFG timer 10 of the MFT unit 0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WAVEINT0" -->
                        <field>
                            <name>WAVEINT0</name>
                            <description>Interrupt request of the DTIF (motor emergency stop) of the
                                MFT unit 0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ022MON" -->
                <register>
                    <name>IRQ022MON</name>
                    <description>IRQ022 Batch Read Register</description>
                    <addressOffset>0x25C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WAVEINT3" -->
                        <field>
                            <name>WAVEINT3</name>
                            <description>Interrupt request of WFG timer 54 of the MFT unit 1</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WAVEINT2" -->
                        <field>
                            <name>WAVEINT2</name>
                            <description>Interrupt request of WFG timer 32 of the MFT unit 1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WAVEINT1" -->
                        <field>
                            <name>WAVEINT1</name>
                            <description>Interrupt request of WFG timer 10 of the MFT unit 1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WAVEINT0" -->
                        <field>
                            <name>WAVEINT0</name>
                            <description>Interrupt request of the DTIF (motor emergency stop) of the
                                MFT unit 1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ023MON" -->
                <register>
                    <name>IRQ023MON</name>
                    <description>IRQ023 Batch Read Register</description>
                    <addressOffset>0x260</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WAVEINT3" -->
                        <field>
                            <name>WAVEINT3</name>
                            <description>Interrupt request of WFG timer 54 of the MFT unit 2</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WAVEINT2" -->
                        <field>
                            <name>WAVEINT2</name>
                            <description>Interrupt request of WFG timer 32 of the MFT unit 2</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WAVEINT1" -->
                        <field>
                            <name>WAVEINT1</name>
                            <description>Interrupt request of WFG timer 10 of the MFT unit 2</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WAVEINT0" -->
                        <field>
                            <name>WAVEINT0</name>
                            <description>Interrupt request of the DTIF (motor emergency stop) of the
                                MFT unit 2</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
