itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ028MON" -->
                <register>
                    <name>IRQ028MON</name>
                    <description>IRQ028 Batch Read Register</description>
                    <addressOffset>0x274</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x07</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FRT_PEAK_INT2" -->
                        <field>
                            <name>FRT_PEAK_INT2</name>
                            <description>FRT ch.2 peak value detection interrupt request of the MFT
                                unit 1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "FRT_PEAK_INT1" -->
                        <field>
                            <name>FRT_PEAK_INT1</name>
                            <description>FRT ch.1 peak value detection interrupt request of the MFT
                                unit 1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "FRT_PEAK_INT0" -->
                        <field>
                            <name>FRT_PEAK_INT0</name>
                            <description>FRT ch.0 peak value detection interrupt request of the MFT
                                unit 1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ029MON" -->
                <register>
                    <name>IRQ029MON</name>
                    <description>IRQ029 Batch Read Register</description>
                    <addressOffset>0x278</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x07</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FRT_ZERO_INT2" -->
                        <field>
                            <name>FRT_ZERO_INT2</name>
                            <description>FRT ch.2 zero detection interrupt request of the MFT unit 1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "FRT_ZERO_INT1" -->
                        <field>
                            <name>FRT_ZERO_INT1</name>
                            <description>FRT ch.1 zero detection interrupt request of the MFT unit 1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "FRT_ZERO_INT0" -->
                        <field>
                            <name>FRT_ZERO_INT0</name>
                            <description>FRT ch.0 zero detection interrupt request of the MFT unit 1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ030MON" -->
                <register>
                    <name>IRQ030MON</name>
                    <description>IRQ030 Batch Read Register</description>
                    <addressOffset>0x27C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ICUINT3" -->
                        <field>
                            <name>ICUINT3</name>
                            <description>ICU ch.3 input edge detection interrupt request of the MFT
                                unit 1</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ICUINT2" -->
                        <field>
                            <name>ICUINT2</name>
                            <description>ICU ch.2 input edge detection interrupt request of the MFT
                                unit 1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ICUINT1" -->
                        <field>
                            <name>ICUINT1</name>
                            <description>ICU ch.1 input edge detection interrupt request of the MFT
                                unit 1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ICUINT0" -->
                        <field>
                            <name>ICUINT0</name>
                            <description>ICU ch.0 input edge detection interrupt request of the MFT
                                unit 1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ031MON" -->
                <register>
                    <name>IRQ031MON</name>
                    <description>IRQ031 Batch Read Register</description>
                    <addressOffset>0x280</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "OCUINT5" -->
                        <field>
                            <name>OCUINT5</name>
                            <description>OCU ch.5 match detection interrupt request of the MFT unit
                                1</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "OCUINT4" -->
                        <field>
                            <name>OCUINT4</name>
                            <description>OCU ch.4 match detection interrupt request of the MFT unit
                                1</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "OCUINT3" -->
                        <field>
                            <name>OCUINT3</name>
                            <description>OCU ch.3 match detection interrupt request of the MFT unit
                                1</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "OCUINT2" -->
                        <field>
                            <name>OCUINT2</name>
                            <description>OCU ch.2 match detection interrupt request of the MFT unit
                                1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "OCUINT1" -->
                        <field>
                            <name>OCUINT1</name>
                            <description>OCU ch.1 match detection interrupt request of the MFT unit
                                1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "OCUINT0" -->
                        <field>
                            <name>OCUINT0</name>
                            <description>OCU ch.0 match detection interrupt request of the MFT unit
                                1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
