itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ036MON" -->
                <register>
                    <name>IRQ036MON</name>
                    <description>IRQ036 Batch Read Register</description>
                    <addressOffset>0x294</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x07</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "PPGINT2" -->
                        <field>
                            <name>PPGINT2</name>
                            <description>Interrupt request of the PPG ch.4</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "PPGINT1" -->
                        <field>
                            <name>PPGINT1</name>
                            <description>Interrupt request of the PPG ch.2</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "PPGINT0" -->
                        <field>
                            <name>PPGINT0</name>
                            <description>Interrupt request of the PPG ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ037MON" -->
                <register>
                    <name>IRQ037MON</name>
                    <description>IRQ037 Batch Read Register</description>
                    <addressOffset>0x298</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x07</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "PPGINT2" -->
                        <field>
                            <name>PPGINT2</name>
                            <description>Interrupt request of the PPG ch.12</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "PPGINT1" -->
                        <field>
                            <name>PPGINT1</name>
                            <description>Interrupt request of the PPG ch.10</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "PPGINT0" -->
                        <field>
                            <name>PPGINT0</name>
                            <description>Interrupt request of the PPG ch.8</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ038MON" -->
                <register>
                    <name>IRQ038MON</name>
                    <description>IRQ038 Batch Read Register</description>
                    <addressOffset>0x29C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x07</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "PPGINT2" -->
                        <field>
                            <name>PPGINT2</name>
                            <description>Interrupt request of the PPG ch.20</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "PPGINT1" -->
                        <field>
                            <name>PPGINT1</name>
                            <description>Interrupt request of the PPG ch.18</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "PPGINT0" -->
                        <field>
                            <name>PPGINT0</name>
                            <description>Interrupt request of the PPG ch.16</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ039MON" -->
                <register>
                    <name>IRQ039MON</name>
                    <description>IRQ039 Batch Read Register</description>
                    <addressOffset>0x2A0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer ch.0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ040MON" -->
                <register>
                    <name>IRQ040MON</name>
                    <description>IRQ040 Batch Read Register</description>
                    <addressOffset>0x2A4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer ch.1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer ch.1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
