itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ041MON" -->
                <register>
                    <name>IRQ041MON</name>
                    <description>IRQ041 Batch Read Register</description>
                    <addressOffset>0x2A8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer ch.2</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer ch.2</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ042MON" -->
                <register>
                    <name>IRQ042MON</name>
                    <description>IRQ042 Batch Read Register</description>
                    <addressOffset>0x2AC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer ch.3</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer ch.3</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ043MON" -->
                <register>
                    <name>IRQ043MON</name>
                    <description>IRQ043 Batch Read Register</description>
                    <addressOffset>0x2B0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer ch.4</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer ch.4</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ044MON" -->
                <register>
                    <name>IRQ044MON</name>
                    <description>IRQ044 Batch Read Register</description>
                    <addressOffset>0x2B4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer ch.5</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer ch.5</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ045MON" -->
                <register>
                    <name>IRQ045MON</name>
                    <description>IRQ045 Batch Read Register</description>
                    <addressOffset>0x2B8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer ch.6</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer ch.6</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ046MON" -->
                <register>
                    <name>IRQ046MON</name>
                    <description>IRQ046 Batch Read Register</description>
                    <addressOffset>0x2BC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer ch.7</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer ch.7</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ047MON" -->
                <register>
                    <name>IRQ047MON</name>
                    <description>IRQ047 Batch Read Register</description>
                    <addressOffset>0x2C0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TIMINT2" -->
                        <field>
                            <name>TIMINT2</name>
                            <description>Dual timer TIMINT2 interrupt request</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TIMINT1" -->
                        <field>
                            <name>TIMINT1</name>
                            <description>Dual timer TIMINT1 interrupt request</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ048MON" -->
                <register>
                    <name>IRQ048MON</name>
                    <description>IRQ048 Batch Read Register</description>
                    <addressOffset>0x2C4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x01</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WCINT" -->
                        <field>
                            <name>WCINT</name>
                            <description>Interrupt request of the watch counter</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
