itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ057MON" -->
                <register>
                    <name>IRQ057MON</name>
                    <description>IRQ057 Batch Read Register</description>
                    <addressOffset>0x2E8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EXTINT" -->
                        <field>
                            <name>EXTINT</name>
                            <description>Interrupt request of the external pin interrupt ch.14</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ058MON" -->
                <register>
                    <name>IRQ058MON</name>
                    <description>IRQ058 Batch Read Register</description>
                    <addressOffset>0x2EC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EXTINT" -->
                        <field>
                            <name>EXTINT</name>
                            <description>Interrupt request of the external pin interrupt ch.15</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ059MON" -->
                <register>
                    <name>IRQ059MON</name>
                    <description>IRQ059 Batch Read Register</description>
                    <addressOffset>0x2F0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "UPLLINT" -->
                        <field>
                            <name>UPLLINT</name>
                            <description>PLL of USB / Ethernet oscillation stabilization wait
                                completion interrupt</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MPLLINT" -->
                        <field>
                            <name>MPLLINT</name>
                            <description>Main PLL oscillation stabilization wait completion
                                interrupt</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "SOSCINT" -->
                        <field>
                            <name>SOSCINT</name>
                            <description>Sub clock oscillation stabilization wait completion
                                interrupt</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MOSCINT" -->
                        <field>
                            <name>MOSCINT</name>
                            <description>Main clock oscillation stabilization wait completion
                                interrupt</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ060MON" -->
                <register>
                    <name>IRQ060MON</name>
                    <description>IRQ060 Batch Read Register</description>
                    <addressOffset>0x2F4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSRINT" -->
                        <field>
                            <name>MFSRINT</name>
                            <description>Reception interrupt request of the MFS ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ061MON" -->
                <register>
                    <name>IRQ061MON</name>
                    <description>IRQ061 Batch Read Register</description>
                    <addressOffset>0x2F8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSINT1" -->
                        <field>
                            <name>MFSINT1</name>
                            <description>Status interrupt request of the MFS ch.0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MFSINT0" -->
                        <field>
                            <name>MFSINT0</name>
                            <description>Transmission interrupt request of the MFS ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
