itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ062MON" -->
                <register>
                    <name>IRQ062MON</name>
                    <description>IRQ062 Batch Read Register</description>
                    <addressOffset>0x2FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSRINT" -->
                        <field>
                            <name>MFSRINT</name>
                            <description>Reception interrupt request of the MFS ch.1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ063MON" -->
                <register>
                    <name>IRQ063MON</name>
                    <description>IRQ063 Batch Read Register</description>
                    <addressOffset>0x300</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSINT1" -->
                        <field>
                            <name>MFSINT1</name>
                            <description>Status interrupt request of the MFS ch.1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MFSINT0" -->
                        <field>
                            <name>MFSINT0</name>
                            <description>Transmission interrupt request of the MFS ch.1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ064MON" -->
                <register>
                    <name>IRQ064MON</name>
                    <description>IRQ064 Batch Read Register</description>
                    <addressOffset>0x304</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSRINT" -->
                        <field>
                            <name>MFSRINT</name>
                            <description>Reception interrupt request of the MFS ch.2</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ065MON" -->
                <register>
                    <name>IRQ065MON</name>
                    <description>IRQ065 Batch Read Register</description>
                    <addressOffset>0x308</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSINT1" -->
                        <field>
                            <name>MFSINT1</name>
                            <description>Status interrupt request of the MFS ch.2</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MFSINT0" -->
                        <field>
                            <name>MFSINT0</name>
                            <description>Transmission interrupt request of the MFS ch.2</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ066MON" -->
                <register>
                    <name>IRQ066MON</name>
                    <description>IRQ066 Batch Read Register</description>
                    <addressOffset>0x30C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSRINT" -->
                        <field>
                            <name>MFSRINT</name>
                            <description>Reception interrupt request of the MFS ch.3</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ067MON" -->
                <register>
                    <name>IRQ067MON</name>
                    <description>IRQ067 Batch Read Register</description>
                    <addressOffset>0x310</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSINT1" -->
                        <field>
                            <name>MFSINT1</name>
                            <description>Status interrupt request of the MFS ch.3</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MFSINT0" -->
                        <field>
                            <name>MFSINT0</name>
                            <description>Transmission interrupt request of the MFS ch.3</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ068MON" -->
                <register>
                    <name>IRQ068MON</name>
                    <description>IRQ068 Batch Read Register</description>
                    <addressOffset>0x314</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSRINT" -->
                        <field>
                            <name>MFSRINT</name>
                            <description>Reception interrupt request of the MFS ch.4</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ069MON" -->
                <register>
                    <name>IRQ069MON</name>
                    <description>IRQ069 Batch Read Register</description>
                    <addressOffset>0x318</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSINT1" -->
                        <field>
                            <name>MFSINT1</name>
                            <description>Status interrupt request of the MFS ch.4</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MFSINT0" -->
                        <field>
                            <name>MFSINT0</name>
                            <description>Transmission interrupt request of the MFS ch.4</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
