itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ070MON" -->
                <register>
                    <name>IRQ070MON</name>
                    <description>IRQ070 Batch Read Register</description>
                    <addressOffset>0x31C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ071MON" -->
                <register>
                    <name>IRQ071MON</name>
                    <description>IRQ071 Batch Read Register</description>
                    <addressOffset>0x320</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ072MON" -->
                <register>
                    <name>IRQ072MON</name>
                    <description>IRQ072 Batch Read Register</description>
                    <addressOffset>0x324</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSRINT" -->
                        <field>
                            <name>MFSRINT</name>
                            <description>Reception interrupt request of the MFS ch.6</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ073MON" -->
                <register>
                    <name>IRQ073MON</name>
                    <description>IRQ073 Batch Read Register</description>
                    <addressOffset>0x328</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MFSINT1" -->
                        <field>
                            <name>MFSINT1</name>
                            <description>Status interrupt request of the MFS ch.6</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MFSINT0" -->
                        <field>
                            <name>MFSINT0</name>
                            <description>Transmission interrupt request of the MFS ch.6</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ074MON" -->
                <register>
                    <name>IRQ074MON</name>
                    <description>IRQ074 Batch Read Register</description>
                    <addressOffset>0x32C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ075MON" -->
                <register>
                    <name>IRQ075MON</name>
                    <description>IRQ075 Batch Read Register</description>
                    <addressOffset>0x330</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ076MON" -->
                <register>
                    <name>IRQ076MON</name>
                    <description>IRQ076 Batch Read Register</description>
                    <addressOffset>0x334</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ADCINT4" -->
                        <field>
                            <name>ADCINT4</name>
                            <description>Range comparison result interrupt request of the A/D
                                converter unit 0</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ADCINT3" -->
                        <field>
                            <name>ADCINT3</name>
                            <description>Conversion result comparison interrupt request of the A/D
                                converter unit 0</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ADCINT2" -->
                        <field>
                            <name>ADCINT2</name>
                            <description>FIFO overrun interrupt request of the A/D converter unit 0</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ADCINT1" -->
                        <field>
                            <name>ADCINT1</name>
                            <description>Scan conversion interrupt request of the A/D converter unit
                                0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ADCINT0" -->
                        <field>
                            <name>ADCINT0</name>
                            <description>Priority conversion interrupt request of the A/D converter
                                unit 0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ077MON" -->
                <register>
                    <name>IRQ077MON</name>
                    <description>IRQ077 Batch Read Register</description>
                    <addressOffset>0x338</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ADCINT4" -->
                        <field>
                            <name>ADCINT4</name>
                            <description>Range comparison result interrupt request of the A/D
                                converter unit 1</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ADCINT3" -->
                        <field>
                            <name>ADCINT3</name>
                            <description>Conversion result comparison interrupt request of the A/D
                                converter unit 1</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ADCINT2" -->
                        <field>
                            <name>ADCINT2</name>
                            <description>FIFO overrun interrupt request of the A/D converter unit 1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ADCINT1" -->
                        <field>
                            <name>ADCINT1</name>
                            <description>Scan conversion interrupt request of the A/D converter unit
                                1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ADCINT0" -->
                        <field>
                            <name>ADCINT0</name>
                            <description>Priority conversion interrupt request of the A/D converter
                                unit 1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
