itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ078MON" -->
                <register>
                    <name>IRQ078MON</name>
                    <description>IRQ078 Batch Read Register</description>
                    <addressOffset>0x33C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "USB_DRQ_INT4" -->
                        <field>
                            <name>USB_DRQ_INT4</name>
                            <description>Endpoint 5 DRQ interrupt request of the USB ch.0</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "USB_DRQ_INT3" -->
                        <field>
                            <name>USB_DRQ_INT3</name>
                            <description>Endpoint 4 DRQ interrupt request of the USB ch.0</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "USB_DRQ_INT2" -->
                        <field>
                            <name>USB_DRQ_INT2</name>
                            <description>Endpoint 3 DRQ interrupt request of the USB ch.0</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "USB_DRQ_INT1" -->
                        <field>
                            <name>USB_DRQ_INT1</name>
                            <description>Endpoint 2 DRQ interrupt request of the USB ch.0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "USB_DRQ_INT0" -->
                        <field>
                            <name>USB_DRQ_INT0</name>
                            <description>Endpoint 1 DRQ interrupt request of the USB ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ079MON" -->
                <register>
                    <name>IRQ079MON</name>
                    <description>IRQ079 Batch Read Register</description>
                    <addressOffset>0x340</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "USB_INT5" -->
                        <field>
                            <name>USB_INT5</name>
                            <description>SOFIRQ/CMPIRQ interrupt request of the USB ch.0</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "USB_INT4" -->
                        <field>
                            <name>USB_INT4</name>
                            <description>DIRQ/URPIRQ/RWKIRQ/CNNIRQ interrupt request of the USB ch.0</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "USB_INT3" -->
                        <field>
                            <name>USB_INT3</name>
                            <description>SPK interrupt request of the USB ch.0</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "USB_INT2" -->
                        <field>
                            <name>USB_INT2</name>
                            <description>SUSP/SOF/BRST/CONF/WKUP interrupt request of the USB ch.0</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "USB_INT1" -->
                        <field>
                            <name>USB_INT1</name>
                            <description>Endpoint 0 DRQO interrupt request of the USB ch.0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "USB_INT0" -->
                        <field>
                            <name>USB_INT0</name>
                            <description>Endpoint 0 DRQI interrupt request of the USB ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ080MON" -->
                <register>
                    <name>IRQ080MON</name>
                    <description>IRQ080 Batch Read Register</description>
                    <addressOffset>0x344</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CANINT" -->
                        <field>
                            <name>CANINT</name>
                            <description>Interrupt request of the CAN ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ081MON" -->
                <register>
                    <name>IRQ081MON</name>
                    <description>IRQ081 Batch Read Register</description>
                    <addressOffset>0x348</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CANINT" -->
                        <field>
                            <name>CANINT</name>
                            <description>Interrupt request of the CAN ch.1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ082MON" -->
                <register>
                    <name>IRQ082MON</name>
                    <description>IRQ082 Batch Read Register</description>
                    <addressOffset>0x34C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MACLPI" -->
                        <field>
                            <name>MACLPI</name>
                            <description>LPI interrupt request of the Ethernet MAC</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MACPMT" -->
                        <field>
                            <name>MACPMT</name>
                            <description>PMT interrupt request of the Ethernet MAC</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MACSBD" -->
                        <field>
                            <name>MACSBD</name>
                            <description>SBD interrupt request of the Ethernet MAC</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
