itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ083MON" -->
                <register>
                    <name>IRQ083MON</name>
                    <description>IRQ083 Batch Read Register</description>
                    <addressOffset>0x350</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DMACINT" -->
                        <field>
                            <name>DMACINT</name>
                            <description>Interrupt request of the DMAC ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ084MON" -->
                <register>
                    <name>IRQ084MON</name>
                    <description>IRQ084 Batch Read Register</description>
                    <addressOffset>0x354</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DMACINT" -->
                        <field>
                            <name>DMACINT</name>
                            <description>Interrupt request of the DMAC ch.1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ085MON" -->
                <register>
                    <name>IRQ085MON</name>
                    <description>IRQ085 Batch Read Register</description>
                    <addressOffset>0x358</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DMACINT" -->
                        <field>
                            <name>DMACINT</name>
                            <description>Interrupt request of the DMAC ch.2</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ086MON" -->
                <register>
                    <name>IRQ086MON</name>
                    <description>IRQ086 Batch Read Register</description>
                    <addressOffset>0x35C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DMACINT" -->
                        <field>
                            <name>DMACINT</name>
                            <description>Interrupt request of the DMAC ch.3</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ087MON" -->
                <register>
                    <name>IRQ087MON</name>
                    <description>IRQ087 Batch Read Register</description>
                    <addressOffset>0x360</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DMACINT" -->
                        <field>
                            <name>DMACINT</name>
                            <description>Interrupt request of the DMAC ch.4</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ088MON" -->
                <register>
                    <name>IRQ088MON</name>
                    <description>IRQ088 Batch Read Register</description>
                    <addressOffset>0x364</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DMACINT" -->
                        <field>
                            <name>DMACINT</name>
                            <description>Interrupt request of the DMAC ch.5</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ089MON" -->
                <register>
                    <name>IRQ089MON</name>
                    <description>IRQ089 Batch Read Register</description>
                    <addressOffset>0x368</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DMACINT" -->
                        <field>
                            <name>DMACINT</name>
                            <description>Interrupt request of the DMAC ch.6</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ090MON" -->
                <register>
                    <name>IRQ090MON</name>
                    <description>IRQ090 Batch Read Register</description>
                    <addressOffset>0x36C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DMACINT" -->
                        <field>
                            <name>DMACINT</name>
                            <description>Interrupt request of the DMAC ch.7</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
