itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ091MON" -->
                <register>
                    <name>IRQ091MON</name>
                    <description>IRQ091 Batch Read Register</description>
                    <addressOffset>0x370</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DSTCINT1" -->
                        <field>
                            <name>DSTCINT1</name>
                            <description>DSTC ERINT interrupt request</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "DSTCINT0" -->
                        <field>
                            <name>DSTCINT0</name>
                            <description>DSTC SWINT interrupt request</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ092MON" -->
                <register>
                    <name>IRQ092MON</name>
                    <description>IRQ092 Batch Read Register</description>
                    <addressOffset>0x374</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EXTINT3" -->
                        <field>
                            <name>EXTINT3</name>
                            <description>Interrupt request of the external pin interrupt ch.19</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT2" -->
                        <field>
                            <name>EXTINT2</name>
                            <description>Interrupt request of the external pin interrupt ch.18</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT1" -->
                        <field>
                            <name>EXTINT1</name>
                            <description>Interrupt request of the external pin interrupt ch.17</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT0" -->
                        <field>
                            <name>EXTINT0</name>
                            <description>Interrupt request of the external pin interrupt ch.16</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ093MON" -->
                <register>
                    <name>IRQ093MON</name>
                    <description>IRQ093 Batch Read Register</description>
                    <addressOffset>0x378</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EXTINT3" -->
                        <field>
                            <name>EXTINT3</name>
                            <description>Interrupt request of the external pin interrupt ch.23</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT2" -->
                        <field>
                            <name>EXTINT2</name>
                            <description>Interrupt request of the external pin interrupt ch.22</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT1" -->
                        <field>
                            <name>EXTINT1</name>
                            <description>Interrupt request of the external pin interrupt ch.21</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT0" -->
                        <field>
                            <name>EXTINT0</name>
                            <description>Interrupt request of the external pin interrupt ch.20</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ094MON" -->
                <register>
                    <name>IRQ094MON</name>
                    <description>IRQ094 Batch Read Register</description>
                    <addressOffset>0x37C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EXTINT3" -->
                        <field>
                            <name>EXTINT3</name>
                            <description>Interrupt request of the external pin interrupt ch.27</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT2" -->
                        <field>
                            <name>EXTINT2</name>
                            <description>Interrupt request of the external pin interrupt ch.26</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT1" -->
                        <field>
                            <name>EXTINT1</name>
                            <description>Interrupt request of the external pin interrupt ch.25</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT0" -->
                        <field>
                            <name>EXTINT0</name>
                            <description>Interrupt request of the external pin interrupt ch.24</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
