itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ095MON" -->
                <register>
                    <name>IRQ095MON</name>
                    <description>IRQ095 Batch Read Register</description>
                    <addressOffset>0x380</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EXTINT3" -->
                        <field>
                            <name>EXTINT3</name>
                            <description>Interrupt request of the external pin interrupt ch.31</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT2" -->
                        <field>
                            <name>EXTINT2</name>
                            <description>Interrupt request of the external pin interrupt ch.30</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT1" -->
                        <field>
                            <name>EXTINT1</name>
                            <description>Interrupt request of the external pin interrupt ch.29</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EXTINT0" -->
                        <field>
                            <name>EXTINT0</name>
                            <description>Interrupt request of the external pin interrupt ch.28</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ096MON" -->
                <register>
                    <name>IRQ096MON</name>
                    <description>IRQ096 Batch Read Register</description>
                    <addressOffset>0x384</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ097MON" -->
                <register>
                    <name>IRQ097MON</name>
                    <description>IRQ097 Batch Read Register</description>
                    <addressOffset>0x388</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ098MON" -->
                <register>
                    <name>IRQ098MON</name>
                    <description>IRQ098 Batch Read Register</description>
                    <addressOffset>0x38C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer ch.8</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer ch.8</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ099MON" -->
                <register>
                    <name>IRQ099MON</name>
                    <description>IRQ099 Batch Read Register</description>
                    <addressOffset>0x390</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer ch.9</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer ch.9</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ100MON" -->
                <register>
                    <name>IRQ100MON</name>
                    <description>IRQ100 Batch Read Register</description>
                    <addressOffset>0x394</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer
                                ch.10</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer
                                ch.10</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ101MON" -->
                <register>
                    <name>IRQ101MON</name>
                    <description>IRQ101 Batch Read Register</description>
                    <addressOffset>0x398</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer
                                ch.11</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer
                                ch.11</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ102MON" -->
                <register>
                    <name>IRQ102MON</name>
                    <description>IRQ102 Batch Read Register</description>
                    <addressOffset>0x39C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BTINT7" -->
                        <field>
                            <name>BTINT7</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer
                                ch.15</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT6" -->
                        <field>
                            <name>BTINT6</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer
                                ch.15</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT5" -->
                        <field>
                            <name>BTINT5</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer
                                ch.14</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT4" -->
                        <field>
                            <name>BTINT4</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer
                                ch.14</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT3" -->
                        <field>
                            <name>BTINT3</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer
                                ch.13</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT2" -->
                        <field>
                            <name>BTINT2</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer
                                ch.13</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT1" -->
                        <field>
                            <name>BTINT1</name>
                            <description>Interrupt request of source 1 (IRQ1) of the base timer
                                ch.12</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BTINT0" -->
                        <field>
                            <name>BTINT0</name>
                            <description>Interrupt request of source 0 (IRQ0) of the base timer
                                ch.12</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
