itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IRQ115MON" -->
                <register>
                    <name>IRQ115MON</name>
                    <description>IRQ115 Batch Read Register</description>
                    <addressOffset>0x3D0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ116MON" -->
                <register>
                    <name>IRQ116MON</name>
                    <description>IRQ116 Batch Read Register</description>
                    <addressOffset>0x3D4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ117MON" -->
                <register>
                    <name>IRQ117MON</name>
                    <description>IRQ117 Batch Read Register</description>
                    <addressOffset>0x3D8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ118MON" -->
                <register>
                    <name>IRQ118MON</name>
                    <description>IRQ118 Batch Read Register</description>
                    <addressOffset>0x3DC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ119MON" -->
                <register>
                    <name>IRQ119MON</name>
                    <description>IRQ119 Batch Read Register</description>
                    <addressOffset>0x3E0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FLINT" -->
                        <field>
                            <name>FLINT</name>
                            <description>Interrupt request of the Flash I/F</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IRQ120MON" -->
                <register>
                    <name>IRQ120MON</name>
                    <description>IRQ120 Batch Read Register</description>
                    <addressOffset>0x3E4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ121MON" -->
                <register>
                    <name>IRQ121MON</name>
                    <description>IRQ121 Batch Read Register</description>
                    <addressOffset>0x3E8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ122MON" -->
                <register>
                    <name>IRQ122MON</name>
                    <description>IRQ122 Batch Read Register</description>
                    <addressOffset>0x3EC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ123MON" -->
                <register>
                    <name>IRQ123MON</name>
                    <description>IRQ123 Batch Read Register</description>
                    <addressOffset>0x3F0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ124MON" -->
                <register>
                    <name>IRQ124MON</name>
                    <description>IRQ124 Batch Read Register</description>
                    <addressOffset>0x3F4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ125MON" -->
                <register>
                    <name>IRQ125MON</name>
                    <description>IRQ125 Batch Read Register</description>
                    <addressOffset>0x3F8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ126MON" -->
                <register>
                    <name>IRQ126MON</name>
                    <description>IRQ126 Batch Read Register</description>
                    <addressOffset>0x3FC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "IRQ127MON" -->
                <register>
                    <name>IRQ127MON</name>
                    <description>IRQ127 Batch Read Register</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
