itzandroidtab/klib-svd/mb9bf566k.svd
            </registers>
        </peripheral>
        <!-- PERIPHERAL "GPIO" -->
        <peripheral>
            <name>GPIO</name>
            <description>0</description>
            <groupName>GPIO</groupName>
            <baseAddress>0x4006F000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x740</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "PFR0" -->
                <register>
                    <name>PFR0</name>
                    <description>Port Function Setting Register 0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000001F</resetValue>
                    <resetMask>0x000001F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "P04" -->
                        <field>
                            <name>P04</name>
                            <description>Bit4 of PFR0</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P03" -->
                        <field>
                            <name>P03</name>
                            <description>Bit3 of PFR0</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P02" -->
                        <field>
                            <name>P02</name>
                            <description>Bit2 of PFR0</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P01" -->
                        <field>
                            <name>P01</name>
                            <description>Bit1 of PFR0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P00" -->
                        <field>
                            <name>P00</name>
                            <description>Bit0 of PFR0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PFR1" -->
                <register>
                    <name>PFR1</name>
                    <description>Port Function Setting Register 1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0000000F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "P13" -->
                        <field>
                            <name>P13</name>
                            <description>Bit3 of PFR1</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P12" -->
                        <field>
                            <name>P12</name>
                            <description>Bit2 of PFR1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P11" -->
                        <field>
                            <name>P11</name>
                            <description>Bit1 of PFR1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P10" -->
                        <field>
                            <name>P10</name>
                            <description>Bit0 of PFR1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PFR2" -->
                <register>
                    <name>PFR2</name>
                    <description>Port Function Setting Register 2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0000007F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "P26" -->
                        <field>
                            <name>P26</name>
                            <description>Bit6 of PFR2</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P25" -->
                        <field>
                            <name>P25</name>
                            <description>Bit5 of PFR2</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P24" -->
                        <field>
                            <name>P24</name>
                            <description>Bit4 of PFR2</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P23" -->
                        <field>
                            <name>P23</name>
                            <description>Bit3 of PFR2</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P22" -->
                        <field>
                            <name>P22</name>
                            <description>Bit2 of PFR2</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P21" -->
                        <field>
                            <name>P21</name>
                            <description>Bit1 of PFR2</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P20" -->
                        <field>
                            <name>P20</name>
                            <description>Bit0 of PFR2</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PFR3" -->
                <register>
                    <name>PFR3</name>
                    <description>Port Function Setting Register 3</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0000003F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "P35" -->
                        <field>
                            <name>P35</name>
                            <description>Bit5 of PFR3</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P34" -->
                        <field>
                            <name>P34</name>
                            <description>Bit4 of PFR3</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P33" -->
                        <field>
                            <name>P33</name>
                            <description>Bit3 of PFR3</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P32" -->
                        <field>
                            <name>P32</name>
                            <description>Bit2 of PFR3</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P31" -->
                        <field>
                            <name>P31</name>
                            <description>Bit1 of PFR3</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P30" -->
                        <field>
                            <name>P30</name>
                            <description>Bit0 of PFR3</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PFR4" -->
                <register>
                    <name>PFR4</name>
                    <description>Port Function Setting Register 4</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x000003C3</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "P49" -->
                        <field>
                            <name>P49</name>
                            <description>Bit9 of PFR4</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P48" -->
                        <field>
                            <name>P48</name>
                            <description>Bit8 of PFR4</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P47" -->
                        <field>
                            <name>P47</name>
                            <description>Bit7 of PFR4</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P46" -->
                        <field>
                            <name>P46</name>
                            <description>Bit6 of PFR4</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P41" -->
                        <field>
                            <name>P41</name>
                            <description>Bit1 of PFR4</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P40" -->
                        <field>
                            <name>P40</name>
                            <description>Bit0 of PFR4</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PFR5" -->
                <register>
                    <name>PFR5</name>
                    <description>Port Function Setting Register 5</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "P57" -->
                        <field>
                            <name>P57</name>
                            <description>Bit7 of PFR5</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P56" -->
                        <field>
                            <name>P56</name>
                            <description>Bit6 of PFR5</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P55" -->
                        <field>
                            <name>P55</name>
                            <description>Bit5 of PFR5</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P54" -->
                        <field>
                            <name>P54</name>
                            <description>Bit4 of PFR5</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P53" -->
                        <field>
                            <name>P53</name>
                            <description>Bit3 of PFR5</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P52" -->
                        <field>
                            <name>P52</name>
                            <description>Bit2 of PFR5</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P51" -->
                        <field>
                            <name>P51</name>
                            <description>Bit1 of PFR5</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P50" -->
                        <field>
                            <name>P50</name>
                            <description>Bit0 of PFR5</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PFR6" -->
                <register>
                    <name>PFR6</name>
                    <description>Port Function Setting Register 6</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0000007F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "P66" -->
                        <field>
                            <name>P66</name>
                            <description>Bit6 of PFR6</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P65" -->
                        <field>
                            <name>P65</name>
                            <description>Bit5 of PFR6</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P64" -->
                        <field>
                            <name>P64</name>
                            <description>Bit4 of PFR6</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P63" -->
                        <field>
                            <name>P63</name>
                            <description>Bit3 of PFR6</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P62" -->
                        <field>
                            <name>P62</name>
                            <description>Bit2 of PFR6</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P61" -->
                        <field>
                            <name>P61</name>
                            <description>Bit1 of PFR6</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P60" -->
                        <field>
                            <name>P60</name>
                            <description>Bit0 of PFR6</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PFR8" -->
                <register>
                    <name>PFR8</name>
                    <description>Port Function Setting Register 8</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "P81" -->
                        <field>
                            <name>P81</name>
                            <description>Bit1 of PFR8</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P80" -->
                        <field>
                            <name>P80</name>
                            <description>Bit0 of PFR8</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PFRE" -->
                <register>
                    <name>PFRE</name>
                    <description>Port Function Setting Register E</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0000000B</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "PE3" -->
                        <field>
                            <name>PE3</name>
                            <description>Bit3 of PFRE</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PE2" -->
                        <field>
                            <name>PE2</name>
                            <description>Bit2 of PFRE</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PE0" -->
                        <field>
                            <name>PE0</name>
                            <description>Bit0 of PFRE</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
