itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "PCR0" -->
                <register derivedFrom="PFR0">
                    <name>PCR0</name>
                    <description>Pull-up Setting Register 0</description>
                    <addressOffset>0x100</addressOffset>
                </register>
                <!-- REGISTER "PCR1" -->
                <register derivedFrom="PFR1">
                    <name>PCR1</name>
                    <description>Pull-up Setting Register 1</description>
                    <addressOffset>0x104</addressOffset>
                </register>
                <!-- REGISTER "PCR2" -->
                <register derivedFrom="PFR2">
                    <name>PCR2</name>
                    <description>Pull-up Setting Register 2</description>
                    <addressOffset>0x108</addressOffset>
                </register>
                <!-- REGISTER "PCR3" -->
                <register derivedFrom="PFR3">
                    <name>PCR3</name>
                    <description>Pull-up Setting Register 3</description>
                    <addressOffset>0x10C</addressOffset>
                </register>
                <!-- REGISTER "PCR4" -->
                <register derivedFrom="PFR4">
                    <name>PCR4</name>
                    <description>Pull-up Setting Register 4</description>
                    <addressOffset>0x110</addressOffset>
                </register>
                <!-- REGISTER "PCR5" -->
                <register derivedFrom="PFR5">
                    <name>PCR5</name>
                    <description>Pull-up Setting Register 5</description>
                    <addressOffset>0x114</addressOffset>
                </register>
                <!-- REGISTER "PCR6" -->
                <register derivedFrom="PFR6">
                    <name>PCR6</name>
                    <description>Pull-up Setting Register 6</description>
                    <addressOffset>0x118</addressOffset>
                </register>
                <!-- REGISTER "PCR8" -->
                <register derivedFrom="PFR8">
                    <name>PCR8</name>
                    <description>Pull-up Setting Register 8</description>
                    <addressOffset>0x120</addressOffset>
                </register>
                <!-- REGISTER "PCRE" -->
                <register derivedFrom="PFRE">
                    <name>PCRE</name>
                    <description>Pull-up Setting Register E</description>
                    <addressOffset>0x138</addressOffset>
                </register>
                <!-- REGISTER "DDR0" -->
                <register>
                    <name>DDR0</name>
                    <description>Port input/output Direction Setting Register 0</description>
                    <addressOffset>0x200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0000001F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "P04" -->
                        <field>
                            <name>P04</name>
                            <description>Bit4 of DDR0</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P03" -->
                        <field>
                            <name>P03</name>
                            <description>Bit3 of DDR0</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P02" -->
                        <field>
                            <name>P02</name>
                            <description>Bit2 of DDR0</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P01" -->
                        <field>
                            <name>P01</name>
                            <description>Bit1 of DDR0</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P00" -->
                        <field>
                            <name>P00</name>
                            <description>Bit0 of DDR0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "DDR1" -->
                <register derivedFrom="PFR1">
                    <name>DDR1</name>
                    <description>Port input/output Direction Setting Register 1</description>
                    <addressOffset>0x204</addressOffset>
                </register>
                <!-- REGISTER "DDR2" -->
                <register derivedFrom="PFR2">
                    <name>DDR2</name>
                    <description>Port input/output Direction Setting Register 2</description>
                    <addressOffset>0x208</addressOffset>
                </register>
                <!-- REGISTER "DDR3" -->
                <register derivedFrom="PFR3">
                    <name>DDR3</name>
                    <description>Port input/output Direction Setting Register 3</description>
                    <addressOffset>0x20C</addressOffset>
                </register>
                <!-- REGISTER "DDR4" -->
                <register derivedFrom="PFR4">
                    <name>DDR4</name>
                    <description>Port input/output Direction Setting Register 4</description>
                    <addressOffset>0x210</addressOffset>
                </register>
                <!-- REGISTER "DDR5" -->
                <register derivedFrom="PFR5">
                    <name>DDR5</name>
                    <description>Port input/output Direction Setting Register 5</description>
                    <addressOffset>0x214</addressOffset>
                </register>
                <!-- REGISTER "DDR6" -->
                <register derivedFrom="PFR6">
                    <name>DDR6</name>
                    <description>Port input/output Direction Setting Register 6</description>
                    <addressOffset>0x218</addressOffset>
                </register>
                <!-- REGISTER "DDR8" -->
                <register derivedFrom="PFR8">
                    <name>DDR8</name>
                    <description>Port input/output Direction Setting Register 8</description>
                    <addressOffset>0x220</addressOffset>
                </register>
                <!-- REGISTER "DDRE" -->
                <register derivedFrom="PFRE">
                    <name>DDRE</name>
                    <description>Port input/output Direction Setting Register E</description>
                    <addressOffset>0x238</addressOffset>
                </register>
                <!-- REGISTER "PDIR0" -->
                <register derivedFrom="DDR0">
                    <name>PDIR0</name>
                    <description>Port Input Data Register 0</description>
                    <addressOffset>0x300</addressOffset>
                </register>
                <!-- REGISTER "PDIR1" -->
                <register derivedFrom="DDR1">
                    <name>PDIR1</name>
                    <description>Port Input Data Register 1</description>
                    <addressOffset>0x304</addressOffset>
                </register>
                <!-- REGISTER "PDIR2" -->
                <register derivedFrom="DDR2">
                    <name>PDIR2</name>
                    <description>Port Input Data Register 2</description>
                    <addressOffset>0x308</addressOffset>
                </register>
