itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "PDIR3" -->
                <register derivedFrom="DDR3">
                    <name>PDIR3</name>
                    <description>Port Input Data Register 3</description>
                    <addressOffset>0x30C</addressOffset>
                </register>
                <!-- REGISTER "PDIR4" -->
                <register derivedFrom="DDR4">
                    <name>PDIR4</name>
                    <description>Port Input Data Register 4</description>
                    <addressOffset>0x310</addressOffset>
                </register>
                <!-- REGISTER "PDIR5" -->
                <register derivedFrom="DDR5">
                    <name>PDIR5</name>
                    <description>Port Input Data Register 5</description>
                    <addressOffset>0x314</addressOffset>
                </register>
                <!-- REGISTER "PDIR6" -->
                <register derivedFrom="DDR6">
                    <name>PDIR6</name>
                    <description>Port Input Data Register 6</description>
                    <addressOffset>0x318</addressOffset>
                </register>
                <!-- REGISTER "PDIR8" -->
                <register derivedFrom="DDR8">
                    <name>PDIR8</name>
                    <description>Port Input Data Register 8</description>
                    <addressOffset>0x320</addressOffset>
                </register>
                <!-- REGISTER "PDIRE" -->
                <register derivedFrom="DDRE">
                    <name>PDIRE</name>
                    <description>Port Input Data Register E</description>
                    <addressOffset>0x338</addressOffset>
                </register>
                <!-- REGISTER "PDOR0" -->
                <register derivedFrom="DDR0">
                    <name>PDOR0</name>
                    <description>Port Output Data Register 0</description>
                    <addressOffset>0x400</addressOffset>
                </register>
                <!-- REGISTER "PDOR1" -->
                <register derivedFrom="DDR1">
                    <name>PDOR1</name>
                    <description>Port Output Data Register 1</description>
                    <addressOffset>0x404</addressOffset>
                </register>
                <!-- REGISTER "PDOR2" -->
                <register derivedFrom="DDR2">
                    <name>PDOR2</name>
                    <description>Port Output Data Register 2</description>
                    <addressOffset>0x408</addressOffset>
                </register>
                <!-- REGISTER "PDOR3" -->
                <register derivedFrom="DDR3">
                    <name>PDOR3</name>
                    <description>Port Output Data Register 3</description>
                    <addressOffset>0x40C</addressOffset>
                </register>
                <!-- REGISTER "PDOR4" -->
                <register derivedFrom="DDR4">
                    <name>PDOR4</name>
                    <description>Port Output Data Register 4</description>
                    <addressOffset>0x410</addressOffset>
                </register>
                <!-- REGISTER "PDOR5" -->
                <register derivedFrom="DDR5">
                    <name>PDOR5</name>
                    <description>Port Output Data Register 5</description>
                    <addressOffset>0x414</addressOffset>
                </register>
                <!-- REGISTER "PDOR6" -->
                <register derivedFrom="DDR6">
                    <name>PDOR6</name>
                    <description>Port Output Data Register 6</description>
                    <addressOffset>0x418</addressOffset>
                </register>
                <!-- REGISTER "PDOR8" -->
                <register derivedFrom="DDR8">
                    <name>PDOR8</name>
                    <description>Port Output Data Register 8</description>
                    <addressOffset>0x420</addressOffset>
                </register>
                <!-- REGISTER "PDORE" -->
                <register derivedFrom="DDRE">
                    <name>PDORE</name>
                    <description>Port Output Data Register E</description>
                    <addressOffset>0x438</addressOffset>
                </register>
                <!-- REGISTER "ADE" -->
                <register>
                    <name>ADE</name>
                    <description>Analog Input Setting Register</description>
                    <addressOffset>0x500</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "AN31" -->
                        <field>
                            <name>AN31</name>
                            <description>Bit31 of ADE</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN30" -->
                        <field>
                            <name>AN30</name>
                            <description>Bit30 of ADE</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN29" -->
                        <field>
                            <name>AN29</name>
                            <description>Bit29 of ADE</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN28" -->
                        <field>
                            <name>AN28</name>
                            <description>Bit28 of ADE</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN27" -->
                        <field>
                            <name>AN27</name>
                            <description>Bit27 of ADE</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN26" -->
                        <field>
                            <name>AN26</name>
                            <description>Bit26 of ADE</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN25" -->
                        <field>
                            <name>AN25</name>
                            <description>Bit25 of ADE</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN24" -->
                        <field>
                            <name>AN24</name>
                            <description>Bit24 of ADE</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN23" -->
                        <field>
                            <name>AN23</name>
                            <description>Bit23 of ADE</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN22" -->
                        <field>
                            <name>AN22</name>
                            <description>Bit22 of ADE</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN21" -->
                        <field>
                            <name>AN21</name>
                            <description>Bit21 of ADE</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN20" -->
                        <field>
                            <name>AN20</name>
                            <description>Bit20 of ADE</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN19" -->
                        <field>
                            <name>AN19</name>
                            <description>Bit19 of ADE</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN18" -->
                        <field>
                            <name>AN18</name>
                            <description>Bit18 of ADE</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN17" -->
                        <field>
                            <name>AN17</name>
                            <description>Bit17 of ADE</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN16" -->
                        <field>
                            <name>AN16</name>
                            <description>Bit16 of ADE</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN15" -->
                        <field>
                            <name>AN15</name>
                            <description>Bit15 of ADE</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN14" -->
                        <field>
                            <name>AN14</name>
                            <description>Bit14 of ADE</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN13" -->
                        <field>
                            <name>AN13</name>
                            <description>Bit13 of ADE</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN12" -->
                        <field>
                            <name>AN12</name>
                            <description>Bit12 of ADE</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN11" -->
                        <field>
                            <name>AN11</name>
                            <description>Bit11 of ADE</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN10" -->
                        <field>
                            <name>AN10</name>
                            <description>Bit10 of ADE</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN09" -->
                        <field>
                            <name>AN09</name>
                            <description>Bit9 of ADE</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN08" -->
                        <field>
                            <name>AN08</name>
                            <description>Bit8 of ADE</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN07" -->
                        <field>
                            <name>AN07</name>
                            <description>Bit7 of ADE</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN06" -->
                        <field>
                            <name>AN06</name>
                            <description>Bit6 of ADE</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN05" -->
                        <field>
                            <name>AN05</name>
                            <description>Bit5 of ADE</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN04" -->
                        <field>
                            <name>AN04</name>
                            <description>Bit4 of ADE</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN03" -->
                        <field>
                            <name>AN03</name>
                            <description>Bit3 of ADE</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN02" -->
                        <field>
                            <name>AN02</name>
                            <description>Bit2 of ADE</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN01" -->
                        <field>
                            <name>AN01</name>
                            <description>Bit1 of ADE</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AN00" -->
                        <field>
                            <name>AN00</name>
                            <description>Bit0 of ADE</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
