itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "SPSR" -->
                <register>
                    <name>SPSR</name>
                    <description>Special Port Setting Register</description>
                    <addressOffset>0x580</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x04</resetValue>
                    <resetMask>0x3C</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "USB1C" -->
                        <field>
                            <name>USB1C</name>
                            <description>USB (ch.1) Pin Setting bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "USB0C" -->
                        <field>
                            <name>USB0C</name>
                            <description>USB (ch.0) Pin Setting bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MAINXC" -->
                        <field>
                            <name>MAINXC</name>
                            <description>Main Clock (Oscillation) Pin Setting bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR00" -->
                <register>
                    <name>EPFR00</name>
                    <description>Extended Pin Function Setting Register 00</description>
                    <addressOffset>0x600</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00030000</resetValue>
                    <resetMask>0x030322F7</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TRC1E" -->
                        <field>
                            <name>TRC1E</name>
                            <description>TRACED Function Select bit 1</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TRC0E" -->
                        <field>
                            <name>TRC0E</name>
                            <description>TRACED Function Select bit 0</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "JTAGEN1S" -->
                        <field>
                            <name>JTAGEN1S</name>
                            <description>JTAG Function Select bit 1</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "JTAGEN0B" -->
                        <field>
                            <name>JTAGEN0B</name>
                            <description>JTAG Function Select bit 0</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "USBP1E" -->
                        <field>
                            <name>USBP1E</name>
                            <description>USB ch.1 Function Select bit 1</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "USBP0E" -->
                        <field>
                            <name>USBP0E</name>
                            <description>USB ch.0 Function Select bit 1</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SUBOUTE" -->
                        <field>
                            <name>SUBOUTE</name>
                            <description>Sub clock divide output function select bit</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTCCOE" -->
                        <field>
                            <name>RTCCOE</name>
                            <description>RTC clock output select bit</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CROUTE" -->
                        <field>
                            <name>CROUTE</name>
                            <description>Internal high-speed CR Oscillation Output Function Select
                                bit</description>
                            <lsb>1</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "NMIS" -->
                        <field>
                            <name>NMIS</name>
                            <description>NMIX Function Select bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
