itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "EPFR01" -->
                <register>
                    <name>EPFR01</name>
                    <description>Extended Pin Function Setting Register 01</description>
                    <addressOffset>0x604</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF1FFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IC03S" -->
                        <field>
                            <name>IC03S</name>
                            <description>IC03 Input Select bits</description>
                            <lsb>29</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IC02S" -->
                        <field>
                            <name>IC02S</name>
                            <description>IC02 Input Select bits</description>
                            <lsb>26</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IC01S" -->
                        <field>
                            <name>IC01S</name>
                            <description>IC01 Input Select bits</description>
                            <lsb>23</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IC00S" -->
                        <field>
                            <name>IC00S</name>
                            <description>IC00 Input Select bits</description>
                            <lsb>20</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FRCK0S" -->
                        <field>
                            <name>FRCK0S</name>
                            <description>FRCK0 Input Select bits</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DTTI0S" -->
                        <field>
                            <name>DTTI0S</name>
                            <description>DTTIX0 Input Select bits</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DTTI0C" -->
                        <field>
                            <name>DTTI0C</name>
                            <description>DTTIX0 Function Select bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO05E" -->
                        <field>
                            <name>RTO05E</name>
                            <description>RTO05 Output Select bits</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO04E" -->
                        <field>
                            <name>RTO04E</name>
                            <description>RTO04 Output Select bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO03E" -->
                        <field>
                            <name>RTO03E</name>
                            <description>RTO03 Output Select bits</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO02E" -->
                        <field>
                            <name>RTO02E</name>
                            <description>RTO02 Output Select bits</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO01E" -->
                        <field>
                            <name>RTO01E</name>
                            <description>RTO01 Output Select bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO00E" -->
                        <field>
                            <name>RTO00E</name>
                            <description>RTO00 Output Select bits</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR02" -->
                <register>
                    <name>EPFR02</name>
                    <description>Extended Pin Function Setting Register 02</description>
                    <addressOffset>0x608</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF1FFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IC13S" -->
                        <field>
                            <name>IC13S</name>
                            <description>IC13 Input Select bits</description>
                            <lsb>29</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IC12S" -->
                        <field>
                            <name>IC12S</name>
                            <description>IC13 Input Select bits</description>
                            <lsb>26</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IC11S" -->
                        <field>
                            <name>IC11S</name>
                            <description>IC13 Input Select bits</description>
                            <lsb>23</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IC10S" -->
                        <field>
                            <name>IC10S</name>
                            <description>IC13 Input Select bits</description>
                            <lsb>20</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FRCK1S" -->
                        <field>
                            <name>FRCK1S</name>
                            <description>FRCK1 Input Select bits</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DTTI1S" -->
                        <field>
                            <name>DTTI1S</name>
                            <description>DTTIX1 Input Select bits</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DTTI1C" -->
                        <field>
                            <name>DTTI1C</name>
                            <description>DTTIX1 Function Select bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO15E" -->
                        <field>
                            <name>RTO15E</name>
                            <description>RTO15 Output Select bits</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO14E" -->
                        <field>
                            <name>RTO14E</name>
                            <description>RTO14 Output Select bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO13E" -->
                        <field>
                            <name>RTO13E</name>
                            <description>RTO13 Output Select bits</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO12E" -->
                        <field>
                            <name>RTO12E</name>
                            <description>RTO12 Output Select bits</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO11E" -->
                        <field>
                            <name>RTO11E</name>
                            <description>RTO11 Output Select bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO10E" -->
                        <field>
                            <name>RTO10E</name>
                            <description>RTO10 Output Select bits</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR03" -->
                <register>
                    <name>EPFR03</name>
                    <description>Extended Pin Function Setting Register 03</description>
                    <addressOffset>0x60C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF1FFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "IC23S" -->
                        <field>
                            <name>IC23S</name>
                            <description>IC23 Input Select bits</description>
                            <lsb>29</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IC22S" -->
                        <field>
                            <name>IC22S</name>
                            <description>IC23 Input Select bits</description>
                            <lsb>26</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IC21S" -->
                        <field>
                            <name>IC21S</name>
                            <description>IC23 Input Select bits</description>
                            <lsb>23</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IC20S" -->
                        <field>
                            <name>IC20S</name>
                            <description>IC23 Input Select bits</description>
                            <lsb>20</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FRCK2S" -->
                        <field>
                            <name>FRCK2S</name>
                            <description>FRCK2 Input Select bits</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DTTI2S" -->
                        <field>
                            <name>DTTI2S</name>
                            <description>DTTIX2 Input Select bits</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DTTI2C" -->
                        <field>
                            <name>DTTI2C</name>
                            <description>DTTIX2 Function Select bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO25E" -->
                        <field>
                            <name>RTO25E</name>
                            <description>RTO25 Output Select bits</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO24E" -->
                        <field>
                            <name>RTO24E</name>
                            <description>RTO24 Output Select bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO23E" -->
                        <field>
                            <name>RTO23E</name>
                            <description>RTO23 Output Select bits</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO22E" -->
                        <field>
                            <name>RTO22E</name>
                            <description>RTO22 Output Select bits</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO21E" -->
                        <field>
                            <name>RTO21E</name>
                            <description>RTO21 Output Select bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTO20E" -->
                        <field>
                            <name>RTO20E</name>
                            <description>RTO20 Output Select bits</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR04" -->
                <register>
                    <name>EPFR04</name>
                    <description>Extended Pin Function Setting Register 04</description>
                    <addressOffset>0x610</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F3C3F7C</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TIOB3S" -->
                        <field>
                            <name>TIOB3S</name>
                            <description>TIOB3 Input Select bits</description>
                            <lsb>28</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA3E" -->
                        <field>
                            <name>TIOA3E</name>
                            <description>TIOA3 Output Select bits</description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA3S" -->
                        <field>
                            <name>TIOA3S</name>
                            <description>TIOA3 Input Select bits</description>
                            <lsb>24</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB2S" -->
                        <field>
                            <name>TIOB2S</name>
                            <description>TIOB2 Input Select bits</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA2E" -->
                        <field>
                            <name>TIOA2E</name>
                            <description>TIOA2 Output Select bits</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB1S" -->
                        <field>
                            <name>TIOB1S</name>
                            <description>TIOB1 Input Select bits</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA1E" -->
                        <field>
                            <name>TIOA1E</name>
                            <description>TIOA1 Output Select bits</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA1S" -->
                        <field>
                            <name>TIOA1S</name>
                            <description>TIOA1 Input Select bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB0S" -->
                        <field>
                            <name>TIOB0S</name>
                            <description>TIOB0 Input Select bits</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA0E" -->
                        <field>
                            <name>TIOA0E</name>
                            <description>TIOA0 Output Select bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
