itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "EPFR05" -->
                <register>
                    <name>EPFR05</name>
                    <description>Extended Pin Function Setting Register 05</description>
                    <addressOffset>0x614</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F3C3F3C</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TIOB7S" -->
                        <field>
                            <name>TIOB7S</name>
                            <description>TIOB7 Input Select bits</description>
                            <lsb>28</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA7E" -->
                        <field>
                            <name>TIOA7E</name>
                            <description>TIOA7 Output Select bits</description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA7S" -->
                        <field>
                            <name>TIOA7S</name>
                            <description>TIOA7 Input Select bits</description>
                            <lsb>24</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB6S" -->
                        <field>
                            <name>TIOB6S</name>
                            <description>TIOB6 Input Select bits</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA6E" -->
                        <field>
                            <name>TIOA6E</name>
                            <description>TIOA6 Output Select bits</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB5S" -->
                        <field>
                            <name>TIOB5S</name>
                            <description>TIOB5 Input Select bits</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA5E" -->
                        <field>
                            <name>TIOA5E</name>
                            <description>TIOA5 Output Select bits</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA5S" -->
                        <field>
                            <name>TIOA5S</name>
                            <description>TIOA5 Input Select bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB4S" -->
                        <field>
                            <name>TIOB4S</name>
                            <description>TIOB4 Input Select bits</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA4E" -->
                        <field>
                            <name>TIOA4E</name>
                            <description>TIOA4 Output Select bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR06" -->
                <register>
                    <name>EPFR06</name>
                    <description>Extended Pin Function Setting Register 06</description>
                    <addressOffset>0x618</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EINT15S" -->
                        <field>
                            <name>EINT15S</name>
                            <description>External Interrupt 15 Input Select bits</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT14S" -->
                        <field>
                            <name>EINT14S</name>
                            <description>External Interrupt 14 Input Select bits</description>
                            <lsb>28</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT13S" -->
                        <field>
                            <name>EINT13S</name>
                            <description>External Interrupt 13 Input Select bits</description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT12S" -->
                        <field>
                            <name>EINT12S</name>
                            <description>External Interrupt 12 Input Select bits</description>
                            <lsb>24</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT11S" -->
                        <field>
                            <name>EINT11S</name>
                            <description>External Interrupt 11 Input Select bits</description>
                            <lsb>22</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT10S" -->
                        <field>
                            <name>EINT10S</name>
                            <description>External Interrupt 10 Input Select bits</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT09S" -->
                        <field>
                            <name>EINT09S</name>
                            <description>External Interrupt 09 Input Select bits</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT08S" -->
                        <field>
                            <name>EINT08S</name>
                            <description>External Interrupt 08 Input Select bits</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT07S" -->
                        <field>
                            <name>EINT07S</name>
                            <description>External Interrupt 07 Input Select bits</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT06S" -->
                        <field>
                            <name>EINT06S</name>
                            <description>External Interrupt 06 Input Select bits</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT05S" -->
                        <field>
                            <name>EINT05S</name>
                            <description>External Interrupt 05 Input Select bits</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT04S" -->
                        <field>
                            <name>EINT04S</name>
                            <description>External Interrupt 04 Input Select bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT03S" -->
                        <field>
                            <name>EINT03S</name>
                            <description>External Interrupt 03 Input Select bits</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT02S" -->
                        <field>
                            <name>EINT02S</name>
                            <description>External Interrupt 02 Input Select bits</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT01S" -->
                        <field>
                            <name>EINT01S</name>
                            <description>External Interrupt 01 Input Select bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT00S" -->
                        <field>
                            <name>EINT00S</name>
                            <description>External Interrupt 00 Input Select bits</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR07" -->
                <register>
                    <name>EPFR07</name>
                    <description>Extended Pin Function Setting Register 07</description>
                    <addressOffset>0x61C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0FFFFFF0</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SCK3B" -->
                        <field>
                            <name>SCK3B</name>
                            <description>SCK3 Input/Output Select bits</description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOT3B" -->
                        <field>
                            <name>SOT3B</name>
                            <description>SOT3 Input/Output Select bits</description>
                            <lsb>24</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SIN3S" -->
                        <field>
                            <name>SIN3S</name>
                            <description>SIN3 Input Select bits</description>
                            <lsb>22</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SCK2B" -->
                        <field>
                            <name>SCK2B</name>
                            <description>SCK2 Input/Output Select bits</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOT2B" -->
                        <field>
                            <name>SOT2B</name>
                            <description>SOT2 Input/Output Select bits</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SIN2S" -->
                        <field>
                            <name>SIN2S</name>
                            <description>SIN2 Input Select bits</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SCK1B" -->
                        <field>
                            <name>SCK1B</name>
                            <description>SCK1 Input/Output Select bits</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOT1B" -->
                        <field>
                            <name>SOT1B</name>
                            <description>SOT1 Input/Output Select bits</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SIN1S" -->
                        <field>
                            <name>SIN1S</name>
                            <description>SIN1 Input Select bits</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SCK0B" -->
                        <field>
                            <name>SCK0B</name>
                            <description>SCK0 Input/Output Select bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOT0B" -->
                        <field>
                            <name>SOT0B</name>
                            <description>SOT0 Input/Output Select bits</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SIN0S" -->
                        <field>
                            <name>SIN0S</name>
                            <description>SIN0 Input Select bits</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
