itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "EPFR08" -->
                <register>
                    <name>EPFR08</name>
                    <description>Extended Pin Function Setting Register 08</description>
                    <addressOffset>0x620</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x003F03FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SCK6B" -->
                        <field>
                            <name>SCK6B</name>
                            <description>SCK6 Input/Output Select bits</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOT6B" -->
                        <field>
                            <name>SOT6B</name>
                            <description>SOT6 Input/Output Select bits</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SIN6S" -->
                        <field>
                            <name>SIN6S</name>
                            <description>SIN6 Input Select bits</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SCK4B" -->
                        <field>
                            <name>SCK4B</name>
                            <description>SCK4 Input/Output Select bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOT4B" -->
                        <field>
                            <name>SOT4B</name>
                            <description>SOT4 Input/Output Select bits</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SIN4S" -->
                        <field>
                            <name>SIN4S</name>
                            <description>SIN4 Input Select bits</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CTS4S" -->
                        <field>
                            <name>CTS4S</name>
                            <description>CTS4 Input/Output Select bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTS4E" -->
                        <field>
                            <name>RTS4E</name>
                            <description>RTS4 Input/Output Select bits</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR09" -->
                <register>
                    <name>EPFR09</name>
                    <description>Extended Pin Function Setting Register 09</description>
                    <addressOffset>0x624</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0F0FF03F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CTX0E" -->
                        <field>
                            <name>CTX0E</name>
                            <description>CTX0E Output Select bits</description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CRX0S" -->
                        <field>
                            <name>CRX0S</name>
                            <description>CRX0S Input Select bits</description>
                            <lsb>24</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ADTRG1S" -->
                        <field>
                            <name>ADTRG1S</name>
                            <description>ADTRG1 Input Select bits</description>
                            <lsb>16</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ADTRG0S" -->
                        <field>
                            <name>ADTRG0S</name>
                            <description>ADTRG0 Input Select bits</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QZIN0S" -->
                        <field>
                            <name>QZIN0S</name>
                            <description>QZIN0S Input Select bits</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QBIN0S" -->
                        <field>
                            <name>QBIN0S</name>
                            <description>QBIN0S Input Select bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QAIN0S" -->
                        <field>
                            <name>QAIN0S</name>
                            <description>QAIN0S Input Select bits$</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR10" -->
                <register>
                    <name>EPFR10</name>
                    <description>Extended Pin Function Setting Register 10</description>
                    <addressOffset>0x628</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
