itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "EPFR11" -->
                <register>
                    <name>EPFR11</name>
                    <description>Extended Pin Function Setting Register 11</description>
                    <addressOffset>0x62C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x03FFFFFF</resetMask>
                </register>
                <!-- REGISTER "EPFR12" -->
                <register>
                    <name>EPFR12</name>
                    <description>Extended Pin Function Setting Register 12</description>
                    <addressOffset>0x630</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F3C3F3C</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TIOB11S" -->
                        <field>
                            <name>TIOB11S</name>
                            <description>TIOB11 Input Select bits</description>
                            <lsb>28</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA11E" -->
                        <field>
                            <name>TIOA11E</name>
                            <description>TIOA11 Output Select bits</description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA11S" -->
                        <field>
                            <name>TIOA11S</name>
                            <description>TIOA11 Input Select bits</description>
                            <lsb>24</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB10S" -->
                        <field>
                            <name>TIOB10S</name>
                            <description>TIOB10 Input Select bits</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA10E" -->
                        <field>
                            <name>TIOA10E</name>
                            <description>TIOA10 Output Select bits</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB9S" -->
                        <field>
                            <name>TIOB9S</name>
                            <description>TIOB9 Input Select bits</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA9E" -->
                        <field>
                            <name>TIOA9E</name>
                            <description>TIOA9 Output Select bits</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA9S" -->
                        <field>
                            <name>TIOA9S</name>
                            <description>TIOA9 Input Select bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB8S" -->
                        <field>
                            <name>TIOB8S</name>
                            <description>TIOB8 Input Select bits</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA8E" -->
                        <field>
                            <name>TIOA8E</name>
                            <description>TIOA8 Output Select bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR13" -->
                <register>
                    <name>EPFR13</name>
                    <description>Extended Pin Function Setting Register 13</description>
                    <addressOffset>0x634</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F3C3F3C</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TIOB15S" -->
                        <field>
                            <name>TIOB15S</name>
                            <description>TIOB15 Input Select bits</description>
                            <lsb>28</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA15E" -->
                        <field>
                            <name>TIOA15E</name>
                            <description>TIOA15 Output Select bits</description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA15S" -->
                        <field>
                            <name>TIOA15S</name>
                            <description>TIOA15 Input Select bits</description>
                            <lsb>24</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB14S" -->
                        <field>
                            <name>TIOB14S</name>
                            <description>TIOB14 Input Select bits</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA14E" -->
                        <field>
                            <name>TIOA14E</name>
                            <description>TIOA14 Output Select bits</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB13S" -->
                        <field>
                            <name>TIOB13S</name>
                            <description>TIOB13 Input Select bits</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA13E" -->
                        <field>
                            <name>TIOA13E</name>
                            <description>TIOA13 Output Select bits</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA13S" -->
                        <field>
                            <name>TIOA13S</name>
                            <description>TIOA13 Input Select bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOB12S" -->
                        <field>
                            <name>TIOB12S</name>
                            <description>TIOB12 Input Select bits</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIOA12E" -->
                        <field>
                            <name>TIOA12E</name>
                            <description>TIOA12 Output Select bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR14" -->
                <register>
                    <name>EPFR14</name>
                    <description>Extended Pin Function Setting Register 14</description>
                    <addressOffset>0x638</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFC0000</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "E_SPLC" -->
                        <field>
                            <name>E_SPLC</name>
                            <description>Input cutoff Select bit in Standby of input Pin for
                                Ethernet-MAC</description>
                            <lsb>28</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "E_PSE" -->
                        <field>
                            <name>E_PSE</name>
                            <description>PPS0_PPS1 Output Select bit for Ethernet-MAC</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "E_CKE" -->
                        <field>
                            <name>E_CKE</name>
                            <description>E_COUT Output Select bit</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "E_MD1B" -->
                        <field>
                            <name>E_MD1B</name>
                            <description>E_MDO1 I/O Select bit</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "E_MD0B" -->
                        <field>
                            <name>E_MD0B</name>
                            <description>E_MDO0 I/O Select bit</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "E_MC1B" -->
                        <field>
                            <name>E_MC1B</name>
                            <description>E_MDC1 I/O Select bit</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "E_MC0E" -->
                        <field>
                            <name>E_MC0E</name>
                            <description>E_MDC0 Output Select bit</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "E_TE1E" -->
                        <field>
                            <name>E_TE1E</name>
                            <description>E_TXER0_TXEN1 Output Select bit</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "E_TE0E" -->
                        <field>
                            <name>E_TE0E</name>
                            <description>E_TXEN0 Output Select bit</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "E_TD1E" -->
                        <field>
                            <name>E_TD1E</name>
                            <description>E_TX02_TX10, E_TX03_TX11 Output Select bit</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "E_TD0E" -->
                        <field>
                            <name>E_TD0E</name>
                            <description>E_TX00, E_TX01 Output Select bit</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR15" -->
                <register>
                    <name>EPFR15</name>
                    <description>Extended Pin Function Setting Register 15</description>
                    <addressOffset>0x63C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EINT31S" -->
                        <field>
                            <name>EINT31S</name>
                            <description>External Interrupt 31 Input Select bits</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT30S" -->
                        <field>
                            <name>EINT30S</name>
                            <description>External Interrupt 30 Input Select bits</description>
                            <lsb>28</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT29S" -->
                        <field>
                            <name>EINT29S</name>
                            <description>External Interrupt 29 Input Select bits</description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT28S" -->
                        <field>
                            <name>EINT28S</name>
                            <description>External Interrupt 28 Input Select bits</description>
                            <lsb>24</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT27S" -->
                        <field>
                            <name>EINT27S</name>
                            <description>External Interrupt 27 Input Select bits</description>
                            <lsb>22</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT26S" -->
                        <field>
                            <name>EINT26S</name>
                            <description>External Interrupt 26 Input Select bits</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT25S" -->
                        <field>
                            <name>EINT25S</name>
                            <description>External Interrupt 25 Input Select bits</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT24S" -->
                        <field>
                            <name>EINT24S</name>
                            <description>External Interrupt 24 Input Select bits</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT23S" -->
                        <field>
                            <name>EINT23S</name>
                            <description>External Interrupt 23 Input Select bits</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT22S" -->
                        <field>
                            <name>EINT22S</name>
                            <description>External Interrupt 22 Input Select bits</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT21S" -->
                        <field>
                            <name>EINT21S</name>
                            <description>External Interrupt 21 Input Select bits</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT20S" -->
                        <field>
                            <name>EINT20S</name>
                            <description>External Interrupt 20 Input Select bits</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT19S" -->
                        <field>
                            <name>EINT19S</name>
                            <description>External Interrupt 19 Input Select bits</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT18S" -->
                        <field>
                            <name>EINT18S</name>
                            <description>External Interrupt 18 Input Select bits</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT17S" -->
                        <field>
                            <name>EINT17S</name>
                            <description>External Interrupt 17 Input Select bits</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EINT16S" -->
                        <field>
                            <name>EINT16S</name>
                            <description>External Interrupt 16 Input Select bits</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
