itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "EPFR16" -->
                <register>
                    <name>EPFR16</name>
                    <description>Extended Pin Function Setting Register 16</description>
                    <addressOffset>0x640</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x30000000</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SFMPBC" -->
                        <field>
                            <name>SFMPBC</name>
                            <description>MFS ch.B I2C FastMode+ Select bit</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SFMPAC" -->
                        <field>
                            <name>SFMPAC</name>
                            <description>MFS ch.A I2C FastMode+ Select bit</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EPFR17" -->
                <register>
                    <name>EPFR17</name>
                    <description>Extended Pin Function Setting Register 17</description>
                    <addressOffset>0x644</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                </register>
                <!-- REGISTER "EPFR18" -->
                <register>
                    <name>EPFR18</name>
                    <description>Extended Pin Function Setting Register 18</description>
                    <addressOffset>0x648</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                </register>
                <!-- REGISTER "EPFR19" -->
                <register>
                    <name>EPFR19</name>
                    <description>Extended Pin Function Setting Register 19</description>
                    <addressOffset>0x64C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                </register>
                <!-- REGISTER "EPFR20" -->
                <register>
                    <name>EPFR20</name>
                    <description>Extended Pin Function Setting Register 20</description>
                    <addressOffset>0x650</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x0</resetMask>
                </register>
                <!-- REGISTER "PZR0" -->
                <register derivedFrom="DDR0">
                    <name>PZR0</name>
                    <description>Port Pseudo Open Drain Setting Register 0</description>
                    <addressOffset>0x700</addressOffset>
                </register>
                <!-- REGISTER "PZR1" -->
                <register derivedFrom="DDR1">
                    <name>PZR1</name>
                    <description>Port Pseudo Open Drain Setting Register 1</description>
                    <addressOffset>0x704</addressOffset>
                </register>
                <!-- REGISTER "PZR2" -->
                <register derivedFrom="DDR2">
                    <name>PZR2</name>
                    <description>Port Pseudo Open Drain Setting Register 2</description>
                    <addressOffset>0x708</addressOffset>
                </register>
                <!-- REGISTER "PZR3" -->
                <register derivedFrom="DDR3">
                    <name>PZR3</name>
                    <description>Port Pseudo Open Drain Setting Register 3</description>
                    <addressOffset>0x70C</addressOffset>
                </register>
                <!-- REGISTER "PZR4" -->
                <register derivedFrom="DDR4">
                    <name>PZR4</name>
                    <description>Port Pseudo Open Drain Setting Register 4</description>
                    <addressOffset>0x710</addressOffset>
                </register>
                <!-- REGISTER "PZR5" -->
                <register derivedFrom="DDR5">
                    <name>PZR5</name>
                    <description>Port Pseudo Open Drain Setting Register 5</description>
                    <addressOffset>0x714</addressOffset>
                </register>
                <!-- REGISTER "PZR6" -->
                <register derivedFrom="DDR6">
                    <name>PZR6</name>
                    <description>Port Pseudo Open Drain Setting Register 6</description>
                    <addressOffset>0x718</addressOffset>
                </register>
                <!-- REGISTER "PZR8" -->
                <register derivedFrom="DDR8">
                    <name>PZR8</name>
                    <description>Port Pseudo Open Drain Setting Register 8</description>
                    <addressOffset>0x720</addressOffset>
                </register>
                <!-- REGISTER "PZRE" -->
                <register derivedFrom="DDRE">
                    <name>PZRE</name>
                    <description>Port Pseudo Open Drain Setting Register E</description>
                    <addressOffset>0x738</addressOffset>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "LVD" -->
        <peripheral>
            <name>LVD</name>
            <description>Low-voltage Detection</description>
            <groupName>LVD</groupName>
            <baseAddress>0x40035000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x5</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "LVD" -->
            <interrupt>
                <name>LVD</name>
                <value>2</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "LVD_CTL" -->
                <register>
                    <name>LVD_CTL</name>
                    <description>Low-voltage Detection Voltage Control Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x40</resetValue>
                    <resetMask>0xFC</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "LVDIE" -->
                        <field>
                            <name>LVDIE</name>
                            <description>Low-voltage detection interrupt enable bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SVHI" -->
                        <field>
                            <name>SVHI</name>
                            <description>Low-voltage detection interrupt voltage setting bits</description>
                            <lsb>2</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "LVD_STR" -->
                <register>
                    <name>LVD_STR</name>
                    <description>Low-voltage Detection Interrupt Factor Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x80</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "LVDIR" -->
                        <field>
                            <name>LVDIR</name>
                            <description>Low-voltage detection interrupt factor bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "LVD_CLR" -->
                <register>
                    <name>LVD_CLR</name>
                    <description>Low-voltage Detection Interrupt Factor Clear Register </description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x80</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "LVDCL" -->
                        <field>
                            <name>LVDCL</name>
                            <description>Low-voltage detection interrupt factor clear bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
