itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "LVD_RLR" -->
                <register>
                    <name>LVD_RLR</name>
                    <description>Low-voltage Detection Voltage Protection Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "LVDLCK" -->
                        <field>
                            <name>LVDLCK</name>
                            <description>Low-voltage Detection Voltage Control Register protection
                                bits</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "LVD_STR2" -->
                <register>
                    <name>LVD_STR2</name>
                    <description>Low-voltage Detection Circuit Status Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x40</resetValue>
                    <resetMask>0x80</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "LVDIRDY" -->
                        <field>
                            <name>LVDIRDY</name>
                            <description>Low-voltage detection interrupt status flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "DS" -->
        <peripheral>
            <name>DS</name>
            <description>Low Power Consumption Mode</description>
            <groupName>DS</groupName>
            <baseAddress>0x40035100</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x4</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x700</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x704</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x708</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x70C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x710</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x714</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x800</offset>
                <size>0x16</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "RCK_CTL" -->
                <register>
                    <name>RCK_CTL</name>
                    <description>Sub Clock Control Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0x01</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RTCCKE" -->
                        <field>
                            <name>RTCCKE</name>
                            <description>RTC clock control bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "PMD_CTL" -->
                <register>
                    <name>PMD_CTL</name>
                    <description>RTC Mode Control Register</description>
                    <addressOffset>0x700</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x01</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RTCE" -->
                        <field>
                            <name>RTCE</name>
                            <description>RTC mode control bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WRFSR" -->
                <register>
                    <name>WRFSR</name>
                    <description>Deep Standby Return Cause Register 1</description>
                    <addressOffset>0x704</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WLVDH" -->
                        <field>
                            <name>WLVDH</name>
                            <description>Low-voltage detection reset return bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "WINITX" -->
                        <field>
                            <name>WINITX</name>
                            <description>INITX pin input reset return bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WIFSR" -->
                <register>
                    <name>WIFSR</name>
                    <description>Deep Standby Return Cause Register 2</description>
                    <addressOffset>0x708</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x00FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WUI5" -->
                        <field>
                            <name>WUI5</name>
                            <description>WKUP pin input return bit 5</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WUI4" -->
                        <field>
                            <name>WUI4</name>
                            <description>WKUP pin input return bit 4</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WUI3" -->
                        <field>
                            <name>WUI3</name>
                            <description>WKUP pin input return bit 3</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WUI2" -->
                        <field>
                            <name>WUI2</name>
                            <description>WKUP pin input return bit 2</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WUI1" -->
                        <field>
                            <name>WUI1</name>
                            <description>WKUP pin input return bit 1</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WUI0" -->
                        <field>
                            <name>WUI0</name>
                            <description>WKUP pin input return bit 0</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WLVDI" -->
                        <field>
                            <name>WLVDI</name>
                            <description>LVD interrupt return bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WRTCI" -->
                        <field>
                            <name>WRTCI</name>
                            <description>RTC interrupt return bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
