itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "BUR07" -->
                <register>
                    <name>BUR07</name>
                    <description>Backup Registers from 7</description>
                    <addressOffset>0x806</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BUR08" -->
                <register>
                    <name>BUR08</name>
                    <description>Backup Registers from 8</description>
                    <addressOffset>0x807</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BUR09" -->
                <register>
                    <name>BUR09</name>
                    <description>Backup Registers from 9</description>
                    <addressOffset>0x808</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BUR10" -->
                <register>
                    <name>BUR10</name>
                    <description>Backup Registers from 10</description>
                    <addressOffset>0x809</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BUR11" -->
                <register>
                    <name>BUR11</name>
                    <description>Backup Registers from 11</description>
                    <addressOffset>0x80A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BUR12" -->
                <register>
                    <name>BUR12</name>
                    <description>Backup Registers from 12</description>
                    <addressOffset>0x80B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BUR13" -->
                <register>
                    <name>BUR13</name>
                    <description>Backup Registers from 13</description>
                    <addressOffset>0x80C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BUR14" -->
                <register>
                    <name>BUR14</name>
                    <description>Backup Registers from 14</description>
                    <addressOffset>0x80D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BUR15" -->
                <register>
                    <name>BUR15</name>
                    <description>Backup Registers from 15</description>
                    <addressOffset>0x80E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BUR16" -->
                <register>
                    <name>BUR16</name>
                    <description>Backup Registers from 16</description>
                    <addressOffset>0x80F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "MFS0" -->
        <peripheral>
            <name>MFS0</name>
            <description>Multi-function Serial Interface 0</description>
            <groupName>MFS0</groupName>
            <baseAddress>0x40038000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x24</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3C</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>0x2</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "MFS0_RX" -->
            <interrupt>
                <name>MFS0_RX</name>
                <value>60</value>
            </interrupt>
            <!-- INTERRUPT "MFS0_TX" -->
            <interrupt>
                <name>MFS0_TX</name>
                <value>61</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "UART_SCR" -->
                <register>
                    <name>UART_SCR</name>
                    <description>Serial Control Register</description>
                    <alternateGroup>UART</alternateGroup>
                    <addressOffset>0x1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x9F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "UPCL" -->
                        <field>
                            <name>UPCL</name>
                            <description>Programmable Clear bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RIE" -->
                        <field>
                            <name>RIE</name>
                            <description>Received interrupt enable bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIE" -->
                        <field>
                            <name>TIE</name>
                            <description>Transmit interrupt enable bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TBIE" -->
                        <field>
                            <name>TBIE</name>
                            <description>Transmit bus idle interrupt enable bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RXE" -->
                        <field>
                            <name>RXE</name>
                            <description>Received operation enable bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TXE" -->
                        <field>
                            <name>TXE</name>
                            <description>Transmission operation enable bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "UART_SMR" -->
                <register>
                    <name>UART_SMR</name>
                    <description>Serial Mode Register</description>
                    <alternateGroup>UART</alternateGroup>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xED</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MD" -->
                        <field>
                            <name>MD</name>
                            <description>Operation mode set bit</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SBL" -->
                        <field>
                            <name>SBL</name>
                            <description>Stop bit length select bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BDS" -->
                        <field>
                            <name>BDS</name>
                            <description>Transfer direction select bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOE" -->
                        <field>
                            <name>SOE</name>
                            <description>Serial data output enable bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "UART_SSR" -->
                <register>
                    <name>UART_SSR</name>
                    <description>Serial Status Register</description>
                    <alternateGroup>UART</alternateGroup>
                    <addressOffset>0x5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0xBF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "REC" -->
                        <field>
                            <name>REC</name>
                            <description>Received error flag clear bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PE" -->
                        <field>
                            <name>PE</name>
                            <description>Parity error flag bit (only functions in operation mode 0) </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "FRE" -->
                        <field>
                            <name>FRE</name>
                            <description>Framing error flag bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ORE" -->
                        <field>
                            <name>ORE</name>
                            <description>Overrun error flag bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RDRF" -->
                        <field>
                            <name>RDRF</name>
                            <description>Received data full flag bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TDRE" -->
                        <field>
                            <name>TDRE</name>
                            <description>Transmit data empty flag bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TBI" -->
                        <field>
                            <name>TBI</name>
                            <description>Transmit bus idle flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
