itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "UART_ESCR" -->
                <register>
                    <name>UART_ESCR</name>
                    <description>Extended Communication Control Register</description>
                    <alternateGroup>UART</alternateGroup>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FLWEN" -->
                        <field>
                            <name>FLWEN</name>
                            <description>Flow control enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ESBL" -->
                        <field>
                            <name>ESBL</name>
                            <description>Extension stop bit length select bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INV" -->
                        <field>
                            <name>INV</name>
                            <description>Inverted serial data format bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PEN" -->
                        <field>
                            <name>PEN</name>
                            <description>Parity enable bit (only functions in operation mode 0) </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "P" -->
                        <field>
                            <name>P</name>
                            <description>Parity select bit (only functions in operation mode 0)</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "L" -->
                        <field>
                            <name>L</name>
                            <description>Data length select bit</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "UART_RDR" -->
                <register>
                    <name>UART_RDR</name>
                    <description>Received Data Register</description>
                    <alternateGroup>UART</alternateGroup>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x01FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "D" -->
                        <field>
                            <name>D</name>
                            <description>Data</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "UART_TDR" -->
                <register>
                    <name>UART_TDR</name>
                    <description>Transmit Data Register</description>
                    <alternateGroup>UART</alternateGroup>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x01FF</resetValue>
                    <resetMask>0x01FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "D" -->
                        <field>
                            <name>D</name>
                            <description>Data</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "UART_BGR" -->
                <register>
                    <name>UART_BGR</name>
                    <description>Baud Rate Generator Registers</description>
                    <alternateGroup>UART</alternateGroup>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EXT" -->
                        <field>
                            <name>EXT</name>
                            <description>External clock select bit</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BGR1" -->
                        <field>
                            <name>BGR1</name>
                            <description>Baud Rate Generator Registers 1</description>
                            <lsb>8</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BGR0" -->
                        <field>
                            <name>BGR0</name>
                            <description>Baud Rate Generator Registers 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
