itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "UART_FCR1" -->
                <register>
                    <name>UART_FCR1</name>
                    <description>FIFO Control Register 1</description>
                    <alternateGroup>UART</alternateGroup>
                    <addressOffset>0x15</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x04</resetValue>
                    <resetMask>0x1F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FLSTE" -->
                        <field>
                            <name>FLSTE</name>
                            <description>Re-transmission data lost detect enable bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FRIIE" -->
                        <field>
                            <name>FRIIE</name>
                            <description>Received FIFO idle detection enable bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FDRQ" -->
                        <field>
                            <name>FDRQ</name>
                            <description>Transmit FIFO data request bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FTIE" -->
                        <field>
                            <name>FTIE</name>
                            <description>Transmit FIFO interrupt enable bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FSEL" -->
                        <field>
                            <name>FSEL</name>
                            <description>FIFO select bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "UART_FCR0" -->
                <register>
                    <name>UART_FCR0</name>
                    <description>FIFO Control Register 0</description>
                    <alternateGroup>UART</alternateGroup>
                    <addressOffset>0x14</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x7F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FLST" -->
                        <field>
                            <name>FLST</name>
                            <description>FIFO re-transmit data lost flag bit </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "FLD" -->
                        <field>
                            <name>FLD</name>
                            <description>FIFO pointer reload bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FSET" -->
                        <field>
                            <name>FSET</name>
                            <description>FIFO pointer save bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FCL2" -->
                        <field>
                            <name>FCL2</name>
                            <description>FIFO2 reset bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FCL1" -->
                        <field>
                            <name>FCL1</name>
                            <description>FIFO1 reset bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FE2" -->
                        <field>
                            <name>FE2</name>
                            <description>FIFO2 operation enable bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FE1" -->
                        <field>
                            <name>FE1</name>
                            <description>FIFO1 operation enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "UART_FBYTE1" -->
                <register>
                    <name>UART_FBYTE1</name>
                    <description>FIFO Byte Register 1</description>
                    <alternateGroup>UART</alternateGroup>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "UART_FBYTE2" -->
                <register>
                    <name>UART_FBYTE2</name>
                    <description>FIFO Byte Register 2</description>
                    <alternateGroup>UART</alternateGroup>
                    <addressOffset>0x19</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "CSIO_SCR" -->
                <register>
                    <name>CSIO_SCR</name>
                    <description>Serial Control Register</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "UPCL" -->
                        <field>
                            <name>UPCL</name>
                            <description>Programmable clear bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MS" -->
                        <field>
                            <name>MS</name>
                            <description>Master/Slave function select bit </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SPI" -->
                        <field>
                            <name>SPI</name>
                            <description>SPI corresponding bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RIE" -->
                        <field>
                            <name>RIE</name>
                            <description>Received interrupt enable bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIE" -->
                        <field>
                            <name>TIE</name>
                            <description>Transmit interrupt enable bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TBIE" -->
                        <field>
                            <name>TBIE</name>
                            <description>Transmit bus idle interrupt enable bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RXE" -->
                        <field>
                            <name>RXE</name>
                            <description>Data received enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TXE" -->
                        <field>
                            <name>TXE</name>
                            <description>Data transmission enable bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CSIO_SMR" -->
                <register>
                    <name>CSIO_SMR</name>
                    <description>Serial Mode Register</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xEF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MD" -->
                        <field>
                            <name>MD</name>
                            <description>Operation mode set bits</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SCINV" -->
                        <field>
                            <name>SCINV</name>
                            <description>Serial clock invert bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BDS" -->
                        <field>
                            <name>BDS</name>
                            <description>Transfer direction select bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SCKE" -->
                        <field>
                            <name>SCKE</name>
                            <description>Master mode serial clock output enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOE" -->
                        <field>
                            <name>SOE</name>
                            <description>Serial data output enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CSIO_SSR" -->
                <register>
                    <name>CSIO_SSR</name>
                    <description>Serial Status Register</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0x9F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "REC" -->
                        <field>
                            <name>REC</name>
                            <description>Received error flag clear bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "AWC" -->
                        <field>
                            <name>AWC</name>
                            <description>Access Width Control bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ORE" -->
                        <field>
                            <name>ORE</name>
                            <description>Overrun error flag bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RDRF" -->
                        <field>
                            <name>RDRF</name>
                            <description>Received data full flag bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TDRE" -->
                        <field>
                            <name>TDRE</name>
                            <description>Transmit data empty flag bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TBI" -->
                        <field>
                            <name>TBI</name>
                            <description>Transmit bus idle flag bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CSIO_ESCR" -->
                <register>
                    <name>CSIO_ESCR</name>
                    <description>Extended Communication Control Register</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xCF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SOP" -->
                        <field>
                            <name>SOP</name>
                            <description>Serial output pin set bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "L3" -->
                        <field>
                            <name>L3</name>
                            <description>Bit3 of Data length select bits </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "WT" -->
                        <field>
                            <name>WT</name>
                            <description>Data transmit/received wait select bits</description>
                            <lsb>3</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "L" -->
                        <field>
                            <name>L</name>
                            <description>Data length select bits</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CSIO_RDR" -->
                <register>
                    <name>CSIO_RDR</name>
                    <description>Received Data Register</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "D" -->
                        <field>
                            <name>D</name>
                            <description>Data</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
