itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "CSIO_SCSTR2" -->
                <register>
                    <name>CSIO_SCSTR2</name>
                    <description>Serial Chip Select Timing Registers 2/3</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x20</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CSDS" -->
                        <field>
                            <name>CSDS</name>
                            <description>Serial Chip Deselect bits</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CSIO_SCSTR3" -->
                <register>
                    <name>CSIO_SCSTR3</name>
                    <description>Serial Chip Select Timing Registers 3</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x21</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "CSIO_SACSR" -->
                <register>
                    <name>CSIO_SACSR</name>
                    <description>Serial Support Control Register</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x24</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x39DF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TBEEN" -->
                        <field>
                            <name>TBEEN</name>
                            <description>Transfer Byte Error Enable bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CSEIE" -->
                        <field>
                            <name>CSEIE</name>
                            <description>Chip Select Error Interupt Enable bit</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CSE" -->
                        <field>
                            <name>CSE</name>
                            <description>Chip Select Error Flag</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TINT" -->
                        <field>
                            <name>TINT</name>
                            <description>Timer Interrupt Flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TINTE" -->
                        <field>
                            <name>TINTE</name>
                            <description>Timer Interrupt Enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TSYNE" -->
                        <field>
                            <name>TSYNE</name>
                            <description>Synchronous Transmission Enable bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TDIV" -->
                        <field>
                            <name>TDIV</name>
                            <description>Timer Operation Clock Division bit</description>
                            <lsb>1</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TMRE" -->
                        <field>
                            <name>TMRE</name>
                            <description>Serial Timer Enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CSIO_STMR" -->
                <register>
                    <name>CSIO_STMR</name>
                    <description>Serial Timer Register</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x28</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TM" -->
                        <field>
                            <name>TM</name>
                            <description>Timer Data bits</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
