itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "CSIO_STMCR" -->
                <register>
                    <name>CSIO_STMCR</name>
                    <description>Serial Timer Comparison Register</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x2C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TC" -->
                        <field>
                            <name>TC</name>
                            <description>Compare bits</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CSIO_SCSCR" -->
                <register>
                    <name>CSIO_SCSCR</name>
                    <description>Serial Chip Select Control Status Register</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x30</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0020</resetValue>
                    <resetMask>0x03E3</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SCAM" -->
                        <field>
                            <name>SCAM</name>
                            <description>Serial Chip Select Active Hold bit</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CDIV" -->
                        <field>
                            <name>CDIV</name>
                            <description>Serial Chip Select Timing Operation Clock Division bit</description>
                            <lsb>6</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CSLVL" -->
                        <field>
                            <name>CSLVL</name>
                            <description>Serial Chip Select Level Setting bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CSEN0" -->
                        <field>
                            <name>CSEN0</name>
                            <description>Serial Chip Select Enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CSOE" -->
                        <field>
                            <name>CSOE</name>
                            <description>Serial Chip Select Output Enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CSIO_TBYTE0" -->
                <register>
                    <name>CSIO_TBYTE0</name>
                    <description>TBYTE0</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x3C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "CSIO_TBYTE1" -->
                <register>
                    <name>CSIO_TBYTE1</name>
                    <description>TBYTE1</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x3D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "CSIO_TBYTE2" -->
                <register>
                    <name>CSIO_TBYTE2</name>
                    <description>TBYTE2</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x40</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "CSIO_TBYTE3" -->
                <register>
                    <name>CSIO_TBYTE3</name>
                    <description>TBYTE3</description>
                    <alternateGroup>CSIO</alternateGroup>
                    <addressOffset>0x41</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "LIN_SCR" -->
                <register>
                    <name>LIN_SCR</name>
                    <description>Serial Control Register</description>
                    <alternateGroup>LIN</alternateGroup>
                    <addressOffset>0x1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "UPCL" -->
                        <field>
                            <name>UPCL</name>
                            <description>Programmable clear bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MS" -->
                        <field>
                            <name>MS</name>
                            <description>Master/Slave function select bit </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LBR" -->
                        <field>
                            <name>LBR</name>
                            <description>LIN Break Field setting bit (valid in master mode only) </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RIE" -->
                        <field>
                            <name>RIE</name>
                            <description>Received interrupt enable bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIE" -->
                        <field>
                            <name>TIE</name>
                            <description>Transmit interrupt enable bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TBIE" -->
                        <field>
                            <name>TBIE</name>
                            <description>Transmit bus idle interrupt enable bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RXE" -->
                        <field>
                            <name>RXE</name>
                            <description>Data reception enable bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TXE" -->
                        <field>
                            <name>TXE</name>
                            <description>Data transmission enable bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "LIN_SMR" -->
                <register>
                    <name>LIN_SMR</name>
                    <description>Serial Mode Register</description>
                    <alternateGroup>LIN</alternateGroup>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xF9</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MD" -->
                        <field>
                            <name>MD</name>
                            <description>Operation mode setting bits </description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "WUCR" -->
                        <field>
                            <name>WUCR</name>
                            <description>Wake-up control bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SBL" -->
                        <field>
                            <name>SBL</name>
                            <description>Stop bit length select bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOE" -->
                        <field>
                            <name>SOE</name>
                            <description>Serial data output enable bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "LIN_SSR" -->
                <register>
                    <name>LIN_SSR</name>
                    <description>Serial Status Register</description>
                    <alternateGroup>LIN</alternateGroup>
                    <addressOffset>0x5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0xBF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "REC" -->
                        <field>
                            <name>REC</name>
                            <description>Received Error flag clear bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LBD" -->
                        <field>
                            <name>LBD</name>
                            <description>LIN Break field detection flag bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FRE" -->
                        <field>
                            <name>FRE</name>
                            <description>Framing error flag bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ORE" -->
                        <field>
                            <name>ORE</name>
                            <description>Overrun error flag bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RDRF" -->
                        <field>
                            <name>RDRF</name>
                            <description>Received data full flag bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TDRE" -->
                        <field>
                            <name>TDRE</name>
                            <description>Transmit data empty flag bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TBI" -->
                        <field>
                            <name>TBI</name>
                            <description>Transmit bus idle flag bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "LIN_ESCR" -->
                <register>
                    <name>LIN_ESCR</name>
                    <description>Extended Communication Control Register</description>
                    <alternateGroup>LIN</alternateGroup>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xDF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ESBL" -->
                        <field>
                            <name>ESBL</name>
                            <description>Extended stop bit length select bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LBIE" -->
                        <field>
                            <name>LBIE</name>
                            <description>LIN Break field detect interrupt enable bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LBL" -->
                        <field>
                            <name>LBL</name>
                            <description>LIN Break field length select bits (valid in master mode
                                only) </description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DEL" -->
                        <field>
                            <name>DEL</name>
                            <description>LIN Break delimiter length select bits (valid in master
                                mode only) </description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "LIN_RDR" -->
                <register>
                    <name>LIN_RDR</name>
                    <description>Received Data Register</description>
                    <alternateGroup>LIN</alternateGroup>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x00FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "D" -->
                        <field>
                            <name>D</name>
                            <description>Data</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
