itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "LIN_TDR" -->
                <register>
                    <name>LIN_TDR</name>
                    <description>Transmit Data Register</description>
                    <alternateGroup>LIN</alternateGroup>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x00FF</resetValue>
                    <resetMask>0x00FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "D" -->
                        <field>
                            <name>D</name>
                            <description>Data</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "LIN_BGR" -->
                <register>
                    <name>LIN_BGR</name>
                    <description>Baud Rate Generator Registers</description>
                    <alternateGroup>LIN</alternateGroup>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EXT" -->
                        <field>
                            <name>EXT</name>
                            <description>External clock select bit </description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BGR1" -->
                        <field>
                            <name>BGR1</name>
                            <description>Baud Rate Generator Registers 1</description>
                            <lsb>8</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BGR0" -->
                        <field>
                            <name>BGR0</name>
                            <description>Baud Rate Generator Registers 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "LIN_FCR1" -->
                <register>
                    <name>LIN_FCR1</name>
                    <description>FIFO Control Register 1</description>
                    <alternateGroup>LIN</alternateGroup>
                    <addressOffset>0x15</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x04</resetValue>
                    <resetMask>0x1F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FLSTE" -->
                        <field>
                            <name>FLSTE</name>
                            <description>Re-transmission data lost detect enable bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FRIIE" -->
                        <field>
                            <name>FRIIE</name>
                            <description>Received FIFO idle detection enable bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FDRQ" -->
                        <field>
                            <name>FDRQ</name>
                            <description>Transmit FIFO data request bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FTIE" -->
                        <field>
                            <name>FTIE</name>
                            <description>Transmit FIFO interrupt enable bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FSEL" -->
                        <field>
                            <name>FSEL</name>
                            <description>FIFO select bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "LIN_FCR0" -->
                <register>
                    <name>LIN_FCR0</name>
                    <description>FIFO Control Register 0</description>
                    <alternateGroup>LIN</alternateGroup>
                    <addressOffset>0x14</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x7F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FLST" -->
                        <field>
                            <name>FLST</name>
                            <description>FIFO re-transmit data lost flag bit </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "FLD" -->
                        <field>
                            <name>FLD</name>
                            <description>FIFO pointer reload bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FSET" -->
                        <field>
                            <name>FSET</name>
                            <description>FIFO pointer save bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FCL2" -->
                        <field>
                            <name>FCL2</name>
                            <description>FIFO2 reset bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FCL1" -->
                        <field>
                            <name>FCL1</name>
                            <description>FIFO1 reset bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FE2" -->
                        <field>
                            <name>FE2</name>
                            <description>FIFO2 operation enable bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FE1" -->
                        <field>
                            <name>FE1</name>
                            <description>FIFO1 operation enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "LIN_FBYTE1" -->
                <register>
                    <name>LIN_FBYTE1</name>
                    <description>FIFO Byte Register 1</description>
                    <alternateGroup>LIN</alternateGroup>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "LIN_FBYTE2" -->
                <register>
                    <name>LIN_FBYTE2</name>
                    <description>FIFO Byte Register 2</description>
                    <alternateGroup>LIN</alternateGroup>
                    <addressOffset>0x19</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
