itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "I2C_IBCR" -->
                <register>
                    <name>I2C_IBCR</name>
                    <description>I2C Bus Control Register</description>
                    <alternateGroup>I2C</alternateGroup>
                    <addressOffset>0x1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MSS" -->
                        <field>
                            <name>MSS</name>
                            <description>Master/slave select bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ACT_SCC" -->
                        <field>
                            <name>ACT_SCC</name>
                            <description>Operation flag/iteration start condition generation bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ACKE" -->
                        <field>
                            <name>ACKE</name>
                            <description>Data byte acknowledge enable bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "WSEL" -->
                        <field>
                            <name>WSEL</name>
                            <description>Wait selection bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CNDE" -->
                        <field>
                            <name>CNDE</name>
                            <description>Condition detection interrupt enable bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTE" -->
                        <field>
                            <name>INTE</name>
                            <description>Interrupt enable bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BER" -->
                        <field>
                            <name>BER</name>
                            <description>Bus error flag bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "INT" -->
                        <field>
                            <name>INT</name>
                            <description>interrupt flag bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "I2C_SMR" -->
                <register>
                    <name>I2C_SMR</name>
                    <description>Serial Mode Register</description>
                    <alternateGroup>I2C</alternateGroup>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xEC</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MD" -->
                        <field>
                            <name>MD</name>
                            <description>operation mode set bits</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RIE" -->
                        <field>
                            <name>RIE</name>
                            <description>Received interrupt enable bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TIE" -->
                        <field>
                            <name>TIE</name>
                            <description>Transmit interrupt enable bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "I2C_IBSR" -->
                <register>
                    <name>I2C_IBSR</name>
                    <description>I2C Bus Status Register</description>
                    <alternateGroup>I2C</alternateGroup>
                    <addressOffset>0x4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FBT" -->
                        <field>
                            <name>FBT</name>
                            <description>First byte bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RACK" -->
                        <field>
                            <name>RACK</name>
                            <description>Acknowledge flag bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RSA" -->
                        <field>
                            <name>RSA</name>
                            <description>Reserved address detection bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TRX" -->
                        <field>
                            <name>TRX</name>
                            <description>Data direction bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "AL" -->
                        <field>
                            <name>AL</name>
                            <description>Arbitration lost bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RSC" -->
                        <field>
                            <name>RSC</name>
                            <description>Iteration start condition check bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SPC" -->
                        <field>
                            <name>SPC</name>
                            <description>Stop condition check bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BB" -->
                        <field>
                            <name>BB</name>
                            <description>Bus state bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "I2C_SSR" -->
                <register>
                    <name>I2C_SSR</name>
                    <description>Serial Status Register </description>
                    <alternateGroup>I2C</alternateGroup>
                    <addressOffset>0x5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "REC" -->
                        <field>
                            <name>REC</name>
                            <description>Received error flag clear bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TSET" -->
                        <field>
                            <name>TSET</name>
                            <description>Transmit empty flag set bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DMA" -->
                        <field>
                            <name>DMA</name>
                            <description>DMA mode enable bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TBIE" -->
                        <field>
                            <name>TBIE</name>
                            <description>Transmit bus idle interrupt enable bit (Effective only when
                                DMA mode is enabled) </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ORE" -->
                        <field>
                            <name>ORE</name>
                            <description>Overrun error flag bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RDRF" -->
                        <field>
                            <name>RDRF</name>
                            <description>Received data full flag bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TDRE" -->
                        <field>
                            <name>TDRE</name>
                            <description>Transmit data empty flag bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TBI" -->
                        <field>
                            <name>TBI</name>
                            <description>Transmit bus idle flag bit (Effective only when DMA mode is
                                enabled) </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
