itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "I2C_RDR" -->
                <register>
                    <name>I2C_RDR</name>
                    <description>Received Data Register</description>
                    <alternateGroup>I2C</alternateGroup>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x00FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "D" -->
                        <field>
                            <name>D</name>
                            <description>Data</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "I2C_TDR" -->
                <register>
                    <name>I2C_TDR</name>
                    <description>Transmit Data Register</description>
                    <alternateGroup>I2C</alternateGroup>
                    <addressOffset>0x8</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x00FF</resetValue>
                    <resetMask>0x00FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "D" -->
                        <field>
                            <name>D</name>
                            <description>Data</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "I2C_BGR" -->
                <register>
                    <name>I2C_BGR</name>
                    <description>Baud Rate Generator Registers</description>
                    <alternateGroup>I2C</alternateGroup>
                    <addressOffset>0xC</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x7FFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BGR1" -->
                        <field>
                            <name>BGR1</name>
                            <description>Baud Rate Generator Registers 1</description>
                            <lsb>8</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BGR0" -->
                        <field>
                            <name>BGR0</name>
                            <description>Baud Rate Generator Registers 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "I2C_ISMK" -->
                <register>
                    <name>I2C_ISMK</name>
                    <description>7-bit Slave Address Mask Register</description>
                    <alternateGroup>I2C</alternateGroup>
                    <addressOffset>0x11</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x7F</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EN" -->
                        <field>
                            <name>EN</name>
                            <description>I2C interface operation enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SM" -->
                        <field>
                            <name>SM</name>
                            <description>Slave address mask bits</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "I2C_ISBA" -->
                <register>
                    <name>I2C_ISBA</name>
                    <description>7-bit Slave Address Register</description>
                    <alternateGroup>I2C</alternateGroup>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SAEN" -->
                        <field>
                            <name>SAEN</name>
                            <description>Slave address enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SA" -->
                        <field>
                            <name>SA</name>
                            <description>7-bit slave address</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "I2C_FCR1" -->
                <register>
                    <name>I2C_FCR1</name>
                    <description>FIFO Control Register 1</description>
                    <alternateGroup>I2C</alternateGroup>
                    <addressOffset>0x15</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x04</resetValue>
                    <resetMask>0x1F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FLSTE" -->
                        <field>
                            <name>FLSTE</name>
                            <description>Re-transmission data lost detect enable bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FRIIE" -->
                        <field>
                            <name>FRIIE</name>
                            <description>Received FIFO idle detection enable bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FDRQ" -->
                        <field>
                            <name>FDRQ</name>
                            <description>Transmit FIFO data request bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FTIE" -->
                        <field>
                            <name>FTIE</name>
                            <description>Transmit FIFO interrupt enable bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FSEL" -->
                        <field>
                            <name>FSEL</name>
                            <description>FIFO select bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
