itzandroidtab/klib-svd/mb9bf566k.svd
            </registers>
        </peripheral>
        <!-- PERIPHERAL "MFS1" -->
        <peripheral derivedFrom="MFS0">
            <name>MFS1</name>
            <baseAddress>0x40038100</baseAddress>
            <!-- INTERRUPT "MFS1_RX" -->
            <interrupt>
                <name>MFS1_RX</name>
                <value>62</value>
            </interrupt>
            <!-- INTERRUPT "MFS1_TX" -->
            <interrupt>
                <name>MFS1_TX</name>
                <value>63</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "MFS2" -->
        <peripheral derivedFrom="MFS0">
            <name>MFS2</name>
            <baseAddress>0x40038200</baseAddress>
            <!-- INTERRUPT "MFS2_RX" -->
            <interrupt>
                <name>MFS2_RX</name>
                <value>64</value>
            </interrupt>
            <!-- INTERRUPT "MFS2_TX" -->
            <interrupt>
                <name>MFS2_TX</name>
                <value>65</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "MFS3" -->
        <peripheral derivedFrom="MFS0">
            <name>MFS3</name>
            <baseAddress>0x40038300</baseAddress>
            <!-- INTERRUPT "MFS3_RX" -->
            <interrupt>
                <name>MFS3_RX</name>
                <value>66</value>
            </interrupt>
            <!-- INTERRUPT "MFS3_TX" -->
            <interrupt>
                <name>MFS3_TX</name>
                <value>67</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "MFS4" -->
        <peripheral derivedFrom="MFS0">
            <name>MFS4</name>
            <baseAddress>0x40038400</baseAddress>
            <!-- INTERRUPT "MFS4_RX" -->
            <interrupt>
                <name>MFS4_RX</name>
                <value>68</value>
            </interrupt>
            <!-- INTERRUPT "MFS4_TX" -->
            <interrupt>
                <name>MFS4_TX</name>
                <value>69</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "MFS6" -->
        <peripheral derivedFrom="MFS0">
            <name>MFS6</name>
            <baseAddress>0x40038600</baseAddress>
            <!-- INTERRUPT "MFS6_RX" -->
            <interrupt>
                <name>MFS6_RX</name>
                <value>72</value>
            </interrupt>
            <!-- INTERRUPT "MFS6_TX" -->
            <interrupt>
                <name>MFS6_TX</name>
                <value>73</value>
            </interrupt>
        </peripheral>
        <!-- PERIPHERAL "CRC" -->
        <peripheral>
            <name>CRC</name>
            <description>CRC Registers</description>
            <groupName>CRC</groupName>
            <baseAddress>0x40039000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "CRCCR" -->
                <register>
                    <name>CRCCR</name>
                    <description>CRC Control Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x7F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FXOR" -->
                        <field>
                            <name>FXOR</name>
                            <description>Initialization bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CRCLSF" -->
                        <field>
                            <name>CRCLSF</name>
                            <description>Final XOR control bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CRCLTE" -->
                        <field>
                            <name>CRCLTE</name>
                            <description>CRC result bit-order setting bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LSBFST" -->
                        <field>
                            <name>LSBFST</name>
                            <description>CRC result byte-order setting bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LTLEND" -->
                        <field>
                            <name>LTLEND</name>
                            <description>Bit-order setting bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CRC32" -->
                        <field>
                            <name>CRC32</name>
                            <description>Byte-order setting bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INIT" -->
                        <field>
                            <name>INIT</name>
                            <description>CRC mode selection bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CRCINIT" -->
                <register>
                    <name>CRCINIT</name>
                    <description>Initial Value Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "D" -->
                        <field>
                            <name>D</name>
                            <description>Initial value</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CRCIN" -->
                <register>
                    <name>CRCIN</name>
                    <description>Input Data Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "D" -->
                        <field>
                            <name>D</name>
                            <description>Input data</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CRCR" -->
                <register>
                    <name>CRCR</name>
                    <description>CRC Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "D" -->
                        <field>
                            <name>D</name>
                            <description>CRC Data</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
