itzandroidtab/klib-svd/mb9bf566k.svd
            </registers>
        </peripheral>
        <!-- PERIPHERAL "RTC" -->
        <peripheral>
            <name>RTC</name>
            <description>REAL-TIME CLOCK</description>
            <groupName>RTC</groupName>
            <baseAddress>0x4003B000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1B1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x200</offset>
                <size>0x80</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "RTC" -->
            <interrupt>
                <name>RTC</name>
                <value>50</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "WTCR10" -->
                <register>
                    <name>WTCR10</name>
                    <description>Control Register 10</description>
                    <addressOffset>0x100</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TRANS" -->
                        <field>
                            <name>TRANS</name>
                            <description>Transfer flag bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "BUSY" -->
                        <field>
                            <name>BUSY</name>
                            <description>Busy bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "SCRST" -->
                        <field>
                            <name>SCRST</name>
                            <description>Sub second generation/1-second generation counter reset bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SCST" -->
                        <field>
                            <name>SCST</name>
                            <description>1-second clock output stop bit </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SRST" -->
                        <field>
                            <name>SRST</name>
                            <description>RTC reset bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RUN" -->
                        <field>
                            <name>RUN</name>
                            <description>RTC count block operation bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ST" -->
                        <field>
                            <name>ST</name>
                            <description>Start bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTCR11" -->
                <register>
                    <name>WTCR11</name>
                    <description>Control Register 11</description>
                    <addressOffset>0x104</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x1F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "YEN" -->
                        <field>
                            <name>YEN</name>
                            <description>Alarm year register enable bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MOEN" -->
                        <field>
                            <name>MOEN</name>
                            <description>Alarm month register enable bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DEN" -->
                        <field>
                            <name>DEN</name>
                            <description>Alarm day register enable bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "HEN" -->
                        <field>
                            <name>HEN</name>
                            <description>Alarm hour register enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MIEN" -->
                        <field>
                            <name>MIEN</name>
                            <description>Alarm minute register enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTCR12" -->
                <register>
                    <name>WTCR12</name>
                    <description>Control Register 12</description>
                    <addressOffset>0x108</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "INTCRI" -->
                        <field>
                            <name>INTCRI</name>
                            <description>Year/month/date/hour/minute/second/day of the week counter
                                value read completion interrupt flag bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTERI" -->
                        <field>
                            <name>INTERI</name>
                            <description>Time rewrite error interrupt flag bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTALI" -->
                        <field>
                            <name>INTALI</name>
                            <description>Alarm coincidence flag bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTTMI" -->
                        <field>
                            <name>INTTMI</name>
                            <description>Timer underflow detection flag bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTHI" -->
                        <field>
                            <name>INTHI</name>
                            <description>Every hour flag bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTMI" -->
                        <field>
                            <name>INTMI</name>
                            <description>Every minute flag bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTSI" -->
                        <field>
                            <name>INTSI</name>
                            <description>Every second flag bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTSSI" -->
                        <field>
                            <name>INTSSI</name>
                            <description>Every 0.5-second flag bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
