itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "WTCR13" -->
                <register>
                    <name>WTCR13</name>
                    <description>Control Register 13</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "INTCRIE" -->
                        <field>
                            <name>INTCRIE</name>
                            <description>Year/month/date/hour/minute/second/day of the week counter
                                value read completion interrupt enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTERIE" -->
                        <field>
                            <name>INTERIE</name>
                            <description>Time rewrite error interrupt enable bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTALIE" -->
                        <field>
                            <name>INTALIE</name>
                            <description>Alarm coincidence interrupt enable bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTTMIE" -->
                        <field>
                            <name>INTTMIE</name>
                            <description>Timer underflow interrupt enable bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTHIE" -->
                        <field>
                            <name>INTHIE</name>
                            <description>Every hour interrupt enable bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTMIE" -->
                        <field>
                            <name>INTMIE</name>
                            <description>Every minute interrupt enable bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTSIE" -->
                        <field>
                            <name>INTSIE</name>
                            <description>Every second interrupt enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INTSSIE" -->
                        <field>
                            <name>INTSSIE</name>
                            <description>Every 0.5-second interrupt enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTCR20" -->
                <register>
                    <name>WTCR20</name>
                    <description>Control Register 20</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "PWRITE" -->
                        <field>
                            <name>PWRITE</name>
                            <description>VBAT PORT save control bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PREAD" -->
                        <field>
                            <name>PREAD</name>
                            <description>VBAT PORT recall control bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BWRITE" -->
                        <field>
                            <name>BWRITE</name>
                            <description>Back up register save control bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BREAD" -->
                        <field>
                            <name>BREAD</name>
                            <description>Back up register recall control bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CWRITE" -->
                        <field>
                            <name>CWRITE</name>
                            <description>RTC setting save control bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CREAD" -->
                        <field>
                            <name>CREAD</name>
                            <description>RTC setting recall control bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTCR21" -->
                <register>
                    <name>WTCR21</name>
                    <description>Control Register 21</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x07</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TMRUN" -->
                        <field>
                            <name>TMRUN</name>
                            <description>Timer counter operation bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TMEN" -->
                        <field>
                            <name>TMEN</name>
                            <description>Timer counter control bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TMST" -->
                        <field>
                            <name>TMST</name>
                            <description>Timer counter start bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTSR" -->
                <register>
                    <name>WTSR</name>
                    <description>Second Register</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x7F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TS" -->
                        <field>
                            <name>TS</name>
                            <description>2nd digit of the second information</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "S" -->
                        <field>
                            <name>S</name>
                            <description>1st digit of the second information</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTMIR" -->
                <register>
                    <name>WTMIR</name>
                    <description>Minute Register</description>
                    <addressOffset>0x120</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x7F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TMI" -->
                        <field>
                            <name>TMI</name>
                            <description>2nd digit of the minute information</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MI" -->
                        <field>
                            <name>MI</name>
                            <description>1st digit of the minute information</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTHR" -->
                <register>
                    <name>WTHR</name>
                    <description>Hour register</description>
                    <addressOffset>0x124</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TH" -->
                        <field>
                            <name>TH</name>
                            <description>2nd digit of the hour information</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "H" -->
                        <field>
                            <name>H</name>
                            <description>1st digit of the hour information</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTDR" -->
                <register>
                    <name>WTDR</name>
                    <description>Day Register</description>
                    <addressOffset>0x128</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TD" -->
                        <field>
                            <name>TD</name>
                            <description>2nd digit of the day information</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "D" -->
                        <field>
                            <name>D</name>
                            <description>1st digit of the day information</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTDW" -->
                <register>
                    <name>WTDW</name>
                    <description>Day of the Week Register</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x7</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DW" -->
                        <field>
                            <name>DW</name>
                            <description>Day of the week information</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTMOR" -->
                <register>
                    <name>WTMOR</name>
                    <description>Month Register</description>
                    <addressOffset>0x130</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x1F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TMO0" -->
                        <field>
                            <name>TMO0</name>
                            <description>2nd digit of the month information</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MO" -->
                        <field>
                            <name>MO</name>
                            <description>1st digit of the month information</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
