itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "WTTR0" -->
                <register>
                    <name>WTTR0</name>
                    <description>Timer Setting Register 0</description>
                    <addressOffset>0x14C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TM7_0" -->
                        <field>
                            <name>TM7_0</name>
                            <description>Timer Setting Register</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTTR1" -->
                <register>
                    <name>WTTR1</name>
                    <description>Timer Setting Register 1</description>
                    <addressOffset>0x150</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TM15_8" -->
                        <field>
                            <name>TM15_8</name>
                            <description>Timer Setting Register</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTTR2" -->
                <register>
                    <name>WTTR2</name>
                    <description>Timer Setting Register 2</description>
                    <addressOffset>0x154</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TM17_16" -->
                        <field>
                            <name>TM17_16</name>
                            <description>Timer Setting Register</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTCAL0" -->
                <register>
                    <name>WTCAL0</name>
                    <description>Frequency Correction Value Setting Register 0</description>
                    <addressOffset>0x158</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WTCAL0" -->
                        <field>
                            <name>WTCAL0</name>
                            <description>Frequency correction value setting bits 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTCAL1" -->
                <register>
                    <name>WTCAL1</name>
                    <description>Frequency Correction Value Setting Register 1</description>
                    <addressOffset>0x15C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WTCAL1" -->
                        <field>
                            <name>WTCAL1</name>
                            <description>Frequency correction value setting bits 1</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTCALEN" -->
                <register>
                    <name>WTCALEN</name>
                    <description>Frequency Correction Enable Register</description>
                    <addressOffset>0x160</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x01</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WTCALEN" -->
                        <field>
                            <name>WTCALEN</name>
                            <description>Frequency correction enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTDIV" -->
                <register>
                    <name>WTDIV</name>
                    <description>Division Ratio Setting Register</description>
                    <addressOffset>0x164</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WTDIV" -->
                        <field>
                            <name>WTDIV</name>
                            <description>Division ration setting bits</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTDIVEN" -->
                <register>
                    <name>WTDIVEN</name>
                    <description>Divider Output Enable Register</description>
                    <addressOffset>0x168</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WTDIVRDY" -->
                        <field>
                            <name>WTDIVRDY</name>
                            <description>Divider state bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "WTDIVEN" -->
                        <field>
                            <name>WTDIVEN</name>
                            <description>Divider enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
