itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "WTCALPRD" -->
                <register>
                    <name>WTCALPRD</name>
                    <description>Frequency Correction Period Setting Register</description>
                    <addressOffset>0x16C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x13</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WTCALPRD" -->
                        <field>
                            <name>WTCALPRD</name>
                            <description>Frequency correction value setting bits</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTCOSEL" -->
                <register>
                    <name>WTCOSEL</name>
                    <description>RTCCO Output Selection Register</description>
                    <addressOffset>0x170</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x01</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WTCOSEL" -->
                        <field>
                            <name>WTCOSEL</name>
                            <description>RTCCO output selection bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "VB_CLKDIV" -->
                <register>
                    <name>VB_CLKDIV</name>
                    <description>VB_CLKDIV Register</description>
                    <addressOffset>0x174</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x07</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DIV" -->
                        <field>
                            <name>DIV</name>
                            <description>Transfer clock set bits</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "WTOSCCNT" -->
                <register>
                    <name>WTOSCCNT</name>
                    <description>WTOSCCNT Register</description>
                    <addressOffset>0x178</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SOSCNTL" -->
                        <field>
                            <name>SOSCNTL</name>
                            <description>Cooperative operation control bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOSCEX" -->
                        <field>
                            <name>SOSCEX</name>
                            <description>Oscillation enable bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CCS" -->
                <register>
                    <name>CCS</name>
                    <description>CCS Register</description>
                    <addressOffset>0x17C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x08</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CCS" -->
                        <field>
                            <name>CCS</name>
                            <description>Oscillation sustain current set bits</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CCB" -->
                <register>
                    <name>CCB</name>
                    <description>CCB Register</description>
                    <addressOffset>0x180</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "CCB" -->
                        <field>
                            <name>CCB</name>
                            <description>Oscillation boost current set bits</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "BOOST" -->
                <register>
                    <name>BOOST</name>
                    <description>BOOST Register</description>
                    <addressOffset>0x188</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BOOST" -->
                        <field>
                            <name>BOOST</name>
                            <description>Oscillation boost time set bits</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EWKUP" -->
                <register>
                    <name>EWKUP</name>
                    <description>EWKUP Register</description>
                    <addressOffset>0x18C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x01</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "WUP0" -->
                        <field>
                            <name>WUP0</name>
                            <description>Wakeup request bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "VDET" -->
                <register>
                    <name>VDET</name>
                    <description>VDET Register</description>
                    <addressOffset>0x190</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0x80</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "PON" -->
                        <field>
                            <name>PON</name>
                            <description>Power-on bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
