itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "BREG01" -->
                <register>
                    <name>BREG01</name>
                    <description>Backup Register</description>
                    <addressOffset>0x201</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG02" -->
                <register>
                    <name>BREG02</name>
                    <description>Backup Register</description>
                    <addressOffset>0x202</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG03" -->
                <register>
                    <name>BREG03</name>
                    <description>Backup Register</description>
                    <addressOffset>0x203</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG04" -->
                <register>
                    <name>BREG04</name>
                    <description>Backup Register</description>
                    <addressOffset>0x204</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG05" -->
                <register>
                    <name>BREG05</name>
                    <description>Backup Register</description>
                    <addressOffset>0x205</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG06" -->
                <register>
                    <name>BREG06</name>
                    <description>Backup Register</description>
                    <addressOffset>0x206</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG07" -->
                <register>
                    <name>BREG07</name>
                    <description>Backup Register</description>
                    <addressOffset>0x207</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG08" -->
                <register>
                    <name>BREG08</name>
                    <description>Backup Register</description>
                    <addressOffset>0x208</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG09" -->
                <register>
                    <name>BREG09</name>
                    <description>Backup Register</description>
                    <addressOffset>0x209</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG0A" -->
                <register>
                    <name>BREG0A</name>
                    <description>Backup Register</description>
                    <addressOffset>0x20A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG0B" -->
                <register>
                    <name>BREG0B</name>
                    <description>Backup Register</description>
                    <addressOffset>0x20B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG0C" -->
                <register>
                    <name>BREG0C</name>
                    <description>Backup Register</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG0D" -->
                <register>
                    <name>BREG0D</name>
                    <description>Backup Register</description>
                    <addressOffset>0x20D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG0E" -->
                <register>
                    <name>BREG0E</name>
                    <description>Backup Register</description>
                    <addressOffset>0x20E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG0F" -->
                <register>
                    <name>BREG0F</name>
                    <description>Backup Register</description>
                    <addressOffset>0x20F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG10" -->
                <register>
                    <name>BREG10</name>
                    <description>Backup Register</description>
                    <addressOffset>0x210</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
