itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "BREG11" -->
                <register>
                    <name>BREG11</name>
                    <description>Backup Register</description>
                    <addressOffset>0x211</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG12" -->
                <register>
                    <name>BREG12</name>
                    <description>Backup Register</description>
                    <addressOffset>0x212</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG13" -->
                <register>
                    <name>BREG13</name>
                    <description>Backup Register</description>
                    <addressOffset>0x213</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG14" -->
                <register>
                    <name>BREG14</name>
                    <description>Backup Register</description>
                    <addressOffset>0x214</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG15" -->
                <register>
                    <name>BREG15</name>
                    <description>Backup Register</description>
                    <addressOffset>0x215</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG16" -->
                <register>
                    <name>BREG16</name>
                    <description>Backup Register</description>
                    <addressOffset>0x216</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG17" -->
                <register>
                    <name>BREG17</name>
                    <description>Backup Register</description>
                    <addressOffset>0x217</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG18" -->
                <register>
                    <name>BREG18</name>
                    <description>Backup Register</description>
                    <addressOffset>0x218</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG19" -->
                <register>
                    <name>BREG19</name>
                    <description>Backup Register</description>
                    <addressOffset>0x219</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG1A" -->
                <register>
                    <name>BREG1A</name>
                    <description>Backup Register</description>
                    <addressOffset>0x21A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG1B" -->
                <register>
                    <name>BREG1B</name>
                    <description>Backup Register</description>
                    <addressOffset>0x21B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG1C" -->
                <register>
                    <name>BREG1C</name>
                    <description>Backup Register</description>
                    <addressOffset>0x21C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG1D" -->
                <register>
                    <name>BREG1D</name>
                    <description>Backup Register</description>
                    <addressOffset>0x21D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG1E" -->
                <register>
                    <name>BREG1E</name>
                    <description>Backup Register</description>
                    <addressOffset>0x21E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG1F" -->
                <register>
                    <name>BREG1F</name>
                    <description>Backup Register</description>
                    <addressOffset>0x21F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
