itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "BREG20" -->
                <register>
                    <name>BREG20</name>
                    <description>Backup Register</description>
                    <addressOffset>0x220</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG21" -->
                <register>
                    <name>BREG21</name>
                    <description>Backup Register</description>
                    <addressOffset>0x221</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG22" -->
                <register>
                    <name>BREG22</name>
                    <description>Backup Register</description>
                    <addressOffset>0x222</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG23" -->
                <register>
                    <name>BREG23</name>
                    <description>Backup Register</description>
                    <addressOffset>0x223</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG24" -->
                <register>
                    <name>BREG24</name>
                    <description>Backup Register</description>
                    <addressOffset>0x224</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG25" -->
                <register>
                    <name>BREG25</name>
                    <description>Backup Register</description>
                    <addressOffset>0x225</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG26" -->
                <register>
                    <name>BREG26</name>
                    <description>Backup Register</description>
                    <addressOffset>0x226</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG27" -->
                <register>
                    <name>BREG27</name>
                    <description>Backup Register</description>
                    <addressOffset>0x227</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG28" -->
                <register>
                    <name>BREG28</name>
                    <description>Backup Register</description>
                    <addressOffset>0x228</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG29" -->
                <register>
                    <name>BREG29</name>
                    <description>Backup Register</description>
                    <addressOffset>0x229</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG2A" -->
                <register>
                    <name>BREG2A</name>
                    <description>Backup Register</description>
                    <addressOffset>0x22A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG2B" -->
                <register>
                    <name>BREG2B</name>
                    <description>Backup Register</description>
                    <addressOffset>0x22B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG2C" -->
                <register>
                    <name>BREG2C</name>
                    <description>Backup Register</description>
                    <addressOffset>0x22C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG2D" -->
                <register>
                    <name>BREG2D</name>
                    <description>Backup Register</description>
                    <addressOffset>0x22D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG2E" -->
                <register>
                    <name>BREG2E</name>
                    <description>Backup Register</description>
                    <addressOffset>0x22E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
