itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "BREG2F" -->
                <register>
                    <name>BREG2F</name>
                    <description>Backup Register</description>
                    <addressOffset>0x22F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG30" -->
                <register>
                    <name>BREG30</name>
                    <description>Backup Register</description>
                    <addressOffset>0x230</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG31" -->
                <register>
                    <name>BREG31</name>
                    <description>Backup Register</description>
                    <addressOffset>0x231</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG32" -->
                <register>
                    <name>BREG32</name>
                    <description>Backup Register</description>
                    <addressOffset>0x232</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG33" -->
                <register>
                    <name>BREG33</name>
                    <description>Backup Register</description>
                    <addressOffset>0x233</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG34" -->
                <register>
                    <name>BREG34</name>
                    <description>Backup Register</description>
                    <addressOffset>0x234</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG35" -->
                <register>
                    <name>BREG35</name>
                    <description>Backup Register</description>
                    <addressOffset>0x235</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG36" -->
                <register>
                    <name>BREG36</name>
                    <description>Backup Register</description>
                    <addressOffset>0x236</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG37" -->
                <register>
                    <name>BREG37</name>
                    <description>Backup Register</description>
                    <addressOffset>0x237</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG38" -->
                <register>
                    <name>BREG38</name>
                    <description>Backup Register</description>
                    <addressOffset>0x238</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG39" -->
                <register>
                    <name>BREG39</name>
                    <description>Backup Register</description>
                    <addressOffset>0x239</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG3A" -->
                <register>
                    <name>BREG3A</name>
                    <description>Backup Register</description>
                    <addressOffset>0x23A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG3B" -->
                <register>
                    <name>BREG3B</name>
                    <description>Backup Register</description>
                    <addressOffset>0x23B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG3C" -->
                <register>
                    <name>BREG3C</name>
                    <description>Backup Register</description>
                    <addressOffset>0x23C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG3D" -->
                <register>
                    <name>BREG3D</name>
                    <description>Backup Register</description>
                    <addressOffset>0x23D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG3E" -->
                <register>
                    <name>BREG3E</name>
                    <description>Backup Register</description>
                    <addressOffset>0x23E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
