itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "BREG3F" -->
                <register>
                    <name>BREG3F</name>
                    <description>Backup Register</description>
                    <addressOffset>0x23F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG40" -->
                <register>
                    <name>BREG40</name>
                    <description>Backup Register</description>
                    <addressOffset>0x240</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG41" -->
                <register>
                    <name>BREG41</name>
                    <description>Backup Register</description>
                    <addressOffset>0x241</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG42" -->
                <register>
                    <name>BREG42</name>
                    <description>Backup Register</description>
                    <addressOffset>0x242</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG43" -->
                <register>
                    <name>BREG43</name>
                    <description>Backup Register</description>
                    <addressOffset>0x243</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG44" -->
                <register>
                    <name>BREG44</name>
                    <description>Backup Register</description>
                    <addressOffset>0x244</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG45" -->
                <register>
                    <name>BREG45</name>
                    <description>Backup Register</description>
                    <addressOffset>0x245</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG46" -->
                <register>
                    <name>BREG46</name>
                    <description>Backup Register</description>
                    <addressOffset>0x246</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG47" -->
                <register>
                    <name>BREG47</name>
                    <description>Backup Register</description>
                    <addressOffset>0x247</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG48" -->
                <register>
                    <name>BREG48</name>
                    <description>Backup Register</description>
                    <addressOffset>0x248</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG49" -->
                <register>
                    <name>BREG49</name>
                    <description>Backup Register</description>
                    <addressOffset>0x249</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG4A" -->
                <register>
                    <name>BREG4A</name>
                    <description>Backup Register</description>
                    <addressOffset>0x24A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG4B" -->
                <register>
                    <name>BREG4B</name>
                    <description>Backup Register</description>
                    <addressOffset>0x24B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG4C" -->
                <register>
                    <name>BREG4C</name>
                    <description>Backup Register</description>
                    <addressOffset>0x24C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG4D" -->
                <register>
                    <name>BREG4D</name>
                    <description>Backup Register</description>
                    <addressOffset>0x24D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
