itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "BREG4E" -->
                <register>
                    <name>BREG4E</name>
                    <description>Backup Register</description>
                    <addressOffset>0x24E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG4F" -->
                <register>
                    <name>BREG4F</name>
                    <description>Backup Register</description>
                    <addressOffset>0x24F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG50" -->
                <register>
                    <name>BREG50</name>
                    <description>Backup Register</description>
                    <addressOffset>0x250</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG51" -->
                <register>
                    <name>BREG51</name>
                    <description>Backup Register</description>
                    <addressOffset>0x251</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG52" -->
                <register>
                    <name>BREG52</name>
                    <description>Backup Register</description>
                    <addressOffset>0x252</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG53" -->
                <register>
                    <name>BREG53</name>
                    <description>Backup Register</description>
                    <addressOffset>0x253</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG54" -->
                <register>
                    <name>BREG54</name>
                    <description>Backup Register</description>
                    <addressOffset>0x254</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG55" -->
                <register>
                    <name>BREG55</name>
                    <description>Backup Register</description>
                    <addressOffset>0x255</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG56" -->
                <register>
                    <name>BREG56</name>
                    <description>Backup Register</description>
                    <addressOffset>0x256</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG57" -->
                <register>
                    <name>BREG57</name>
                    <description>Backup Register</description>
                    <addressOffset>0x257</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG58" -->
                <register>
                    <name>BREG58</name>
                    <description>Backup Register</description>
                    <addressOffset>0x258</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG59" -->
                <register>
                    <name>BREG59</name>
                    <description>Backup Register</description>
                    <addressOffset>0x259</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG5A" -->
                <register>
                    <name>BREG5A</name>
                    <description>Backup Register</description>
                    <addressOffset>0x25A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG5B" -->
                <register>
                    <name>BREG5B</name>
                    <description>Backup Register</description>
                    <addressOffset>0x25B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG5C" -->
                <register>
                    <name>BREG5C</name>
                    <description>Backup Register</description>
                    <addressOffset>0x25C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG5D" -->
                <register>
                    <name>BREG5D</name>
                    <description>Backup Register</description>
                    <addressOffset>0x25D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
