itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "BREG5E" -->
                <register>
                    <name>BREG5E</name>
                    <description>Backup Register</description>
                    <addressOffset>0x25E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG5F" -->
                <register>
                    <name>BREG5F</name>
                    <description>Backup Register</description>
                    <addressOffset>0x25F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG60" -->
                <register>
                    <name>BREG60</name>
                    <description>Backup Register</description>
                    <addressOffset>0x260</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG61" -->
                <register>
                    <name>BREG61</name>
                    <description>Backup Register</description>
                    <addressOffset>0x261</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG62" -->
                <register>
                    <name>BREG62</name>
                    <description>Backup Register</description>
                    <addressOffset>0x262</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG63" -->
                <register>
                    <name>BREG63</name>
                    <description>Backup Register</description>
                    <addressOffset>0x263</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG64" -->
                <register>
                    <name>BREG64</name>
                    <description>Backup Register</description>
                    <addressOffset>0x264</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG65" -->
                <register>
                    <name>BREG65</name>
                    <description>Backup Register</description>
                    <addressOffset>0x265</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG66" -->
                <register>
                    <name>BREG66</name>
                    <description>Backup Register</description>
                    <addressOffset>0x266</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG67" -->
                <register>
                    <name>BREG67</name>
                    <description>Backup Register</description>
                    <addressOffset>0x267</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG68" -->
                <register>
                    <name>BREG68</name>
                    <description>Backup Register</description>
                    <addressOffset>0x268</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG69" -->
                <register>
                    <name>BREG69</name>
                    <description>Backup Register</description>
                    <addressOffset>0x269</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG6A" -->
                <register>
                    <name>BREG6A</name>
                    <description>Backup Register</description>
                    <addressOffset>0x26A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG6B" -->
                <register>
                    <name>BREG6B</name>
                    <description>Backup Register</description>
                    <addressOffset>0x26B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
