itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "BREG7C" -->
                <register>
                    <name>BREG7C</name>
                    <description>Backup Register</description>
                    <addressOffset>0x27C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG7D" -->
                <register>
                    <name>BREG7D</name>
                    <description>Backup Register</description>
                    <addressOffset>0x27D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG7E" -->
                <register>
                    <name>BREG7E</name>
                    <description>Backup Register</description>
                    <addressOffset>0x27E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "BREG7F" -->
                <register>
                    <name>BREG7F</name>
                    <description>Backup Register</description>
                    <addressOffset>0x27F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "LCR" -->
        <peripheral>
            <name>LCR</name>
            <description>Low-speed CR Prescaler</description>
            <groupName>LCR</groupName>
            <baseAddress>0x4003C000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "LCR_PRSLD" -->
                <register>
                    <name>LCR_PRSLD</name>
                    <description>Low-speed CR Prescaler Control Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "LCR_PRSLD" -->
                        <field>
                            <name>LCR_PRSLD</name>
                            <description>Low-speed CR Prescaler Load</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "CLK_GATING" -->
        <peripheral>
            <name>CLK_GATING</name>
            <description>Peripheral Clock Gating</description>
            <groupName>CLK_GATING</groupName>
            <baseAddress>0x4003C100</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x28</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "CKEN0" -->
                <register>
                    <name>CKEN0</name>
                    <description>Peripheral Function Clock Control Register 0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x150FFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "GIOCK" -->
                        <field>
                            <name>GIOCK</name>
                            <description>Settings for operation clock supplying and gating to GPIO
                                function</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EXBCK" -->
                        <field>
                            <name>EXBCK</name>
                            <description>Settings for operation clock supplying and gating of
                                external bus interface function</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DMACK" -->
                        <field>
                            <name>DMACK</name>
                            <description>Supplying and gating settings of DMAC operation clock</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ADCCK3" -->
                        <field>
                            <name>ADCCK3</name>
                            <description>Settings for operation clock supplying and gating to A/D
                                converter unit 3</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ADCCK2" -->
                        <field>
                            <name>ADCCK2</name>
                            <description>Settings for operation clock supplying and gating to A/D
                                converter unit 2</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ADCCK1" -->
                        <field>
                            <name>ADCCK1</name>
                            <description>Settings for operation clock supplying and gating to A/D
                                converter unit 1</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ADCCK0" -->
                        <field>
                            <name>ADCCK0</name>
                            <description>Settings for operation clock supplying and gating to A/D
                                converter unit 0</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK15" -->
                        <field>
                            <name>MFSCK15</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.15</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK14" -->
                        <field>
                            <name>MFSCK14</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.14</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK13" -->
                        <field>
                            <name>MFSCK13</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.13</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK12" -->
                        <field>
                            <name>MFSCK12</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.12</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK11" -->
                        <field>
                            <name>MFSCK11</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.11</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK10" -->
                        <field>
                            <name>MFSCK10</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.10</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK9" -->
                        <field>
                            <name>MFSCK9</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.9</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK8" -->
                        <field>
                            <name>MFSCK8</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.8</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK7" -->
                        <field>
                            <name>MFSCK7</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.7</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK6" -->
                        <field>
                            <name>MFSCK6</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.6</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK5" -->
                        <field>
                            <name>MFSCK5</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.5</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK4" -->
                        <field>
                            <name>MFSCK4</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.4</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK3" -->
                        <field>
                            <name>MFSCK3</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.3</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK2" -->
                        <field>
                            <name>MFSCK2</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.2</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK1" -->
                        <field>
                            <name>MFSCK1</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSCK0" -->
                        <field>
                            <name>MFSCK0</name>
                            <description>Settings for operation clock supply and gating to
                                multi-function serial interface ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
