itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "MRST0" -->
                <register>
                    <name>MRST0</name>
                    <description>Peripheral Function Reset Control Register 0</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EXBRST" -->
                        <field>
                            <name>EXBRST</name>
                            <description>Reset control for external bus interface</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DMARST" -->
                        <field>
                            <name>DMARST</name>
                            <description>Reset control of DMAC</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ADCRST3" -->
                        <field>
                            <name>ADCRST3</name>
                            <description>Reset control of A/D converter unit 3</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ADCRST2" -->
                        <field>
                            <name>ADCRST2</name>
                            <description>Reset control of A/D converter unit 2</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ADCRST1" -->
                        <field>
                            <name>ADCRST1</name>
                            <description>Reset control of A/D converter unit 1</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ADCRST0" -->
                        <field>
                            <name>ADCRST0</name>
                            <description>Reset control of A/D converter unit 0</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST15" -->
                        <field>
                            <name>MFSRST15</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.15</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST14" -->
                        <field>
                            <name>MFSRST14</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.14</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST13" -->
                        <field>
                            <name>MFSRST13</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.13</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST12" -->
                        <field>
                            <name>MFSRST12</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.12</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST11" -->
                        <field>
                            <name>MFSRST11</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.11</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST10" -->
                        <field>
                            <name>MFSRST10</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.10</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST9" -->
                        <field>
                            <name>MFSRST9</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.9</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST8" -->
                        <field>
                            <name>MFSRST8</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.8</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST7" -->
                        <field>
                            <name>MFSRST7</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.7</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST6" -->
                        <field>
                            <name>MFSRST6</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.6</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST5" -->
                        <field>
                            <name>MFSRST5</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.5</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST4" -->
                        <field>
                            <name>MFSRST4</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.4</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST3" -->
                        <field>
                            <name>MFSRST3</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.3</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST2" -->
                        <field>
                            <name>MFSRST2</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.2</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST1" -->
                        <field>
                            <name>MFSRST1</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFSRST0" -->
                        <field>
                            <name>MFSRST0</name>
                            <description>Control of software reset of multi-function serial
                                interface ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
