itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "CKEN1" -->
                <register>
                    <name>CKEN1</name>
                    <description>Peripheral Function Clock Control Register 1</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x000F0F0F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "QDUCK3" -->
                        <field>
                            <name>QDUCK3</name>
                            <description>Reset control of quad counter unit 3</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QDUCK2" -->
                        <field>
                            <name>QDUCK2</name>
                            <description>Reset control of quad counter unit 2</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QDUCK1" -->
                        <field>
                            <name>QDUCK1</name>
                            <description>Reset control of quad counter unit 1</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QDUCK0" -->
                        <field>
                            <name>QDUCK0</name>
                            <description>Reset control of quad counter unit 0</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFTCK3" -->
                        <field>
                            <name>MFTCK3</name>
                            <description>Settings for operation clock supply and gating of
                                multi-function timer 3 and PPG 24/26/28/30</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFTCK2" -->
                        <field>
                            <name>MFTCK2</name>
                            <description>Settings for operation clock supply and gating of
                                multi-function timer 2 and PPG 16/18/20/22</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFTCK1" -->
                        <field>
                            <name>MFTCK1</name>
                            <description>Settings for operation clock supply and gating of
                                multi-function timer 1 and PPG 8/10/12/14</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFTCK0" -->
                        <field>
                            <name>MFTCK0</name>
                            <description>Settings for operation clock supply and gating of
                                multi-function timer 0 and PPG 0/2/4/6</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BTMCK3" -->
                        <field>
                            <name>BTMCK3</name>
                            <description>Settings operation clock supply and gating to base timer
                                12/13/14/15</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BTMCK2" -->
                        <field>
                            <name>BTMCK2</name>
                            <description>Settings operation clock supply and gating to base timer
                                8/9/10/11</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BTMCK1" -->
                        <field>
                            <name>BTMCK1</name>
                            <description>Settings operation clock supply and gating to base timer
                                4/5/6/7</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BTMCK0" -->
                        <field>
                            <name>BTMCK0</name>
                            <description>Settings operation clock supply and gating to base timer
                                0/1/2/3</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "MRST1" -->
                <register>
                    <name>MRST1</name>
                    <description>Peripheral Function Reset Control Register 1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "QDURST3" -->
                        <field>
                            <name>QDURST3</name>
                            <description>Reset control of quad counter unit 3</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QDURST2" -->
                        <field>
                            <name>QDURST2</name>
                            <description>Reset control of quad counter unit 2</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QDURST1" -->
                        <field>
                            <name>QDURST1</name>
                            <description>Reset control of quad counter unit 1</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "QDURST0" -->
                        <field>
                            <name>QDURST0</name>
                            <description>Reset control of quad counter unit 0</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFTRST3" -->
                        <field>
                            <name>MFTRST3</name>
                            <description>Control of multi-function timer 3 and PPG 24/26/28/30 reset
                                control</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFTRST2" -->
                        <field>
                            <name>MFTRST2</name>
                            <description>Control of multi-function timer 2 and PPG 16/18/20/22 reset
                                control</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFTRST1" -->
                        <field>
                            <name>MFTRST1</name>
                            <description>Control of multi-function timer 1 and PPG 8/10/12/14 reset
                                control</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "MFTRST0" -->
                        <field>
                            <name>MFTRST0</name>
                            <description>Control of multi-function timer 0 and PPG 0/2/4/6 reset
                                control</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BTMRST3" -->
                        <field>
                            <name>BTMRST3</name>
                            <description>Reset control of base timer 12/13/14/15</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BTMRST2" -->
                        <field>
                            <name>BTMRST2</name>
                            <description>Reset control of base timer 8/9/10/11</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BTMRST1" -->
                        <field>
                            <name>BTMRST1</name>
                            <description>Reset control of base timer 4/5/6/7</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BTMRST0" -->
                        <field>
                            <name>BTMRST0</name>
                            <description>Reset control of base timer 0/1/2/3</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CKEN2" -->
                <register>
                    <name>CKEN2</name>
                    <description>Peripheral Function Clock Control Register 2</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x00000030</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SDCCK" -->
                        <field>
                            <name>SDCCK</name>
                            <description>Settings for operation clock supply and gating to SD card
                                interface</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CANCK1" -->
                        <field>
                            <name>CANCK1</name>
                            <description>Settings for operation clock supply and gating to SD card
                                interface</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CANCK0" -->
                        <field>
                            <name>CANCK0</name>
                            <description>Settings for operation clock supply and gating to SD card
                                interface</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "USBCK1" -->
                        <field>
                            <name>USBCK1</name>
                            <description>Settings for operation clock supply and gating to SD card
                                interface</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "USBCK0" -->
                        <field>
                            <name>USBCK0</name>
                            <description>$</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "MRST2" -->
                <register>
                    <name>MRST2</name>
                    <description>Peripheral Function Reset Control Register 2</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SDCRST" -->
                        <field>
                            <name>SDCRST</name>
                            <description>Reset control of SD card interface</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CANRST1" -->
                        <field>
                            <name>CANRST1</name>
                            <description>Reset control of SD card interface</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CANRST0" -->
                        <field>
                            <name>CANRST0</name>
                            <description>Reset control of SD card interface</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "USBRST1" -->
                        <field>
                            <name>USBRST1</name>
                            <description>Reset control of USB (function/host) ch.1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "USBRST0" -->
                        <field>
                            <name>USBRST0</name>
                            <description>Reset control of USB (function/host) ch.0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
