itzandroidtab/klib-svd/mb9bf566k.svd
            </registers>
        </peripheral>
        <!-- PERIPHERAL "PLL_CONTROL" -->
        <peripheral>
            <name>PLL_CONTROL</name>
            <description>Main PLL Control</description>
            <groupName>PLL_CONTROL</groupName>
            <baseAddress>0x4003C800</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x8</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "SSCTL1" -->
                <register>
                    <name>SSCTL1</name>
                    <description>SSCTL1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000031</resetMask>
                </register>
                <!-- REGISTER "SSCTL2" -->
                <register>
                    <name>SSCTL2</name>
                    <description>SSCTL2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003FF</resetMask>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "USBCLK" -->
        <peripheral>
            <name>USBCLK</name>
            <description>USB/Ethernet Clock</description>
            <groupName>USBCLK</groupName>
            <baseAddress>0x40036000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x24</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x34</offset>
                <size>0x1</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "UCCR" -->
                <register>
                    <name>UCCR</name>
                    <description>USB Clock Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x0B</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "UCEN1" -->
                        <field>
                            <name>UCEN1</name>
                            <description>USB1 clock output enable bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "UCSEL" -->
                        <field>
                            <name>UCSEL</name>
                            <description>USB clock selection bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "UCEN0" -->
                        <field>
                            <name>UCEN0</name>
                            <description>USB0 clock output enable bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "UPCR1" -->
                <register>
                    <name>UPCR1</name>
                    <description>USB-PLL Control Register 1</description>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "UPINC" -->
                        <field>
                            <name>UPINC</name>
                            <description>USB-PLL input clock selection bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "UPLLEN" -->
                        <field>
                            <name>UPLLEN</name>
                            <description>USB-PLL oscillation enable bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
