itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "EP2C" -->
                <register>
                    <name>EP2C</name>
                    <description>EP2 Control Register</description>
                    <addressOffset>0x212C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x6040</resetValue>
                    <resetMask>0xFE7F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EPEN" -->
                        <field>
                            <name>EPEN</name>
                            <description>Endpoint Enable bit</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TYPE" -->
                        <field>
                            <name>TYPE</name>
                            <description>Endpoint Transfer Type Select bits</description>
                            <lsb>13</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DIR" -->
                        <field>
                            <name>DIR</name>
                            <description>Endpoint Transfer Direction Select bit </description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DMAE" -->
                        <field>
                            <name>DMAE</name>
                            <description>DMA Automatic Transfer Enable bit</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "NULE" -->
                        <field>
                            <name>NULE</name>
                            <description>Null Automatic Transfer Enable bit</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STAL" -->
                        <field>
                            <name>STAL</name>
                            <description>Endpoint Stall Setting bit </description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PKS" -->
                        <field>
                            <name>PKS</name>
                            <description>Packet Size Setting bits</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EP3C" -->
                <register derivedFrom="EP2C">
                    <name>EP3C</name>
                    <description>EP3 Control Register</description>
                    <addressOffset>0x2130</addressOffset>
                </register>
                <!-- REGISTER "EP4C" -->
                <register derivedFrom="EP2C">
                    <name>EP4C</name>
                    <description>EP4 Control Register</description>
                    <addressOffset>0x2134</addressOffset>
                </register>
                <!-- REGISTER "EP5C" -->
                <register derivedFrom="EP2C">
                    <name>EP5C</name>
                    <description>EP5 Control Register</description>
                    <addressOffset>0x2138</addressOffset>
                </register>
                <!-- REGISTER "TMSP" -->
                <register>
                    <name>TMSP</name>
                    <description>Time Stamp Register</description>
                    <addressOffset>0x213C</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x07FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TMSP" -->
                        <field>
                            <name>TMSP</name>
                            <description>Time Stamp bits</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "UDCS" -->
                <register>
                    <name>UDCS</name>
                    <description>UDC Status Register</description>
                    <addressOffset>0x2140</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SUSP" -->
                        <field>
                            <name>SUSP</name>
                            <description>Suspend detection bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOF" -->
                        <field>
                            <name>SOF</name>
                            <description>SOF Detection bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BRST" -->
                        <field>
                            <name>BRST</name>
                            <description>Bus Reset Detection bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "WKUP" -->
                        <field>
                            <name>WKUP</name>
                            <description>Wake-up Detection bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SETP" -->
                        <field>
                            <name>SETP</name>
                            <description>Setup Stage Detection bit </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CONF" -->
                        <field>
                            <name>CONF</name>
                            <description>Configuration Detection bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
