itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "EP0DT" -->
                <register>
                    <name>EP0DT</name>
                    <description>EP0 Data Register</description>
                    <addressOffset>0x2160</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BFDT" -->
                        <field>
                            <name>BFDT</name>
                            <description>Endpoint Send/Receive Buffer Data</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "EP1DT" -->
                <register derivedFrom="EP0DT">
                    <name>EP1DT</name>
                    <description>EP1 Data Register</description>
                    <addressOffset>0x2164</addressOffset>
                </register>
                <!-- REGISTER "EP2DT" -->
                <register derivedFrom="EP0DT">
                    <name>EP2DT</name>
                    <description>EP2 Data Register</description>
                    <addressOffset>0x2168</addressOffset>
                </register>
                <!-- REGISTER "EP3DT" -->
                <register derivedFrom="EP0DT">
                    <name>EP3DT</name>
                    <description>EP3 Data Register</description>
                    <addressOffset>0x216C</addressOffset>
                </register>
                <!-- REGISTER "EP4DT" -->
                <register derivedFrom="EP0DT">
                    <name>EP4DT</name>
                    <description>EP4 Data Register</description>
                    <addressOffset>0x2170</addressOffset>
                </register>
                <!-- REGISTER "EP5DT" -->
                <register derivedFrom="EP0DT">
                    <name>EP5DT</name>
                    <description>EP5 Data Register</description>
                    <addressOffset>0x2174</addressOffset>
                </register>
                <!-- REGISTER "HCNT" -->
                <register>
                    <name>HCNT</name>
                    <description>Host Control Register</description>
                    <addressOffset>0x2100</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0100</resetValue>
                    <resetMask>0x07FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SOFSTEP" -->
                        <field>
                            <name>SOFSTEP</name>
                            <description>SOF interrupt occurrence selection bit</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CANCEL" -->
                        <field>
                            <name>CANCEL</name>
                            <description>token cancellation enable bit</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RETRY" -->
                        <field>
                            <name>RETRY</name>
                            <description>retry enable bit</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RWKIRE" -->
                        <field>
                            <name>RWKIRE</name>
                            <description>resume interrupt enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "URIRE" -->
                        <field>
                            <name>URIRE</name>
                            <description>bus reset interrupt enable bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CMPIRE" -->
                        <field>
                            <name>CMPIRE</name>
                            <description>token completion interrupt enable bit</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CNNIRE" -->
                        <field>
                            <name>CNNIRE</name>
                            <description>device connection detection interrupt enable bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DIRE" -->
                        <field>
                            <name>DIRE</name>
                            <description>device disconnection detection interrupt enable bit</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOFIRE" -->
                        <field>
                            <name>SOFIRE</name>
                            <description>SOF interrupt enable bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "URST" -->
                        <field>
                            <name>URST</name>
                            <description>bus reset bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "HOST" -->
                        <field>
                            <name>HOST</name>
                            <description>host mode bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "HIRQ" -->
                <register>
                    <name>HIRQ</name>
                    <description>Host Interrupt Register</description>
                    <addressOffset>0x2104</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xBF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TCAN" -->
                        <field>
                            <name>TCAN</name>
                            <description>token cancellation flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RWKIRQ" -->
                        <field>
                            <name>RWKIRQ</name>
                            <description>remote Wake-up end flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "URIRQ" -->
                        <field>
                            <name>URIRQ</name>
                            <description>bus reset end flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CMPIRQ" -->
                        <field>
                            <name>CMPIRQ</name>
                            <description>token completion flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CNNIRQ" -->
                        <field>
                            <name>CNNIRQ</name>
                            <description>device connection detection flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DIRQ" -->
                        <field>
                            <name>DIRQ</name>
                            <description>device disconnection detection flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOFIRQ" -->
                        <field>
                            <name>SOFIRQ</name>
                            <description>SOF starting flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "HERR" -->
                <register>
                    <name>HERR</name>
                    <description>Host Error Status Register</description>
                    <addressOffset>0x2105</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "LSTSOF" -->
                        <field>
                            <name>LSTSOF</name>
                            <description>lost SOF flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RERR" -->
                        <field>
                            <name>RERR</name>
                            <description>receive error flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TOUT" -->
                        <field>
                            <name>TOUT</name>
                            <description>timeout flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CRC" -->
                        <field>
                            <name>CRC</name>
                            <description>CRC error flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TGERR" -->
                        <field>
                            <name>TGERR</name>
                            <description>toggle error flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "STUFF" -->
                        <field>
                            <name>STUFF</name>
                            <description>stuffing error flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "HS" -->
                        <field>
                            <name>HS</name>
                            <description>handshake status flags</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "HSTATE" -->
                <register>
                    <name>HSTATE</name>
                    <description>Host Status Register</description>
                    <addressOffset>0x2108</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x12</resetValue>
                    <resetMask>0x3F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ALIVE" -->
                        <field>
                            <name>ALIVE</name>
                            <description>specify the keep-alive function in the low-speed mode</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CLKSEL" -->
                        <field>
                            <name>CLKSEL</name>
                            <description>USB operation clock selection bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SOFBUSY" -->
                        <field>
                            <name>SOFBUSY</name>
                            <description>SOF busy flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SUSP" -->
                        <field>
                            <name>SUSP</name>
                            <description>suspend setting bit</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TMODE" -->
                        <field>
                            <name>TMODE</name>
                            <description>transmission mode flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "CSTAT" -->
                        <field>
                            <name>CSTAT</name>
                            <description>connection status flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "HFCOMP" -->
                <register>
                    <name>HFCOMP</name>
                    <description>SOF Interrupt Frame Compare Register</description>
                    <addressOffset>0x2109</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FRAMECOMP" -->
                        <field>
                            <name>FRAMECOMP</name>
                            <description>frame compare data</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "HRTIMER" -->
                <register>
                    <name>HRTIMER</name>
                    <description>Retry Timer Setup Register</description>
                    <addressOffset>0x210C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RTIMER1" -->
                        <field>
                            <name>RTIMER1</name>
                            <description>retry timer setting 1</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RTIMER0" -->
                        <field>
                            <name>RTIMER0</name>
                            <description>retry timer setting 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "HRTIMER2" -->
                <register>
                    <name>HRTIMER2</name>
                    <description>Retry Timer Setup Register 2</description>
                    <addressOffset>0x2110</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x03</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RTIMER2" -->
                        <field>
                            <name>RTIMER2</name>
                            <description>retry timer setting 2</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "HADR" -->
                <register>
                    <name>HADR</name>
                    <description>Host Address Register</description>
                    <addressOffset>0x2111</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x7F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "ADDRESS" -->
                        <field>
                            <name>ADDRESS</name>
                            <description>Host Address</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
