itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "HEOF" -->
                <register>
                    <name>HEOF</name>
                    <description>EOF Setup Register</description>
                    <addressOffset>0x2114</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x3FFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EOF1" -->
                        <field>
                            <name>EOF1</name>
                            <description>End Frame 1</description>
                            <lsb>8</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EOF0" -->
                        <field>
                            <name>EOF0</name>
                            <description>End Frame 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "HFRAME" -->
                <register>
                    <name>HFRAME</name>
                    <description>Frame Setup Register</description>
                    <addressOffset>0x2118</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x07FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "FRAME1" -->
                        <field>
                            <name>FRAME1</name>
                            <description>Frame Setup 1</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FRAME0" -->
                        <field>
                            <name>FRAME0</name>
                            <description>Frame Setup 0</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "HTOKEN" -->
                <register>
                    <name>HTOKEN</name>
                    <description>Host Token Endpoint Register</description>
                    <addressOffset>0x211C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TGGL" -->
                        <field>
                            <name>TGGL</name>
                            <description>toggle bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TKNEN" -->
                        <field>
                            <name>TKNEN</name>
                            <description>token enable bits</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ENDPT" -->
                        <field>
                            <name>ENDPT</name>
                            <description>endpoint bits</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <!-- PERIPHERAL "DMAC" -->
        <peripheral>
            <name>DMAC</name>
            <description>DMAC Registers</description>
            <groupName>DMAC</groupName>
            <baseAddress>0x40060000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0x80</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "DMAC0" -->
            <interrupt>
                <name>DMAC0</name>
                <value>83</value>
            </interrupt>
            <!-- INTERRUPT "DMAC1" -->
            <interrupt>
                <name>DMAC1</name>
                <value>84</value>
            </interrupt>
            <!-- INTERRUPT "DMAC2" -->
            <interrupt>
                <name>DMAC2</name>
                <value>85</value>
            </interrupt>
            <!-- INTERRUPT "DMAC3" -->
            <interrupt>
                <name>DMAC3</name>
                <value>86</value>
            </interrupt>
            <!-- INTERRUPT "DMAC4" -->
            <interrupt>
                <name>DMAC4</name>
                <value>87</value>
            </interrupt>
            <!-- INTERRUPT "DMAC5" -->
            <interrupt>
                <name>DMAC5</name>
                <value>88</value>
            </interrupt>
            <!-- INTERRUPT "DMAC6" -->
            <interrupt>
                <name>DMAC6</name>
                <value>89</value>
            </interrupt>
            <!-- INTERRUPT "DMAC7" -->
            <interrupt>
                <name>DMAC7</name>
                <value>90</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "DMACR" -->
                <register>
                    <name>DMACR</name>
                    <description>Entire DMAC Configuration Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xDF000000</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DE" -->
                        <field>
                            <name>DE</name>
                            <description>DMA Enable (all-channel operation enable bit) </description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DS" -->
                        <field>
                            <name>DS</name>
                            <description>DMA Stop</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PR" -->
                        <field>
                            <name>PR</name>
                            <description>Priority Rotation</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DH" -->
                        <field>
                            <name>DH</name>
                            <description>DMA Halt (All-channel pause bit) </description>
                            <lsb>24</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "DMACA0" -->
                <register>
                    <name>DMACA0</name>
                    <description>Configuration A Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFF9FFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EB" -->
                        <field>
                            <name>EB</name>
                            <description>Enable bit (individual-channel operation enable bit)</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "PB" -->
                        <field>
                            <name>PB</name>
                            <description>Pause bit (individual-channel pause bit) </description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ST" -->
                        <field>
                            <name>ST</name>
                            <description>Software Trigger</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IS" -->
                        <field>
                            <name>IS</name>
                            <description>Input Select </description>
                            <lsb>23</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BC" -->
                        <field>
                            <name>BC</name>
                            <description>Block Count </description>
                            <lsb>16</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TC" -->
                        <field>
                            <name>TC</name>
                            <description>Transfer Count</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "DMACB0" -->
                <register>
                    <name>DMACB0</name>
                    <description>Configuration B Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x3FFF0001</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MS" -->
                        <field>
                            <name>MS</name>
                            <description>Mode Select</description>
                            <lsb>28</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TW" -->
                        <field>
                            <name>TW</name>
                            <description>Transfer Width </description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FS" -->
                        <field>
                            <name>FS</name>
                            <description>Fixed Source </description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "FD" -->
                        <field>
                            <name>FD</name>
                            <description>Fixed Destination</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RC" -->
                        <field>
                            <name>RC</name>
                            <description>Reload Count (BC/TC reload)</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RS" -->
                        <field>
                            <name>RS</name>
                            <description>Reload Source</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RD" -->
                        <field>
                            <name>RD</name>
                            <description>Reload Destination</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EI" -->
                        <field>
                            <name>EI</name>
                            <description>Error Interrupt (unsuccessful transfer completion interrupt
                                enable)</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CI" -->
                        <field>
                            <name>CI</name>
                            <description>Completion Interrupt (successful transfer completion
                                interrupt enable)</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SS" -->
                        <field>
                            <name>SS</name>
                            <description>Stop Status (stop status notification)</description>
                            <lsb>16</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EM" -->
                        <field>
                            <name>EM</name>
                            <description>Enable bit Mask (EB bit clear mask)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "DMACSA0" -->
                <register>
                    <name>DMACSA0</name>
                    <description>Transfer Source Address Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!-- REGISTER "DMACDA0" -->
                <register>
                    <name>DMACDA0</name>
                    <description>Transfer Destination Address Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!-- REGISTER "DMACA1" -->
                <register derivedFrom="DMACA0">
                    <name>DMACA1</name>
                    <description>Configuration A Register 1</description>
                    <addressOffset>0x20</addressOffset>
                </register>
                <!-- REGISTER "DMACB1" -->
                <register derivedFrom="DMACB0">
                    <name>DMACB1</name>
                    <description>Configuration B Register 1</description>
                    <addressOffset>0x24</addressOffset>
                </register>
                <!-- REGISTER "DMACSA1" -->
                <register derivedFrom="DMACSA0">
                    <name>DMACSA1</name>
                    <description>Transfer Source Address Register 1</description>
                    <addressOffset>0x28</addressOffset>
                </register>
