itzandroidtab/klib-svd/mb9bf566k.svd
            </registers>
        </peripheral>
        <!-- PERIPHERAL "DSTC" -->
        <peripheral>
            <name>DSTC</name>
            <description>DSTC registers</description>
            <groupName>DSTC</groupName>
            <baseAddress>0x40061000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0xB0</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "DSTC" -->
            <interrupt>
                <name>DSTC</name>
                <value>91</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "DESTP" -->
                <register>
                    <name>DESTP</name>
                    <description>Descriptor top address Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <!-- REGISTER "HWDESP" -->
                <register>
                    <name>HWDESP</name>
                    <description>Hardware DES pointer Register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x3FFF00FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "HWDESP" -->
                        <field>
                            <name>HWDESP</name>
                            <description>HWDESP</description>
                            <lsb>16</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CHANNEL" -->
                        <field>
                            <name>CHANNEL</name>
                            <description>CHANNEL</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "CMD" -->
                <register>
                    <name>CMD</name>
                    <description>Command Register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <!-- REGISTER "CFG" -->
                <register>
                    <name>CFG</name>
                    <description>Configuration Register</description>
                    <addressOffset>0x9</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x40</resetValue>
                    <resetMask>0x7F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SWPR" -->
                        <field>
                            <name>SWPR</name>
                            <description>Software transfer priority</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ESTE" -->
                        <field>
                            <name>ESTE</name>
                            <description>Error stop enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "RBDIS" -->
                        <field>
                            <name>RBDIS</name>
                            <description>Read skip buffer disable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ERINTE" -->
                        <field>
                            <name>ERINTE</name>
                            <description>Error interrupt enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SWINTE" -->
                        <field>
                            <name>SWINTE</name>
                            <description>Software interrupt enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "SWTR" -->
                <register>
                    <name>SWTR</name>
                    <description>Software trigger Register</description>
                    <addressOffset>0xA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "SWST" -->
                        <field>
                            <name>SWST</name>
                            <description>Software status</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "SWREQ" -->
                        <field>
                            <name>SWREQ</name>
                            <description>Software request</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "SWDESP" -->
                        <field>
                            <name>SWDESP</name>
                            <description>Software DES pointer</description>
                            <lsb>0</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "MONERS" -->
                <register>
                    <name>MONERS</name>
                    <description>MONERS Register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x3FFFFF5F</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "EDESP" -->
                        <field>
                            <name>EDESP</name>
                            <description>Error DES pointer</description>
                            <lsb>16</lsb>
                            <msb>29</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ECH" -->
                        <field>
                            <name>ECH</name>
                            <description>Error hardware channel</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EHS" -->
                        <field>
                            <name>EHS</name>
                            <description>Error hardware software</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "ESTOP" -->
                        <field>
                            <name>ESTOP</name>
                            <description>Error stop</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "DER" -->
                        <field>
                            <name>DER</name>
                            <description>Double error</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EST" -->
                        <field>
                            <name>EST</name>
                            <description>Error status</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
