itzandroidtab/klib-svd/mb9bf566k.svd
            </registers>
        </peripheral>
        <!-- PERIPHERAL "CAN0" -->
        <peripheral>
            <name>CAN0</name>
            <description>CAN0 Registers</description>
            <groupName>CAN0</groupName>
            <baseAddress>0x40062000</baseAddress>
            <!-- ADDRESS BLOCK -->
            <addressBlock>
                <offset>0x0</offset>
                <size>0xE</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>0xE</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>0x8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30</offset>
                <size>0x8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>0xE</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x50</offset>
                <size>0x8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x60</offset>
                <size>0x8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x80</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x90</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA0</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB0</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <!-- INTERRUPT "CAN0" -->
            <interrupt>
                <name>CAN0</name>
                <value>80</value>
            </interrupt>
            <!-- REGISTERS -->
            <registers>
                <!-- REGISTER "CTRLR" -->
                <register>
                    <name>CTRLR</name>
                    <description>CAN Control Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0001</resetValue>
                    <resetMask>0x00EF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TEST" -->
                        <field>
                            <name>TEST</name>
                            <description>Test mode enable bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "CCE" -->
                        <field>
                            <name>CCE</name>
                            <description>Bit Timing Register write enable bit</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DAR" -->
                        <field>
                            <name>DAR</name>
                            <description> Automatic retransmission disable bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "EIE" -->
                        <field>
                            <name>EIE</name>
                            <description>Error interrupt code enable bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SIE" -->
                        <field>
                            <name>SIE</name>
                            <description>Status interrupt code enable bit </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "IE" -->
                        <field>
                            <name>IE</name>
                            <description>Interrupt enable bit</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "INIT" -->
                        <field>
                            <name>INIT</name>
                            <description>Initialization bit </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "STATR" -->
                <register>
                    <name>STATR</name>
                    <description>CAN Status Register</description>
                    <addressOffset>0x2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x00FF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "BOFF" -->
                        <field>
                            <name>BOFF</name>
                            <description>Busoff bit </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EWARN" -->
                        <field>
                            <name>EWARN</name>
                            <description>Warning bit </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "EPASS" -->
                        <field>
                            <name>EPASS</name>
                            <description>Error passive bit </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "RXOK" -->
                        <field>
                            <name>RXOK</name>
                            <description>Successful message reception bit</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TXOK" -->
                        <field>
                            <name>TXOK</name>
                            <description>Successful message transmission bit </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "LEC" -->
                        <field>
                            <name>LEC</name>
                            <description>Last error code bits </description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "ERRCNT" -->
                <register>
                    <name>ERRCNT</name>
                    <description>CAN Error Counter</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "RP" -->
                        <field>
                            <name>RP</name>
                            <description>Receive error passive indication </description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "REC" -->
                        <field>
                            <name>REC</name>
                            <description>Receive error counter </description>
                            <lsb>8</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TEC" -->
                        <field>
                            <name>TEC</name>
                            <description>Send error counter </description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "BTR" -->
                <register>
                    <name>BTR</name>
                    <description>CAN Bit Timing Register</description>
                    <addressOffset>0x6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x2301</resetValue>
                    <resetMask>0x7FFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TSEG2" -->
                        <field>
                            <name>TSEG2</name>
                            <description>Time segment 2 setting bits </description>
                            <lsb>12</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "TSEG1" -->
                        <field>
                            <name>TSEG1</name>
                            <description>Time segment 1 setting bits </description>
                            <lsb>8</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "SJW" -->
                        <field>
                            <name>SJW</name>
                            <description>Resynchronization jump width setting bits</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "BRP" -->
                        <field>
                            <name>BRP</name>
                            <description>Baud rate prescaler setting bits</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
