itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IF1ARB2" -->
                <register>
                    <name>IF1ARB2</name>
                    <description>IF1 Arbitration Registers 2</description>
                    <addressOffset>0x1A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MSGVAL" -->
                        <field>
                            <name>MSGVAL</name>
                            <description>MsgVal</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "XTD" -->
                        <field>
                            <name>XTD</name>
                            <description>Xtd</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DIR" -->
                        <field>
                            <name>DIR</name>
                            <description>Dir</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID28" -->
                        <field>
                            <name>ID28</name>
                            <description>ID28</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID27" -->
                        <field>
                            <name>ID27</name>
                            <description>ID27</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID26" -->
                        <field>
                            <name>ID26</name>
                            <description>ID26</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID25" -->
                        <field>
                            <name>ID25</name>
                            <description>ID25</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID24" -->
                        <field>
                            <name>ID24</name>
                            <description>ID24</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID23" -->
                        <field>
                            <name>ID23</name>
                            <description>ID23</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID22" -->
                        <field>
                            <name>ID22</name>
                            <description>ID22</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID21" -->
                        <field>
                            <name>ID21</name>
                            <description>ID21</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID20" -->
                        <field>
                            <name>ID20</name>
                            <description>ID20</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID19" -->
                        <field>
                            <name>ID19</name>
                            <description>ID19</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID18" -->
                        <field>
                            <name>ID18</name>
                            <description>ID18</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID17" -->
                        <field>
                            <name>ID17</name>
                            <description>ID17</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "ID16" -->
                        <field>
                            <name>ID16</name>
                            <description>ID16</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
