itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "IF1DTB2_L" -->
                <register>
                    <name>IF1DTB2_L</name>
                    <description>IF1 Data Registers B2</description>
                    <addressOffset>0x26</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DATA_7_" -->
                        <field>
                            <name>DATA_7_</name>
                            <description>Data(7)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DATA_6_" -->
                        <field>
                            <name>DATA_6_</name>
                            <description>Data(6)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IF1DTA2_B" -->
                <register>
                    <name>IF1DTA2_B</name>
                    <description>IF1 Data Registers A2</description>
                    <addressOffset>0x30</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DATA_2_" -->
                        <field>
                            <name>DATA_2_</name>
                            <description>Data(2)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DATA_3_" -->
                        <field>
                            <name>DATA_3_</name>
                            <description>Data(3)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IF1DTA1_B" -->
                <register>
                    <name>IF1DTA1_B</name>
                    <description>IF1 Data Registers A1</description>
                    <addressOffset>0x32</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DATA_0_" -->
                        <field>
                            <name>DATA_0_</name>
                            <description>Data(0)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DATA_1_" -->
                        <field>
                            <name>DATA_1_</name>
                            <description>Data(1)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IF1DTB2_B" -->
                <register>
                    <name>IF1DTB2_B</name>
                    <description>IF1 Data Registers B2</description>
                    <addressOffset>0x34</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DATA_6_" -->
                        <field>
                            <name>DATA_6_</name>
                            <description>Data(6)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DATA_7_" -->
                        <field>
                            <name>DATA_7_</name>
                            <description>Data(7)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "IF1DTB1_B" -->
                <register>
                    <name>IF1DTB1_B</name>
                    <description>IF1 Data Registers B1</description>
                    <addressOffset>0x36</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "DATA_4_" -->
                        <field>
                            <name>DATA_4_</name>
                            <description>Data(4)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <!-- FIELD "DATA_5_" -->
                        <field>
                            <name>DATA_5_</name>
                            <description>Data(5)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
