itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "TREQR1" -->
                <register>
                    <name>TREQR1</name>
                    <description>CAN Transmit Request Registers 1</description>
                    <addressOffset>0x80</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TXRQST16" -->
                        <field>
                            <name>TXRQST16</name>
                            <description>Bit15 of TREQR1</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST15" -->
                        <field>
                            <name>TXRQST15</name>
                            <description>Bit14 of TREQR1</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST14" -->
                        <field>
                            <name>TXRQST14</name>
                            <description>Bit13 of TREQR1</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST13" -->
                        <field>
                            <name>TXRQST13</name>
                            <description>Bit12 of TREQR1</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST12" -->
                        <field>
                            <name>TXRQST12</name>
                            <description>Bit11 of TREQR1</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST11" -->
                        <field>
                            <name>TXRQST11</name>
                            <description>Bit10 of TREQR1</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST10" -->
                        <field>
                            <name>TXRQST10</name>
                            <description>Bit9 of TREQR1</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST9" -->
                        <field>
                            <name>TXRQST9</name>
                            <description>Bit8 of TREQR1</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST8" -->
                        <field>
                            <name>TXRQST8</name>
                            <description>Bit7 of TREQR1</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST7" -->
                        <field>
                            <name>TXRQST7</name>
                            <description>Bit6 of TREQR1</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST6" -->
                        <field>
                            <name>TXRQST6</name>
                            <description>Bit5 of TREQR1</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST5" -->
                        <field>
                            <name>TXRQST5</name>
                            <description>Bit4 of TREQR1</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST4" -->
                        <field>
                            <name>TXRQST4</name>
                            <description>Bit3 of TREQR1</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST3" -->
                        <field>
                            <name>TXRQST3</name>
                            <description>Bit2 of TREQR1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST2" -->
                        <field>
                            <name>TXRQST2</name>
                            <description>Bit1 of TREQR1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST1" -->
                        <field>
                            <name>TXRQST1</name>
                            <description>Bit0 of TREQR1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <!-- REGISTER "TREQR2" -->
                <register>
                    <name>TREQR2</name>
                    <description>CAN Transmit Request Registers 2</description>
                    <addressOffset>0x82</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "TXRQST32" -->
                        <field>
                            <name>TXRQST32</name>
                            <description>Bit15 of TREQR2</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST31" -->
                        <field>
                            <name>TXRQST31</name>
                            <description>Bit14 of TREQR2</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST30" -->
                        <field>
                            <name>TXRQST30</name>
                            <description>Bit13 of TREQR2</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST29" -->
                        <field>
                            <name>TXRQST29</name>
                            <description>Bit12 of TREQR2</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST28" -->
                        <field>
                            <name>TXRQST28</name>
                            <description>Bit11 of TREQR2</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST27" -->
                        <field>
                            <name>TXRQST27</name>
                            <description>Bit10 of TREQR2</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST26" -->
                        <field>
                            <name>TXRQST26</name>
                            <description>Bit9 of TREQR2</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST25" -->
                        <field>
                            <name>TXRQST25</name>
                            <description>Bit8 of TREQR2</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST24" -->
                        <field>
                            <name>TXRQST24</name>
                            <description>Bit7 of TREQR2</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST23" -->
                        <field>
                            <name>TXRQST23</name>
                            <description>Bit6 of TREQR2</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST22" -->
                        <field>
                            <name>TXRQST22</name>
                            <description>Bit5 of TREQR2</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST21" -->
                        <field>
                            <name>TXRQST21</name>
                            <description>Bit4 of TREQR2</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST20" -->
                        <field>
                            <name>TXRQST20</name>
                            <description>Bit3 of TREQR2</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST19" -->
                        <field>
                            <name>TXRQST19</name>
                            <description>Bit2 of TREQR2</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST18" -->
                        <field>
                            <name>TXRQST18</name>
                            <description>Bit1 of TREQR2</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "TXRQST17" -->
                        <field>
                            <name>TXRQST17</name>
                            <description>Bit0 of TREQR2</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
