itzandroidtab/klib-svd/mb9bf566k.svd
                <!-- REGISTER "MSGVAL2" -->
                <register>
                    <name>MSGVAL2</name>
                    <description>CAN Message Valid Registers 2</description>
                    <addressOffset>0xB2</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <!-- FIELDS -->
                    <fields>
                        <!-- FIELD "MSGVAL32" -->
                        <field>
                            <name>MSGVAL32</name>
                            <description>Bit15 of MSGVAL2</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL31" -->
                        <field>
                            <name>MSGVAL31</name>
                            <description>Bit14 of MSGVAL2</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL30" -->
                        <field>
                            <name>MSGVAL30</name>
                            <description>Bit13 of MSGVAL2</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL29" -->
                        <field>
                            <name>MSGVAL29</name>
                            <description>Bit12 of MSGVAL2</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL28" -->
                        <field>
                            <name>MSGVAL28</name>
                            <description>Bit11 of MSGVAL2</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL27" -->
                        <field>
                            <name>MSGVAL27</name>
                            <description>Bit10 of MSGVAL2</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL26" -->
                        <field>
                            <name>MSGVAL26</name>
                            <description>Bit9 of MSGVAL2</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL25" -->
                        <field>
                            <name>MSGVAL25</name>
                            <description>Bit8 of MSGVAL2</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL24" -->
                        <field>
                            <name>MSGVAL24</name>
                            <description>Bit7 of MSGVAL2</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL23" -->
                        <field>
                            <name>MSGVAL23</name>
                            <description>Bit6 of MSGVAL2</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL22" -->
                        <field>
                            <name>MSGVAL22</name>
                            <description>Bit5 of MSGVAL2</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL21" -->
                        <field>
                            <name>MSGVAL21</name>
                            <description>Bit4 of MSGVAL2</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL20" -->
                        <field>
                            <name>MSGVAL20</name>
                            <description>Bit3 of MSGVAL2</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL19" -->
                        <field>
                            <name>MSGVAL19</name>
                            <description>Bit2 of MSGVAL2</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL18" -->
                        <field>
                            <name>MSGVAL18</name>
                            <description>Bit1 of MSGVAL2</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <!-- FIELD "MSGVAL17" -->
                        <field>
                            <name>MSGVAL17</name>
                            <description>Bit0 of MSGVAL2</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>